[
{"heading": [["Telecom industry wary of rushing staff back to office amid continuing rise in Covid cases"]], "sub_heading": [["Bharti Airtel has reopened all its offices though it’s open to staff working from home on health and safety grounds and is also ensuring strict social distancing protocols inside office premises. Reliance Jio though is likely to maintain around 15% staff at major circle offices, and take a call on bringing back more people, post-June 8. "]], "time": [["Last Updated: Jun 02, 2020, 02.57 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Kolkata: ", "Telecom industry", " players are in no hurry to bring back their employees to offices, with the likes of ", "Bharti Airtel", " reopening its offices but capping its workforce inside company premises at 33% on safety grounds even as Covid19 cases continue to mount across India.\n", "\n", "Bharti ", "Airtel", " has reopened all its offices though it’s open to staff working from home on health and safety grounds and is also ensuring strict social distancing protocols inside office premises. ", "Reliance Jio", " though is likely to maintain around 15% staff at major circle offices, and take a call on bringing back more people, post-June 8. \n", "\n", "“Starting this week, Airtel has opened all its offices as per guidelines from relevant authorities, (though) employee strength across all offices is strictly capped to maintain social distancing,” a company spokesperson told ET. He added that “coming to office is voluntary and all Airtel employees could continue to work from home, even while stringent sanitation measures have been put in place across the telco’s offices.\n", "\n", "A senior company executive said the size of Airtel staff inside company premises has been capped at one-third, or 33%, adding that the telco would closely follow Covid19-related guidelines issued by states. \n", "\n", "Reliance ", "Jio", " though is maintaining status quo on staff deployments inside its offices as per the just ended lockdown 4.0 levels, by continuing to deploy around 15% staff to offices in key functions such as networks, sales & marketing, finance, HR and admin, a person with direct knowledge said.\n", "\n", "Telecom tower companies too appear in no hurry to bring back staff to offices since bulk of the field teams, typically, folks involved in operations & maintenance (O&M) have been on the field throughout the lockdowns. “The situation is very fluid, and we will strike a balance between employee safety and business needs before deploying more staff in offices,” a top executive of a leading telecom tower company told ET.\n", "\n", " This, he said, is since the tower company’s O&M teams involved in site acquisitions or in overseeing landlord relationships to support tower network expansion activity are already on the field.\n", "\n", "Network vendors, in turn, are closely monitoring the spread of ", "coronavirus", " in India and signalled that any decision to bring back more teams in non-critical functions to offices would happen only if the number of Covid19 recoveries is sharply higher than the number of people contracting the infection.\n", "\n", "An Ericsson India spokesperson said the Swedish gear maker is “closely monitoring the Covid19 situation in India, and is yet to take any decision on opening up its offices as employee safety is of paramount importance”. Its Pune factory though is operational with requisite staff for meeting local and export commitments, while its network engineers and field staff continue to ensure telco networks run smoothly and connectivity is uninterrupted to customers.\n", "\n", "At press time Vodafone Idea, Reliance Jio, ATC and Nokia did not reply to ET’s queries.\n", "\n"]], "tags": ["Jio", "covid cases", "Airtel", "telecom industry", "coronavirus", "bharti airtel", "reliance jio"]},
{"heading": [["Multinational vendors want consultation on manufacturing-led incentive scheme"]], "sub_heading": [["Gear makers such as Nokia and Huawei say wider consultations are needed before finalising the policy as they have already invested millions of dollars and are hoping to put in more money and export from India."]], "time": [["Last Updated: May 29, 2020, 01.50 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: A move by the ", "telecom", " department to finalise a production-linked incentive scheme to spur local manufacturing of telecommunications equipment without industry consultations has alarmed overseas gear makers. \n", "\n", "Gear makers such as Nokia and ", "Huawei", " say wider consultations are needed before finalising the policy as they have already invested millions of dollars and are hoping to put in more money and ", "export", " from India.\n", "\n", "In a May 14 letter to telecom secretary Anshu Prakash, the ", "Cellular Operators Association", " of India (COAI) said that there has been \"no formal industry consultation by DoT\" (Department of Telecommunications) so far on the proposed scheme or a draft policy.\n", "\n", "It urged the department to immediately start a consultation process and release the policy draft for stakeholders’ feedback. COAI represents telecom carriers Bharti Airtel, Reliance Jio and Vodafone Idea besides multinational equipment makers such as Nokia, Huawei, Ericsson, and ZTE.\n", "\n", "COAI said that a dialogue would help understand the department's plans, since the scheme would involve significant investments and production commitments from equipment makers who could consider availing this scheme. \n", "\n", "\"Several member companies have made large investments in telecom manufacturing in India in the last few years and are looking forward to this scheme to increase production and exports from India,\" COAI director-general Rajan S. Mathews said in the letter.\n", "\n", "ET’s queries to DoT did not elicit any response.\n", "\n", "The policy framework, which is in works, aims to incentivise the companies that undertake telecom equipment manufacturing locally on the lines of a similar scheme announced by the ministry of electronics & IT (MeitY) in April this year for handset production. The initiative would be a part of Prime Minister Narendra Modi's ‘Atmanirbhar Bharat’ or self-reliant India campaign. \n", "\n", "Analysts estimate India's annual telecom equipment revenue at Rs 60,000 crore.\n", "\n", "The PLI scheme, according to a person aware of the matter, would be focussed on futuristic technologies including the fifth-generation or 5G networks, and cover equipment such as optical, antennae, base transceiver stations, in addition to switches and routers.\n", "\n", "Finland’s Nokia and China’s Huawei said they would be happy to provide their inputs.\n", "\n", "\"It calls for a wider industry consultation to ensure that all aspects of the scheme are considered before this ambitious policy is finalised,\" Huawei said in a statement to ET.\n", "\n", "Nokia added that it could provide inputs that could make the proposed policy “more attractive for generating investment in telecom manufacturing\".\n", "\n", "Queries to Ericsson, Samsung and ZTE remained unanswered.\n", "\n", "Experts said that the proposed policy mandate linked to incentives is also likely to benefit homegrown telecom gear makers such as Sterlite Technologies, Vihaan Networks and Tejas Networks, who have been seeking government's intervention since long to discourage imported gear. \n", "\n", "\n"]], "tags": ["multinational vendors", "huawei", "Cellular Operators Association", "Telecom", "export"]},
{"heading": [["Google searching for 5% in Vodafone Idea: Report"]], "sub_heading": [["Apart from a net debt of Rs 1.03 lakh crore, the telco faces balance adjusted gross revenue (AGR) based dues of well over Rs 45,000 crore."]], "time": [["Last Updated: May 29, 2020, 10.19 AM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW DELHI: ", "Google", " is in initial talks to buy a stake of about 5% in cash-strapped Vodafone Idea, India’s third-largest telecom operator, the ", "Financial Times", " reported, citing people familiar with the matter. ", "Vodafone Idea", " was formed in August 2017 by the merger of Vodafone India and Idea Cellular.\n", "\n", "The telco, which has been posting losses since the merger, declined to comment on “this speculation”. Both UK’s Vodafone Group and Idea parent ", "Aditya Birla Group", " declined to comment. Google didn’t respond to ET’s queries. ", "Voda Idea", " shares closed 2.7% higher at ₹5.82 on the BSE Thursday, giving it a market value of ₹16,724 crore. For a 5% stake, Google will have to shell out $110 million (₹836.2 crore) based on that. Its Nasdaq-listed parent ", "Alphabet", " has a market cap of $968.05 billion.\n", "\n", "\n", "Alphabet ended the January-March quarter with ‘cash and marketable securities’ of approximately $117 billion.\n", "\n", "The FT report said Google’s parent Alphabet was in talks to buy a stake in Reliance Industries Ltd’s Jio Platforms but lost out to ", "Facebook", " in closing the deal. “Pursuing Vodafone Idea instead would potentially pit Google against Facebook and an increasingly dominant Jio but the company could also make multiple investments in India,” the report said.\n", "\n", " \n", "\n", "Industry executives and analysts were sceptical about any Google-Vodafone Idea deal.\n", "\n", "“Not sure if this (news report) is correct given the significant leverage VIL (Vodafone Idea Ltd) has and better opportunities are available to Google in Indian telecom space, with lesser leverage,” said Rajiv Sharma, head of research at SBICap Securities.\n", "\n", "Apart from a net debt of Rs 1.03 lakh crore, the telco faces balance adjusted gross revenue (AGR) based dues of well over Rs 45,000 crore. It has also been lagging behind its rivals Reliance Jio Infocomm and Bharti Airtel in all major parameters such average revenue per user (ARPU) and data usage per customer. It has been losing subscriber and revenue market share rapidly since the merger. “But if this is correct, this move by Google would be more to do with Facebook entering the new commerce space, suggesting that Google doesn’t want to be left behind as it may have long-term implications around Google’s market share in digital ad market,” said Sharma.\n", "\n", "Just over a month back, Facebook announced a $5.7 billion investment in Jio Platforms.\n", "\n", "“What’s enigmatic is that why should a universal platform like Google make an investment in VIL for a petty 5% stake? Also, if Google has to counter Facebook-Jio deal, then why not Airtel?” said Sanjay Kapoor, former chief executive of Bharti Airtel for India and South Asia.\n", "\n", "Airtel’s stock recently touched an all-time high on strong India results for the fiscal fourth quarter, backed by the highest ARPU in the industry. Its parent Bharti Telecom earlier this week raised $1.1 billion by selling a 2.75% stake in the telco to overseas and local investors such as Fidelity and Blackrock. But Airtel, with a market cap of `3.07 lakh crore, is far more expensive than Vodafone Idea, and so is Jio Platforms, noted analysts. The Facebook deal valued Jio Platforms at Rs 4.62 lakh crore pre-money enterprise value, which rose to Rs 5.15 lakh crore in subsequent stake sales.\n", "\n", "According to a global analyst, the money that Vodafone Idea would get from a 5% stake sale would not move the needle in terms of the telco’s liabilities, such as the AGR payment. “VIL doesn’t have tech presence. It is a wireless company and does not even have a retail presence,” said the analyst.\n", "\n", "\n", "\n"]], "tags": ["Vodafone Idea", "financial times", "raliance jio", "voda idea", "facebook", "Aditya Birla Group", "google", "alphabet"]},
{"heading": [["Trai says floor pricing talks only after lockdown ends"]], "sub_heading": [["“It may be a better option that any further discussion on the issue (floor tariff) is held after the lockdown is completely lifted and normalcy is restored,” Sharma told ET, virtually ruling out an online open house discussion on the issue, and thus, an early decision on the contentious issue."]], "time": [["Last Updated: May 27, 2020, 08.58 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: ", "Telecom Regulatory Authority of India", " has rejected the telcos’ latest demand to expedite setting of a floor for tariffs by holding the open house discussions online, with chairman RS Sharma saying the watchdog needs to look after consumers who are currently in distress, a view which dealt a huge setback for operators.\n", "\n", "\"It may be a better option that any further discussion on the issue (floor tariff) is held after the lockdown is completely lifted and normalcy is restored,\" Sharma told ET, virtually ruling out an online open house discussion on the issue, and thus, an early decision on the contentious issue.\n", "\n", "He added that the authority is conscious of its mandate, which is to protect the interests of consumers as well as to promote orderly growth of the sector.\n", "\n", "Telecom carriers ", "Bharti Airtel", ", Reliance Jio and Vodafone Idea last week once again pushed the regulator to accelerate the process of fixing floor for service tariffs, saying in the absence of any government relief, this step was key to long-term sustainability of the sector and for carriers to absorb the adjusted gross revenue (", "AGR", ") dues.\n", "\n", "Last week, Bharti Airtel's chief executive (India & SA) Gopal Vittal also said that tariffs remained unsustainably low, and called on the industry watchdog to swiftly ring in a floor price for data services. \n", "\n", "\"Trai is always open to discussion, and has initiated a consultation on the issue on the demand of industry before the pandemic engulfed the country and the whole world. With changed circumstances, most consumers are in severe distress,\" Sharma said.\n", "\n", "Trai, which has been pushing back the idea of a floor price for services, was pushed by carriers into starting a consultation process last December. But the regulator has consistently said that setting a floor for prices was ‘anti-consumer’ and ‘anti-poor’ as it would increase the payout for consumers. The regulator has received comments on the paper, which included opposition from the likes of the Competition Commission of India and the Niti Aayog.\n", "\n", "But telcos have said that the Covid outbreak has underlined the need for a healthy telecom sector, which is capable of making investments, and to that effect, setting a floor price at the earliest was a must. They thus urged Trai to hold online open house discussions, which is the last step in the consultation process before the regulator takes a decision.\n", "\n", "\"We have always examined the issues after following a detailed transparent consultation process, facilitating effective participation of stakeholders,\" Sharma said.\n", "\n", "The telecom service providers want the regulator to fix a floor price for data services, while Trai, in the paper, has said not just a floor price for data but also for voice, and a price ceiling would be up for debate.\n", "\n"]], "tags": ["TRAI news", "india & sa", "Telecom Regulatory Authority of India", "bharti airtel s ceo", "AGR", "bharti airtel", "floor pricing", "latest trai updates"]},
{"heading": [["Bharti Telecom raises Rs 8,433 crores, sells 2.75% in Airtel"]], "sub_heading": [["BTL’s stake in Bharti Airtel fell to around 36% after the deal. Correspondingly, the combined 58.98% holding of Bharti Airtel’s promoter group – Sunil Mittal-owned entities and Singtel – came down to 56.23%. Sunil Mittal’s Bharti Enterprises and Singtel own 50.56% and 49.44%, respectively, in BTL."]], "time": [["Last Updated: May 27, 2020, 07.56 AM IST"]], "publisher": [["ET Bureau"]], "article": [["KOLKATA: ", "Bharti Telecom", " Limited (BTL), the promoter company of ", "Bharti Airtel", ", has raised Rs 8,433 crore ($1.15 billion) by selling a 2.75% stake in the telecom operator to a clutch of overseas investors such as Blackrock, Fidelity, Segantii Capital, Norges Bank and Key Square Capital, and local fund houses including HDFC Mutual Fund and SBI Mutual Fund.\n", "\n", "“On the back of such a strong demand from international and domestic investors, the amount raised was increased to around $1.15 billion (compared with $1 billion initially planned),” Harjeet Kohli, group director, Bharti Enterprises, said in a statement on Tuesday.\n", "\n", "Other overseas buyers include Jane Street and Marshall Wace, and local fund houses such as Birla Mutual Fund and Axis Mutual Fund, said a person aware of the matter.\n", "\n", "“With the proceeds, BTL will become a zero-debt company, providing an even stronger financial flexibility and capacity to provide any additional shareholder support as may be desired by Bharti Airtel from time to time,” Kohli added. \n", "\n", "The allocation was done to more than 50 accounts, with the top 10 getting two-thirds of overall allocation, BTL said in the statement.\n", "\n", "The deal was announced after market hours. Bharti ", "Airtel shares", " closed 5.71% lower on the Bombay Stock Exchange at Rs 559.15, after plunging 6% in intraday trade, in the run-up to the official deal announcement. The floor price of the sale was Rs 558 a share.\n", "\n", "BTL’s stake in Bharti Airtel fell to around 36% after the deal. Correspondingly, the combined 58.98% holding of Bharti Airtel’s promoter group – Sunil Mittal-owned entities and Singtel – came down to 56.23%. Sunil Mittal’s Bharti Enterprises and Singtel own 50.56% and 49.44%, respectively, in BTL. In addition to BTL, the other promoter companies of Bharti Airtel are Indian Continent Investment Ltd, Viridian Ltd and Pastel Ltd.\n", "\n", "The BTL stake sale also lowered the effective shareholding of Bharti Airtel’s promoter group entities, SingTel and the Mittal family, to under 32% from 33.3% and to about 24% from 25.7%, respectively. GIC of Singapore has a 2.79% stake in Bharti Airtel.\n", "\n", "“Bharti Group and Singtel, as Bharti Airtel’s largest shareholders remain committed to the business and the long-term prospects of Bharti ", "Airtel", ",” said the company. It said that in the past few years, the promoters had invested more than Rs 21,000 crore in Bharti Airtel and that they stayed fully committed to investing further in the business as may be required.\n", "\n", "JP Morgan India was the sole agent for the secondary placement.\n", "\n", "“BTL’s 2.75% stake sale in Airtel is mainly to de-lever its balance sheet as dividend payments from the telco are insufficient to service its Rs 8,500 crore debt,” brokerage Jeffries said in a note. It said a BTL stake sale in Bharti Airtel was inevitable as about Rs 6,800 crore of its debt is coming up for repayment in 2020-21.\n", "\n", "BTL said the stake sale proceeds would be used to fully repay its debt, which was raised primarily to finance the acquisition of Bharti Airtel equity shares in the past – in 2016, 2017 and through the Rs 25,000-crore rights issue in March 2019. With BTL becoming a zero-debt company, Bharti Airtel’s credit profile too will be augmented as it would benefit from deleveraging on a consolidated basis including any debt of promoter holding company.\n", "\n", "Despite the fall on Tuesday, Bharti Airtel shares have been among the outliers in a weak overall market amid the Covid-19 outbreak, on the back of strong fourth-quarter results of its India operations. Average revenue per user (ARPU) grew 14% during the quarter, backed by increasing 4G user additions and data consumption, said market experts.\n", "\n", "The past few weeks have seen large fundraisings by Jio Platforms, the parent company of Bharti Airtel’s biggest rival, Reliance Jio Infocomm. The company has concluded deals to raise Rs 78,562 crore from a clutch of investors, including Facebook and private equity players Silver Lake, Vista Equity Partners, General Atlantic and KKR.\n", "\n"]], "tags": ["Airtel", "airtel news", "Bharti telecom", "Airtel shares", "Industry", "bharti airtel", "telecom news"]},
{"heading": [["Strapped govt to fast-track ₹4 Lakh crore of 4G spectrum sale"]], "sub_heading": [["Bharti Airtel and Reliance Jio Infocomm, India’s top two telcos, have been pushing for an early 4G spectrum sale given the surge in demand for data and voice services, and to buy back airwaves in circles where their permits are expiring next year. "]], "time": [["Last Updated: May 28, 2020, 07.32 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: The government is speeding up plans to auction 4G spectrum worth more than ₹4 lakh crore, said a senior government official. An inter-ministerial note being drafted is likely to be presented to the Cabinet as early as next month, the person said.\n", "\n", "Bharti Airtel", " and ", "Reliance Jio Infocomm", ", India’s top two telcos, have been pushing for an early 4G ", "spectrum sale", " given the surge in demand for data and voice services, and to buy back airwaves in circles where their permits are expiring next year. The government, in turn, requires the ", "auction proceeds", " to meet spiralling expenditure needs amid the Covid-19 crisis that has hit revenue.\n", "\n", "“The draft will most likely head for inter-ministerial consultations and then the Cabinet next month. The dates for the auctions will be fixed after those approvals come in,” said the official.\n", "\n", "Another official said both Airtel and Jio have “unofficially intimated” to ", "Department of Telecommunications", " that they need the airwaves as soon as possible. The telcos did not respond to queries.\n", "\n", "\n", "\n", "DoT has already taken a call to split spectrum auctions — 4G airwaves later this year and 5G bandwidth in asubsequent sale, probably in 2021.\n", "\n", "The 4G airwaves in the 700 Mhz, 800 Mhz, 900 Mhz, 1800 Mhz, 2100 Mhz, 2300 Mhz and 2500 Mhz bands will go on the block first. DoT has earmarked the 3300-3600 Mhz band for 5G. The 4G bands on offer, especially 700 Mhz and 800 Mhz, can also be used for next-generation 5G technology at a later stage once that ecosystem develops, experts said.\n", "\n", "Rating firm ICRA said that even without the 5G band, the government will offer 2,475 Mhz of spectrum, valued at Rs 4.35 lakh crore at base price.\n", "\n", " \n", "\n", "\n", "\n", "Analysts don’t expect the next sale to see stiff competition given the overall financial stress in the industry compounded by high debt levels of over Rs 7 lakh crore. Cashstrapped Vodafone Idea is unlikely to take a significant part given its financial troubles.\n", "\n", "The government may generate around Rs 55,000-60,000 crore, of which the telcos would need to pay around Rs 20,000-25,000 crore upfront while the balance will be paid over 16 years, said Ankit Jain, assistant vice president, corporate ratings, ICRA.\n", "\n", "“The top two telcos (Airtel and Jio) will be interested in 4G spectrum as it will help them ease capacity constraints in some pockets,” said Rajiv Sharma, head of research at SBICap Securities. “We do not see Voda Idea adding more spectrum given balance sheet constraints.” Jain said the telcos will focus mainly on renewing spectrum in the 800 Mhz and 1,800 Mhz bands, with “minimal participation” expected in the 700 Mhz band.\n", "\n", "\n", "\n", "Jio needs to buy back Reliance Communications’ 800 Mhz spectrum permits that are expiring in 18 circles in July-August 2021. Jio currently uses these premium 4G airwaves via a sharing pact with RCom.\n", "\n", "Airtel is expected to bid for the 1,800 Mhz spectrum band that it will lose rights over in some markets by 2021 and also selectively load up on some 4G airwaves in urban circles, said analysts. Speaking at its recent fourth-quarter earnings call, Airtel CEO for India and South Asia Gopal Vittal said the carrier needs to improve its 4G airwave holdings by adding pan-India sub-GHz spectrum, or those in the 700 Mhz, 800 Mhz and 900 Mhz bands. He pointed to gaps in key challenger markets such as Kerala, UP-West and Haryana.\n", "\n", "Permits of Vodafone Idea in eight circles are also set to expire in 2021, but it has adequate back-up airwaves following the merger of Vodafone India and Idea Cellular, analysts added.\n", "\n", "ICRA said that with only Rs 20,000-25,000 crore expected in upfront payments from spectrum this financial year, and another Rs 20,000 crore from regular receipts — licence fees and spectrum usage charges — the government is likely to fall short of its budgeted estimate of Rs 1.33 lakh crore as non-tax receipts from the sector.\n", "\n", "\n"]], "tags": ["4g spectrum sales", "Department of Telecommunications", "spectrum sale", "auction proceeds", "Reliance Jio Infocomm", "bharti airtel"]},
{"heading": [["Abu Dhabi state fund in talks to invest $1 billion in Jio Platforms: Sources"]], "sub_heading": [["Jio Platforms, which houses music and movie apps as well a Reliance's telecom venture Jio Infocomm, has secured a massive $10 billion from investors including Facebook within a month."]], "time": [["Last Updated: May 28, 2020, 04.39 PM IST"]], "publisher": [["Reuters"]], "article": [["Abu Dhabi state fund", " Mubadala Investment Company is in talks to invest about $1 billion in ", "Reliance Industries", "' digital unit ", "Jio platforms", ", three sources said.\n", "\n", " ", "Jio", " Platforms, which houses music and movie apps as well a Reliance's telecom venture ", "Jio Infocomm", ", has secured a massive $10 billion from investors including ", "Facebook", " Inc within a month. Reliance did not immediately respond to a request for comment.\n", "\n", " \"Clearly Jio's platform is attracting a wide range of world-class investors, given its enormous potential to serve one of the world's largest marketplaces,\" Mubadala said in an email to Reuters.\n", "\n"]], "tags": ["Jio Platforms", "reliance industries", "Abu Dhabi state fund", "Jio", "facebook", "Jio Infocomm", "reliance jio", "Abu Dhabi"]},
{"heading": [["Vodafone Idea: No proposal before Board on stake sale to Google, but evaluating various opportunities"]], "sub_heading": [["The Financial Times had reported that Google was exploring to buy a 5% stake in Vodafone Idea."]], "time": [["Last Updated: May 29, 2020, 05.07 PM IST"]], "publisher": [["ET Bureau"]], "article": [["MUMBAI: ", "Vodafone Idea", " Friday said that there is no proposal currently before its Board of a ", "stake sale", " to US internet major ", "Google", ", but added that the telco constantly evaluates opportunities.\n", "\n", "“Currently, there is no proposal as reported by the media that is being considered at the Board,” the operator said in a notice to the stock exchanges. \n", "\n", "The statement was put up when a clarification was sought on an ET article that detailed out a report by The Financial Times on Google exploring buying a 5% stake in Voda Idea stake. The new propelled the Vodafone Idea stock over 34% higher to an intraday high of Rs7.85.\n", "\n", "But the stock pared its gains after the telco's clarification to BSE. \n", "\n", "“As part of corporate strategy, the Company constantly evaluates various opportunities for enhancing the stakeholders’ value. As and when such proposals are considered by the Board of Directors of the Company warranting disclosures, the Company shall comply with the disclosure obligations under the ", "SEBI", " (Listing Obligations and Disclosure Requirements) Regulations, 2015 (“SEBI Listing Regulation”),” added the operator,\" Vodafone Idea said.\n", "\n"]], "tags": ["Voda Idea stake sale news", "Stake sale", "Vodafone Idea Stake Sale", "latest voda idea news", "Vodafone Idea", "google", "Telecom", "sebi", "Voda Idea stake sale updates"]},
{"heading": [["Google mulling stake in Vodafone Idea positive but inadequate to solve telcos' debt woes: Analysts"]], "sub_heading": [["Alphabet Inc's Google is said to be eyeing about 5 per cent stake in VIL, the Financial Times had reported on Thursday. Such an investment in VIL will pit the search giant against Facebook which has picked up a stake in Jio Platforms, the firm that houses India's youngest but biggest telecom company - Reliance Jio. "]], "time": [["Last Updated: May 29, 2020, 02.01 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: A potential investment by ", "Google", " into cash-strapped ", "Vodafone Idea", " (VIL), if materialises, will be a strategic positive for the Indian telecom operator, but a five per cent stake would be still be inadequate to solve the telcos' debt problems, analysts said on Friday. Acquisition of a controlling stake by an outsider or a sizable equity infusion by current promoters remains the need of the hour, Credit Suisse said in its latest note. \n", "\n", " ", "Alphabet Inc", "'s Google is said to be eyeing about 5 per cent stake in VIL, the Financial Times had reported on Thursday. Such an investment in VIL will pit the search giant against ", "Facebook", " which has picked up a stake in ", "Jio Platforms", ", the firm that houses India's youngest but biggest telecom company - Reliance Jio. \n", "\n", " Google investment into VIL can be incrementally positive, but a 5 per cent stake is unlikely to move the needle or provide any meaningful relief to VIL's debt problems, said Credit Suisse. \n", "\n", " \"We think unless Google (or any other external investor) looks at acquiring a controlling stake in VIL, the chances of company's longer term survival beyond FY23 (when the moratorium on deferred spectrum debt ends) appear to be low,\" it said. \n", "\n", " Goldman Sachs said that at Vodafone Idea's current market cap, a 5 per cent stake would be valued at USD 100 million or less than one per cent of the company's USD 14 billion-outstanding net debt as of December 2019. \n", "\n", " \"However, we believe that any such investment from a global tech company such as Google could potentially make it easier for VIL to raise capital in the future...,\" it said. \n", "\n", " The adjusted gross revenue (AGR) situation still remains uncertain, and could potentially add as much as 50 per cent to Vodafone Idea's existing net debt of USD 14 billion. In such a scenario, the telcos' ability to generate investor interest is unclear, unless there is complete transparency on its regulatory liabilities, it added. \n", "\n", " The existing high balance sheet leverage suggests VIL would need at least USD 10 billion of incremental capital for net-debt-to-EBITDA (earnings before interest tax depreciation and amortisation) to fall to a level that is in line with global telco peers, in the coming years, it observed. \n", "\n", " A stronger balance sheet could help Vodafone Idea arrest its market share decline in the wireless market, potentially reducing overhang on tower stocks too, the Goldman Sachs note said.\n"]], "tags": ["Vodafone Idea", "Jio Platforms", "facebook", "google", "Alphabet Inc"]},
{"heading": [["US internet giant Google eyes stake in Vodafone Idea: Report"]], "sub_heading": [["Google is reportedly considering to buy a stake of about 5 per cent in Vodafone Idea."]], "time": [["Last Updated: May 29, 2020, 07.05 AM IST"]], "publisher": [["PTI"]], "article": [["Tech titan ", "Google", " is said to be exploring taking a minority stake in British telecom group Vodafone's struggling India business.\n", "\n", "The investment in ", "Vodafone Idea", " will pit the search giant against ", "Facebook", " which has picked up a stake in Jio Platforms, the firm that houses India's youngest but biggest telecom company, Reliance Jio.\n", "\n", "Alphabet Inc's Google is looking to buy about 5 per cent stake in Vodafone Idea Ltd, the Financial Times reported on Thursday. Both companies refused to comment.\n", "\n", "The move by Google follows Facebook and other private equity investors pouring in USD 10 billion in Jio Platforms, which holds billionaire Mukesh Ambani's telecom firm, Jio.\n", "\n", "The move assumes significance as Vodafone Idea Ltd (VIL) -- where Vodafone holds just over 45 per cent stake -- is staring at nearly Rs 58,000 crore in unpaid statutory dues.\n", "\n", "These dues arose after the Supreme Court, in October last year, upheld the government's position on including revenue from non-core businesses in calculating the annual AGR (Adjusted Gross Revenue) of telecom companies, a share of which is paid as licence and spectrum fee to the exchequer.\n", "\n", "The Department of Telecom (DoT's) as per its own submission to the apex court earlier this year seeking relief in payment tenures, had put dues of three telecom companies -- Bharti Airtel, Vodafone Idea and Tata Group at Rs 1.19 lakh crore.\n", "\n", "Against this, Bharti Group had calculated its dues at Rs 13,004 crore, Vodafone Idea at Rs 21,533 crore and Tata Group of companies at Rs 2,197 crore.\n", "\n", "In March, following an approval by the Cabinet, an application was moved before the Supreme Court (on March 16, 2020) seeking its permission for the licensees impacted by the AGR judgement to pay the unpaid amount of the DoT-calculated dues in annual instalments over 20 years.\n", "\n", "Vodafone Idea has been under severe financial pressure, and analysts time and again have cautioned that company's longer-term viability remains under cloud.\n", "\n", "In December, Vodafone Idea Chairman Kumar Mangalam Birla had said Vodafone Idea Ltd may have to shut if there is no relief on the statutory dues. \n", "\n"]], "tags": ["google", "Coronavirus lockdown", "Vodafone Idea", "facebook", "vodafone idea limited"]},
{"heading": [["TRAI proposes 11-digit mobile numbers to meet future needs"]], "sub_heading": [["The telecom regulator on Friday suggested using 11-digit numbers for mobile phones, instead of 10 digits, to ensure adequate numbering resources for user base growth in the future, but advised against migration to a unified numbering system for mobiles and landlines. "]], "time": [["Last Updated: May 30, 2020, 08.13 AM IST"]], "publisher": [["ET Bureau"]], "article": [["New Delhi: The telecom regulator on Friday suggested using 11-digit numbers for mobile phones, instead of 10 digits, to ensure ", "adequate numbering resources", " for user base growth in the future, but advised against migration to a unified numbering system for mobiles and landlines. “Switching from 10 to 11 digits with first digit for mobile number as ‘9’ would give a total capacity of 10 billion numbers,” ", "Telecom Regulatory Authority of India", " (", "Trai", ") said in its recommendations to the telecom department on ways to free up underutilised numbering resources and reallocate them for future needs. “With the current policy of allotment after 70% utilisation, this would suffice till India has seven billion connections. This could mean ", "liberal allocation", " to service providers and administrative ease,” it said.\n", "\n", "Trai also suggested that dataonly use SIM cards used for dongles and some gadgets be shifted from 10-digit numbering to 13-digit numbering allocated by DoT for machine-to-machine (M2M) communication as these SIM cards are not used for voice calls. Mobile numbering resources surrendered by operators that have closed down wireless operations may be reallocated to those carriers in need, but vacating sparingly used fixed line numbers for allocation to mobile services will disrupt fixed line segment that will need large scale change in numbers, the regulator said.\n", "\n", "Moreover, such an exercise will generate numbers to meet the requirements for only a few years, it said. Trai said migration to a unified numbering scheme for fixed line and mobile services is not recommended at this stage as it requires large scale changes in network. “Sparingly used sub-levels in levels (starting with) ‘2’, ‘3’, ‘4’, ‘5’, and ‘6’ may be withdrawn after seeking sub-level-wise utilisation from the operators providing fixed line services and can be used for future allocations,” it said. “After exhausting all the surrendered numbering resources, the existing SDCA codes starting with ‘6’, ‘3’, ‘4’, and ‘2’ may be used for mobile services by suffixing with ‘0’, ‘1’, ‘8’, and ‘9’,” Trai said.\n", "\n", "All users must dial fixed to mobile calls with the prefix ‘0’, giving one month’s time for telcos to implement the new numbering scheme, it said. To speed up allocation of numbering resources in a transparent manner, Trai has recommended DoT to introduce automated allocation using numbering management system software.\n", "\n"]], "tags": ["trai", "liberal allocation", "adequate numbering resources", "Telecom Regulatory Authority of India", "Subscriber identity module"]},
{"heading": [["Why Sunil Bharti Mittal should seek out Google's Pichai, Page & Brin"]], "sub_heading": [["After a tepid start, of late, Bharti too has been bulking up its digital assets incrementally."]], "time": [["Last Updated: Jun 01, 2020, 06.13 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Over the years, ", "Sunil Mittal", ", a feisty campaigner, has mostly chosen his partners well. Singtel has been a consistent ally. Vodafone has been too. Walmart was equally charmed after meeting the Mittal brothers at their Bentonville headquarters and decided to team up. So did Axa for a foray in insurance, Rothschild falmily and then Del Monte Pacific for agribusiness.\n", "\n", "Even Softbank’s maverick founder Masayoshi Son broke break with Bharti, much to the chagrin of ", "Cyrus Mistry", ", the former boss of the Tatas, am told by reliable insiders. And those who forget, Mittal can claim some points for the private equity gold rush to India, having ensured a massive payday for Bharti Airtel's first big investor Warburg Pincus.\n", "\n", "The focus is once again on Mittal in this season of Big tech deal dash to leverage his global network and create a digital moat around flagship Airtel. An eco-system of products and offerings along with strategic allies to take advantage of the changing consumption habits of the world’s largest data consumers who view, listen, shopping and even play on mobile. As consumers too, we would want that as a counter to the Jio juggernaut.\n", "\n", "Fundamentally, Airtel has always believed it is a telecom company in its core much like a Verizon or an Orange or even partner Singtel and there is nothing wrong in that. That said, the management also realises the strategic importance of digital services to enhance customer value, bump up average revenue per user (ARPUs) and even open up new revenue streams and has hence of late has been talking it up. \n", "\n", "The Covid inspired lockdown has upended economic activity but home consumption of data, usage of digital payments and online shopping has seen a massive spurt in the last two months. Truth is, this is a trend that is here to stay.\n", "\n", "After a tepid start, of late, Bharti too has been bulking up its digital assets incrementally. Its digital platform now has around 160 million active users across Airtel Thanks, Wynk, and XStream. Further over 60% of Bharti’s own business is digital channels and has 1.1 million retailers on its Mitra App, as per the senior leadership’s own admission.\n", "\n", "Comparisons with Jio are inevitable but unlike Ambani, Mittal’s model in telecom and digital has always been open source. Stitch up smart service partnership rather than buy them out outright.\n", "\n", "Airtel already has powerful motley in its flank: Netflix to Zee among others for content; Axa and HDFC for financial products to Cisco and Google for enterprise, cyber security, cloud, internet of things offerings.\n", "\n", "And that’s exactly how it should double down. Decide its own sweet spot and ramp them up. Bet on emerging trends like gaming and healthcare. Build, back and even buy.\n", "\n", "There is enough room to play. Payments alone is a $60 billion market opportunity. Some say $1 trillion by 2023. Bharti already has a payments bank and along with its own applications, it has the ability, to collect both cash and digital payments online. With a far healthier balance sheet -- net debt to EBITDA at 2.88 times versus 4.15 times a year back on the back of a series of debt optimisation drives – smart acquisitions of payments companies of scale with beaten down valuations will be opportunistic. Even Son, the biggest supporter of home grown unicorns, would gladly seize upon any consolidation opportunities that are a win-win for all. \n", "\n", "Likewise, it is keen to offer more bundled business to business services. Like Tatas, the bigger marque corporate clients are already with Bharti. And they tend to be stickier. Telcos, say pundits, have cornered 10% of the $35 billion information and telecommunication technology market, and its growing at 5% annually. \n", "\n", "After limited success with its Android mobile operating system, Google too has been on the prowl in India in search of its next billion users for its fast growing enterprise, payments, already among the market leader in 3 years, cloud and speakers offerings. More will follow. Its widely known that it was competing for the Jio deal but lost to Facebook and now there is speculation that it might be exploring an investment in struggling Vodafone-Idea. But Airtel --- with 284 million and growing mobile subscriber base, a pan India fibre and DTH footprint – has far more bang for the buck. \n", "\n", "That’s why Mittal should put in a call to Google’s founders Larry Page and Sergey Brin or CEO Sundar Pichai. Like Microsoft and Jio, Google has already partnered with Airtel to offer it G-Suite, a bouquet of cloud solutions to small and medium enterprises. Its time to take the relationship to the next level. Alphabet, Google’s parent, is sitting on a cash pile of $121 billion, says analyst firm FactSet. Even a $4.4 billion buy-in for a 9.9% in Bharti Airtel by paying a 10% premium to current prices will not be that hard to sell. \n", "\n", "It will however be futile for Bharti to be a Me Too online retailer and take on a troika of Ambani, Walmart and Amazon in a blood fest having vacated that space in the first place. Reliance’s e-commerce play is built on its existing infrastructure of warehouses and physical stores. Even a merger with Walmart or Amazon to create an alternative flank will lead to down a rabbit hole.\n", "\n"]], "tags": ["Mukesh Ambani", "Vodafone Idea", "cyrus mistry", "reliance jio", "sunil mittal", "Data usage"]},
{"heading": [["Abu Dhabi Investment Authority in talks to invest in Jio platforms"]], "sub_heading": [["ADIA follows Mubadala, the sister firm of the UAE’s largest sovereign wealth fund, which has already been in negotiations with Reliance Industries that owns Jio Platforms. It is not clear how much each of the funds will invest. Both entities, along with Saudi Arabia’s sovereign wealth fund Public Investment Fund, may invest close to $2 billion in RIL’s digital business unit."]], "time": [["Last Updated: Jun 02, 2020, 11.02 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi | Mumbai: Abu Dhabi Investment Authority has joined active discussions for a minority stake in Reliance Industries-owned ", "Jio Platforms", " as cash-rich sovereign wealth funds from the Gulf proactively seek out deals around the world, people familiar with the matter said.\n", "\n", "ADIA follows Mubadala, the sister firm of the UAE’s largest sovereign wealth fund, which has already been in negotiations with ", "Reliance Industries", ", the parent of ", "Jio", " Platforms.\n", "\n", "It is not yet clear how much each of the funds will invest. Both entities, along with Saudi Arabia’s sovereign wealth fund Public Investment Fund (PIF), may invest close to $2 billion (Rs 15,000 crore) in Reliance’s digital business unit, the people said. PIF, though,is keen to deploy $1.1-$1.5 billion while the two UAE funds are open to putting in $1-1.25 billion. An announcement is expected shortly, even as early as this week.\n", "\n", "“This is probably the last tranche of stake sales in Jio Platforms. It’s likely to be announced shortly,” one person said. “PIF could be the largest investor in this group.”\n", "\n", " \n", "Even though ADIA invests in technology assets, both publicly listed and private, it is an area where Mubadala plays a far more dominant role. Technology is one of the five sectors being targeted by ADIA’s private equities department, said people familiar with the firm’s plans.\n", "\n", "ADIA is part of a consortium that has been engaged with Reliance for months to buy into its pan-India fibre network. It is also a rare case of both UAE funds scoping the same investment opportunity.\n", "\n", "Reliance has targeted raising Rs 85,000-Rs 90,000 crore from stake sales in Jio Platforms, another person said. It has so far drawn Rs 78,562 crore in planned investments from ", "Facebook", " and private equity funds Silver Lake, Vista Equity Partners, ", "General Atlantic", " and KKR for a combined holding of 17.12%.\n", "\n", "An investment of $1.5 billion could get a stake of just over 2%, experts said. KKR paid Rs 11,367 crore for a 2.32% stake in Jio Platforms, pegging its equity value at Rs 4.91 lakh crore and enterprise value at Rs 5.16 lakh crore.\n", "\n", "ADIA declined to comment on speculation. ET’s emailed queries to Reliance, Mubadala and PIF went unanswered at press time.\n", "\n", "Shares of Reliance rose 3.8% to Rs 1,520.45 on the BSE, outperforming the 2.7% gain in the benchmark Sensex.\n", "\n", "Investment bankers say SWFs from Gulf countries are on the prowl as global valuations have crashed and they are keen to deploy capital in sectors such as technology, communications, healthcare and retail/logistics, which are expected to bounce back faster than many others. Both the UAE and Saudi Arabia are also key political and economic allies of the Narendra Modi government.\n", "\n", "Since inception, ADIA has made about 18 investments in companies, according to data from Crunchbase, ranging from Citigroup to Moderna Therapeutics. It has been a big backer of Indian financial services and renewable companies such as ReNew Power, Greenko, Bandhan Bank and Reliance Nippon Life AMC.\n", "\n", "ADIA is a key sponsor or limited partner to several India and Asia-focussed PE firms including National Investment and Infrastructure Fund, India’s SWF with which it has jointly made a play for GVK’s Mumbai International Airport.\n", "\n", "Parallels are already being drawn with Masayoshi Son’s SoftBank as two of his biggest backers are now courting Mukesh Ambani, chairman of Reliance. In 2017, SoftBank’s $100 billion technology and innovation focused Vision Fund 1 secured commitments of $15 billion from Mubadala and $45 billion from PIF. Earlier in the year, Son had discussed taking his company private with Mubadala and Elliott Management.\n", "\n", "Mubadala, with $229 billion of assets under management, is already an investor in technology firms including AMD and Global Foundries. It opened an office in San Francisco in 2017 and has invested in Silicon Valley entities in partnership with SoftBank as Abu Dhabi, like its oil-rich neighbour, pitches itself as a hub for innovation that is central to the emirate’s economic diversification strategy.\n", "\n", "Analysts said Reliance’s stake sales will help it achieve its zero-net debt ahead of the March 2021 target. At the end of last March, Reliance had outstanding debt of Rs 3.36 lakh crore and cash of Rs 1.75 lakh crore, bringing its net debt to Rs 1.61 lakh crore.\n", "\n", "ET had reported earlier that PIF and Mubadala were closing in on a stake purchase in Jio Platforms. The Reliance unit comprises mostly its telecom business under ", "Reliance Jio", " Infocomm, which is the largest in the country with more than 388 million subscribers.\n", "\n", "Reliance is also raising Rs 53,125 crore through an ongoing rights issue – India’s biggest and the company’s first in almost three decades.\n", "\n", "An IPO for Jio is expected in two years. Reliance has consistently talked about building Jio Platforms into a digital entity on the lines of Alphabet and Tencent.\n", "\n", "Reliance is in talks with Saudi Aramco for selling a fifth of its oil-to-chemicals business in a $15 billion deal and has sold half its fuel retail venture to BP Plc for Rs 7,000 crore, apart from its telecommunication tower business to Brookfield for Rs 25,200 crore.\n", "\n", "The sharp drop in global oil prices this year and demand compression in most global economies could make an Aramco deal difficult, some analysts said. The Brookfield transaction is yet to receive government clearance.\n", "\n"]], "tags": ["Jio", "latest jio updates", "reliance industries", "Jio Platforms", "facebook", "General Atlantic", "reliance jio"]},
{"heading": [["Trai says not recommended 11 digit mobile numbering plan, 10-digit numbers to continue"]], "sub_heading": [["As per Trai recommendation, the country will continue to follow a 10-digit numbering for mobile services, and the regulator has \"categorically rejected\" shifting to an 11-digit mobile numbering plan."]], "time": [["Last Updated: May 31, 2020, 04.35 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Telecom regulator Trai on Sunday said it has not recommended 11 ", "digit mobile numbers", " but only suggested prefixing '0' when mobile numbers are called from landlines.\n", "\n", "The recommendation on prefixing '0' for ", "calls", " from fixed line to mobile numbers will generate 2,544 million additional numbering resources for mobile services to cater to the future requirements, it said.\n", "\n", "As per Trai recommendation, the country will continue to follow a 10-digit numbering for mobile services, and the regulator has \"categorically rejected\" shifting to an 11-digit mobile numbering plan.\n", "\n", "\"Trai has not recommended 11-digit numbering scheme for mobile services,\" ", "the Telecom Regulatory Authority of India", " (Trai) said in a statement.\n", "\n", "Trai has recommended a ", "dialling prefix", " '0' while making a call from a fixed line number to mobile number, the statement said, adding that introduction of a dialling prefix for a particular type of call \"is not akin to increasing the number of digits in the telephone number\".\n", "\n", "\"This change in dialling pattern will generate 2,544 million additional numbering resources for mobile services to cater to the future requirements,\" it added.\n", "\n", "The regulator on Friday had said that migration to a unified or single numbering scheme for fixed line and mobile services is not required for now and that sufficient numbering space can be created by various methods, including prefixing '0' for all fixed to mobile calls.\n", "\n", "Trai while releasing its recommendations on \"ensuring adequate numbering resources for fixed line and mobile services\" had felt that there needs to be no change in dialing plan for fixed-to-fixed, mobile-to-fixed, and mobile-to-mobile calls.\n", "\n", "It has also recommended that a revised and new National Numbering Plan (NNP) should be issued at the earliest, and has made suggestions on ways to free up unutilised capacities, to create space for mobiles services.\n", "\n", "During the course of the consultation, most of the operators had opposed 11-digit numbering for mobile numbers, arguing that an 11-digit numbering scheme would incur massive configuration modifications including software and hardware, involve additional cost for the players, and cause confusion and inconvenience to the customers.\n", "\n", "\"The authority is of the opinion that some serious problems are anticipated with change in the mobile number from 10 digits to 11 digits. This would require widespread modifications in the configuration of switches involving cost.\n", "\n", "\"This would also cause inconvenience to the customers in the form of dialing extra digit and updating phone memory. This could lead to more dialing errors, infructuous traffic, and loss of revenue to the operator,\" the regulator had explained in its recommendations. \n", "\n"]], "tags": ["dialling prefix", "digit mobile numbers", "calls", "Mobile phone", "landline", "the telecom regulatory authority of india"]},
{"heading": [["Airtel terminates call centre services from Karvy for alleged breach of rules, pact"]], "sub_heading": [["The development follows several notices sent by Airtel, the latest being May 21, demanding Karvy to rectify tax defaults and submit documentary proof of compliance within seven days of issuing the notice, to which Karvy did not respond. ET has seen a copy of the emails."]], "time": [["Last Updated: May 30, 2020, 10.45 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Telecom company ", "Bharti Airtel", " has terminated the call center services from ", "Karvy Data Management Services", " due to alleged violation of ", "GST", " law and terms of agreement.\n", "\n", "\".......in exercise of its rights under Article 13 of the Call Center Master Services Agreement dated July 01, 2017 and all other enabling rights, Airtel hereby terminate the Agreements with immediate effect,\" the company said in an email to V Mahesh, Managing Director, Karvy Digikonnect Limited dated May 29.\n", "\n", "The development follows several notices sent by Airtel, the latest being May 21, demanding Karvy to rectify tax defaults and submit documentary proof of compliance within seven days of issuing the notice, to which Karvy did not respond. ET has seen a copy of the emails. \n", "\n", "The telco which avails Karvy's call centre services via its ", "BPO", " in Tiruchirappalli, Tamil Nadu, alleged that the company has \"failed to deposit the taxes with the Government as per law, including the taxes collected from Airtel, which divests Airtel of its right to claim the Input Tax Credit in respect thereof.\"\n", "\n", "Karvy has also allegedly misled Airtel by sharing false information by claiming that it had taken corrective action by uploading invoices and rectification of GST return, whereas, no such information was available on the ", "GSTN portal", ", Airtel said.\n", "\n", "Airtel declined to comment to ET's query whereas Karvy did not respond till the time of filing of this story.\n", "\n", "Airtel also said that Karvy it was only upon Airtel’s intervention by making certain advance payments for the purposes of payment of wages that the due wages were paid by Karvy to its employees for the months of March and April 2020. \n", "\n", "Karvy has also caused financial losses to Airtel as well as loss of reputation and goodwill, Airtel said.\n", "\n"]], "tags": ["BPO", "Karvy Data Management Services", "gst", "GSTN portal", "bharti airtel"]},
{"heading": [["Trai to start discussion on improving speed and reliability of broadband connectivity"]], "sub_heading": [[" The telecom regulator is considering starting an industry-wide discussion on improving speed and reliability of broadband connectivity, as well as strengthening the digital infrastructure, amid a growing remote work culture in wake of the pandemic."]], "time": [["Last Updated: Jun 01, 2020, 08.18 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The telecom regulator is considering starting an industry-wide discussion on improving speed and reliability of ", "broadband", " connectivity as well as strengthening the ", "digital infrastructure", " amid growing remote work culture in the wake of Covid-19 pandemic.\n", "\n", "“The authority is considering initiating a consultation on ways to increase ", "high speed", " and reliable broadband connectivity in the country,” Telecom Regulatory Authority of India (Trai) ", "chairman RS Sharma", " told ET, adding that back-end “digital infrastructure creation is another area of priority” for the regulator.\n", "\n", "“Consequent to the nationwide lockdown, the ‘stay at home’ and ‘work from home’ requirements have necessitated the transformation of many homes into remote offices, virtual conference rooms, online schools for children and, in some cases, video streaming hubs for the entertainment of the family,” said Sharma.\n", "\n", "India’s mobile and broadband networks have come under severe pressure, with a large chunk of the country’s workforce working from home since mid-March following advisories to contain community transmission of the contagious novel Coronavirus.\n", "\n", "Trai data showed that mobile broadband speeds during March and April fell sequentially, as data demand surged. As per industry estimates, data demand increased about 20% on average since the pandemic broke out. Mobile devices account for about 97% of broadband connections in the country and are crucial in supporting work from home.\n", "\n", "“As we practice social distancing and self-quarantine, the only way to maintain a semblance of normalcy is to connect remotely,” said Sharma. The most important requirement for current needs is high-speed and reliable broadband connectivity, he said.\n", "\n", "India’s active internet user base has been expanding rapidly. A report by Cisco showed that India is expected to have more than 907 million internet users by 2023, up from 398 million in 2018. A Trai report said that India had 688 million internet subscribers at the end of September 2019 – the latest month for which data is available – of which broadband and narrowband user base stood at 625.42 million and 62.20 million, respectively.\n", "\n", "The industry has called upon the government to allocate fresh spectrum resources, create more Wi-Fi hotspots and enable fast-track fibre roll-outs on a war footing to grapple with the jump in India’s home internet consumption, especially if the pandemic lasts for several months.\n", "\n"]], "tags": ["Chairman RS Sharma", "high speed", "Broadband", "digital infrastructure", "broadband speed", "Internet speed"]},
{"heading": [["DoT extends minimum rollout compliance deadlines to Sept 30, offering relief to Jio, Airtel, Voda Idea"]], "sub_heading": [["The Big 3 telcos were dreading the prospect of stiff penalities of around Rs 50 crore per MRO violation, starting June, as DoT had earlier not extended the compliance timelines beyond May 31, despite repeated reminders from operators. "]], "time": [["Last Updated: May 27, 2020, 02.47 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Kolkata: The Department of Telecommunications (", "DoT", ") on Wednesday extended the compliance deadline of telcos for meeting their ", "minimum network rollout obligations", " (MRO) to September 30 amid continuing lockdowns, invoking the force majeure clause in operator licence rules, providing a temporary reprieve to ", "Reliance Jio", ", ", "Bharti Airtel", " and ", "Vodafone Idea", ".\n", "\n", "The Big 3 telcos were dreading the prospect of stiff penalities of around Rs 50 crore per MRO violation, starting June, as DoT had earlier not extended the compliance timelines beyond May 31, despite repeated reminders from operators.\n", "\n", "“Due to (an) unforeseen situation in the wake of Covid19, the force majeure clause of the (telco) licence is applied and relaxations are being granted to licensees whose due date of registration for fulfilment of MRO is between March 25 and September 30,” said a DoT circular, dated May 27, to all operators. It added that the last date of registration for telcos to meet their minimum rollout obligations without levy of liquidated damages (LD) is September 30.\n", "\n", "ET has seen a copy of the DoT circular.\n", "\n", "Mobile phone companies though had urged DoT to extend the MRO compliance timelines by at least six-to-nine months amid the Covid19 lockdowns. Under the MRO compliance process, telcos need to make submissions to DoT on the meeting of network rollout targets, post allocation of spectrum, in their licenced service areas. The MRO compliance timelines are linked to the specific spectrum band assigned to a telco and the date of allocation of such airwaves.\n", "\n", "Telcos had urged the government to ease MRO compliance deadlines as network gear imports and supplies were severely hit amid the global pandemic outbreak and lockdowns. The situation could get further aggravated with Finnish gear maker ", "Nokia", " temporarily shutting down its factory in Sriperumbudur, Tamil Nadu, after 42 staffers reportedly tested Covid19 positive. \n", "\n", "Rajan Mathews, director general of the Cellular Operators Association of India (COAI), had recently written to DoT, noting that since the MRO exercise is a time-bound process with huge penalties for delay, it would be unfair if telcos were to suffer from any of these penalties for a situation that could at best be described as force majeure.\n", "\n", "Telcos had sought an extension of compliance timelines as the MRO process is a complex, entailing numerous tower site acquisitions, conducting of drive tests and securing of multiple approvals from various state authorities and local municipal bodies, which had been severely hit by the prolonged Covid19 lockdowns. \n", "\n"]], "tags": ["Jio", "Nokia", "minimum network rollout obligations", "Vodafone Idea", "DoT", "bharti airtel", "reliance jio"]},
{"heading": [["COAI says SPV proposal nixed due to lack of consensus; govt not involved"]], "sub_heading": [["\"Unfortunately, the proposal did not pass the test of internal scrutiny among the telcos, so we will have to come up with a different proposal,\" Rajan Mathews, DG, COAI, told ET. The COAI also clarified that neither the government nor the DoT was in any way involved in the plan which was only meant for internal scrutiny among the members of the association."]], "time": [["Last Updated: Jan 23, 2020, 12.06 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Telecom operator association (COAI) said its proposal to set up a Special Purpose Vehicle (", "SPV", "), to aid the financially strained sector has been nixed as one of ", "telcos", " was not on board with the plan. It added that the government was not involved in the proposal.\n", "\n", "\"Unfortunately, the proposal did not pass the test of internal scrutiny among the telcos, so we will have to come up with a different proposal,\" ", "Rajan Mathews", ", director general of the Cellular Operators Association of India (COAI) told ET.\n", "\n", "The COAI also clarified that neither the government nor the Department of Telecommunications (", "DoT", ") was in any way involved in the plan which was only meant for internal scrutiny among the members of the association.\n", "\n", "\"This is not a government proposal, but an internal industry discussion on possible ways to address the financial distress of the industry,\" said Mathews. \" Work - in - progress discussions within the Association should not be construed as Government proposals.\" \n", "\n", "According to a media report, the tentative proposal included creating an SPV which will have equity share of the telcos in the ratio of ", "Airtel", " (32%), Vodafone Idea (31%), Reliance Jio (31%) and ", "BSNL", " (6%), in lieu of license and spectrum payments of Rs 4,83,000 crore, which they will make over to period of 15 years to the SPV, instead of the government. The telcos will also pay their old adjusted gross revenue (AGR) dues to the tune of Rs 1,20,000 crore to the SPV in annual installments.\n", "\n", "The report also said, \"the government may give spectrum worth Rs 1,46,700 crore to the SPV free of cost without any auction,\" where all operators will have equal and non-discriminatory access to ubiquitous 5G network.\"\n", "\n", "\"Ideas such as reduction in LF (License Fee) and SUC (Spectrum Usage Charge) have been requested by the industry for several years. The idea of an SPV fo networks has also been discussed in multiple public forums. The only novel part is to put it all together in a comprehensive proposal,\" Mathews said.\n", "\n"]], "tags": ["Rajan Mathews", "BSNL", "Airtel", "Cellular Operators Association of India COAI", "telcos", "spv", "DoT", "Bharat Sanchar Nigam Limited"]},
{"heading": [["DoT orders no coercive action on defaulting Airtel, Voda-Idea; Pradhan says non-telcos not liable"]], "sub_heading": [["\"The Director of Licensing Finance Policy Wing has issued direction that concerned departments should not take any coercive action against the licensees in case they fail to comply with the Supreme Court order, until further orders,\" an official source told PTI."]], "time": [["Last Updated: Jan 23, 2020, 09.01 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: On a day when the Supreme Court-mandated deadline for Bharti Airtel and ", "Vodafone", " Idea to pay Rs 88,624 crore in past dues ended, the Department of Telecommunications (", "DoT", ") on Thursday decided not to take coercive action against defaulters during pendency of their appeals in the apex court for relaxations in the order.\n", "\n", "While Bharti Airtel and Vodafone Idea did not pay the dues, billionaire Mukesh Ambani-led Reliance ", "Jio", " paid Rs 195 crore to clear all outstanding against it, official sources said.\n", "\n", "Parallelly, Oil Minister Dharmendra Pradhan said the Rs 3-lakh crore sought by the DoT from non-telecom PSUs, such as GAIL, Oil India Ltd and PowerGrid, was a result of \"communication gap\" as these firms are not liable to pay any dues following the Supreme Court's October 24 ruling that non-telecom revenues of ", "telecom", " firms should be included for considering payments of government dues.\n", "\n", "OIL and GAIL, which were not a party to the litigation that led to the October 24 order, filed clarificatory applications in the Supreme Court.\n", "\n", "Following the October 24 order, the DoT had sought Rs 1.47 lakh crore from Bharti Airtel, Vodafone Idea and 13 other telecom companies. Parallelly, it raised a demand of Rs 1.72 lakh crore from gas utility GAIL India Ltd, Rs 48,000 crore from Oil India Ltd, Rs 40,000 crore from PowerGrid, Rs 15,019 crore from Gujarat Narmada Valley Fertilizers and a few more demands on firms such as RailTel.\n", "\n", "Official sources said the director of the licensing finance policy (LFP) wing has issued a direction that departments concerned should not take any coercive action, until further orders, against the licensees in case they fail to comply with the Supreme Court order.\n", "\n", "Bharti Airtel and Vodafone Idea, whose review petitions against the October 24 order was rejected by the Supreme Court last week, communicated to the DoT that they will not pay the dues by the deadline and will instead away for the outcome of the subsequent modification petition filed seeking relaxation in payments, they said.\n", "\n", "The petition is listed for hearing in the Supreme Court next week.\n", "\n", "Tata Communications, in which the government holds 26.12 per stake, has also made no provision for the DoT's demand of Rs 6,633 crore.\n", "\n", "\"We are in discussion with the telecom ministry. We had given them our reply (on the demand raised),\" Pradhan told reporters here. \"Possibly because of a communication gap, the Government of India's one department has raised such demand on PSUs under another government department.\"\n", "\n", "He said parallel to discussions with the DoT, the Supreme Court has been approached on the issue.\n", "\n", "The government's demand from such companies increased many times more than their net worth and the Centre asked them to go to the Supreme Court against such dues. While Oil India Ltd filed a clarificatory/ modificatory petition on Wednesday, GAIL approached the apex court on Thursday.\n", "\n", "\"Where is GAIL in core telecom business? Is PGCIL in core telecom work or does Oil India do any core telecom job,\" he asked. \"We feel there is no liability (following the October 24 Supreme Court ruling) on these companies.\"\n", "\n", "Pradhan said the approach to the Supreme Court and discussions with the DoT were being conducted simultaneously.\n", "\n", "He, however, did not say if seeking relief from the Supreme Court was limited to PSUs under his ministry filing pleas in the apex court or his ministry would also file a petition.\n", "\n", "The DoT raised the demands on the non-telecom PSUs for leasing out surplus optical fibre network that was primarily for their internal communications under NLD (National Long Distance Service) licenses or IP-1/IP-2.\n", "\n", "The demand notices by the DoT follow the Supreme Court's October 24 order that broadened the definition of adjusted gross revenue (AGR) for telecommunications companies to include non-core operations. AGR is used as a basis for the calculation of license fees and spectrum usage charges owed to the government. GAIL, Oil India, PowerGrid and other non-telecom PSUs were not a party to this litigation.\n", "\n", "Telecom companies owe the government Rs 92,642 crore in unpaid license fee and another Rs 55,054 crore in outstanding spectrum usage charges. These liabilities arose after the Supreme Court in October held that non-telecom revenues have to be considered for calculating statutory dues.\n", "\n", "Outstanding SUC (spectrum usage charges) dues of various telecom service providers as on October 31, 2019, added to Rs 55,054 crore.\n", "\n", "The government has directed the licensees to make the payments in accordance with the order of the Supreme Court dated October 24, 2019, and submit requisite documents within the stipulated time frame.\n", "\n", "In the case of Bharti Airtel, the liabilities added up to nearly Rs 35,586 crore, of which Rs 21,682 crore is license fee and another Rs 13,904.01 crore is the SUC dues (not including the dues of Telenor and Tata Teleservices).\n", "\n", "In the case of Vodafone Idea, this number stands at a cumulative Rs 53,038 crore, including Rs 24,729 crore of SUC dues and Rs 28,309 crore in the licence fee.\n", "\n", "Stating that it earned a cumulative revenue of Rs 1.47 crore from the leasing of spare bandwidth capacity, OIL in its petition to the Supreme Court stated that it will have to shut down operations if it is forced to pay an amount that is twice its net worth.\n", "\n", "From gas utility GAIL, the DoT has sought Rs 1,72,655 crore in dues on IP-1 and IP-2 licences as well as internet service provider licence. In response, GAIL said it earned only Rs 35 crore from trading spare bandwidth. \n", "\n"]], "tags": ["AGR News", "Jio", "DoT", "Telecom", "DoT AGR dues", "Vodafone"]},
{"heading": [["Trai extends comments deadlines on net neutrality rules paper"]], "sub_heading": [["Earlier this month, the Trai had sought views for a roadmap on reasonable Internet traffic management practices that don’t infringe on rules around a free Web or hurt the consumer. It had also sought views on the governance structure of a proposed multi-stakeholder body that would advise the DoT on ways to monitor and apply net neutrality rules."]], "time": [["Last Updated: Jan 30, 2020, 05.52 PM IST"]], "publisher": [["ET Bureau"]], "article": [["The telecom regulator has extended the deadline for stakeholder comments and counter-comments on its discussion paper on framing reasonable Internet ", "traffic", " management practices, and also the governance structure of a multi-stakeholder body that will advise ", "government", " on monitoring and applying ", "net neutrality", " rules.\n", "\n", "The ", "Telecom Regulatory Authority of India", " (Trai) in a statement Thursday, has now sought comments by February 13 instead of January 30, and counter-comments by February 27 instead of February 13, following requests from stakeholders.\n", "\n", "Earlier this month, the Trai had sought views for a roadmap on reasonable ", "Internet", " traffic management practices that don’t infringe on rules around a free Web or hurt the consumer. It had also sought views on the governance structure of a proposed multi-stakeholder body that would advise the ", "Department of Telecommunications", " (DoT) on ways to monitor and apply net neutrality rules.\n", "\n", "Trai’s paper had come more than two years after it had recommended net neutrality rules that backed an open Internet. It had suggested having a mechanism for reasonable Internet traffic management to ensure quality of services while preserving security of networks and providing for emergency services. There should also be provisions to implement court orders and government directions, as long as they are transparent and their impact on users is declared, it had said.\n", "\n", "Trai is now attempting to define the framework for traffic management.\n", "\n", "The regulator had recommended a free and open Internet in an August 2017 paper, which the telecom department accepted a year later. Amending the telecom licence rules in 2018 to incorporate the net neutrality guidelines had helped rest a heated debate in India on this globally controversial topic.\n", "\n", "In the latest paper, Trai has advocated a reality check on current traffic management practices of ", "telcos", ", and sought views on the need for a framework to thrash out a comprehensive list of reasonable practices for effectively tracking and enforcing net neutrality.\n", "\n", "It has also sought views on ways to detect net neutrality violations, especially whether methods such as crowd sourcing or sample field measurements could be deployed, or whether an audit of processes undertaken by telcos for avoiding such violations was the way forward. Practices for traffic management would also require review from time to time, it added.\n", "\n", "In 2017, Trai had recommended monetary penalties for breaching net neutrality rules, starting at Rs 50,000 per violation per day but capped at Rs 50 lakh.\n", "\n", "To detect violations, the regulator had at the time mooted the multi-stakeholder body comprising telecom operators, Internet service providers, content providers, civil society organisations and consumer representatives. \n", "\n", "But, in August 2018, while endorsing Trai’s broad recommendations, the government said actual monitoring and enforcement of the rules would remain with the Department of Telecommunications. The proposed multi-stakeholder body would play only an advisory role, it had said.\n", "\n"]], "tags": ["Government", "Department of Telecommunications", "Telecom Regulatory Authority of India", "telcos", "Net neutrality", "Internet", "traffic"]},
{"heading": [["PIL against DoT call not to penalise telcos is mala fide"]], "sub_heading": [["Crying Foul After consumer group accuses Vodafone Idea and Bharti Airtel of wilfully disobeying SC orders, with COAI playing a part, COAI says petition is only looking to create problems. Airtel and Voda Idea have missed the Jan 23 deadline to pay dues to the government based on an expanded definition of adjusted gross revenue, as ordered by top court. "]], "time": [["Last Updated: Jan 27, 2020, 06.51 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: The ", "telecom", " industry association has decried as “motivated” and with “mala fide interest” a petition filed in the Supreme Court challenging the telecom department’s decision not to take action against ", "Vodafone Idea", " and Bharti ", "Airtel", ", after they missed the deadline to pay statutory dues to the government.\n", "\n", "“This appears to be motivated from sources that have no interest in looking to solve a problem whose solution would benefit the industry, citizens and the country,” Cellular Operators Association of India (COAI) director-general Rajan Mathews told ET.\n", "\n", " \n", " \n", "\n", "The COAI represents all three surviving private telcos — Airtel, Vodafone Idea and ", "Reliance Jio", " Infocomm.\n", "\n", "Airtel and Vodafone Idea have missed the January 23 deadline to pay dues to the government based on an expanded definition of adjusted gross revenue (", "AGR", "), as ordered by the top court. Vodafone Idea, Airtel and ", "Tata Teleservices", " are to pay about Rs 53,000 crore, Rs 35,000 crore and Rs 14,000 crore, respectively. Jio is the only telco to meet the deadline, paying dues of Rs 195 crore last Thursday.\n", "\n", "The Department of Telecommunications (DoT) has, meanwhile, decided not to take “coercive” action against the telcos, as their petition in the top court seeking relaxation in payment period is expected to come up for hearing this week.\n", "\n", "The Save Consumer Rights Foundation on Saturday filed a public interest litigation (PIL) in the Supreme Court, seeking to strike down this decision of the DoT.\n", "\n", "It alleged that the telcos had wilfully disobeyed the court's orders and the COAI had a part to play as well. It added that Airtel and Vodafone Idea, and the DoT were in contempt of the SC’s October 24 order, which had set a three-month deadline for paying up the dues.\n", "\n", "The COAI has termed the judgement as the last straw in the coffin of operators and the statement “clearly establishes the blackmailing tactics of these operators” for avoiding payment of their legitimate dues to the government, said the petition, seen by ET.\n", "\n", "The foundation said it had asked the apex court to quash the directions of the DoT, recover money from the telcos and initiate proceedings against those that had not paid their dues.\n", "\n", "The consumer body said the DoT could have encashed bank guarantees of the telcos in its possession, and subsequently could have cancelled their licences, as per rules. It added that the DoT’s action would “cause huge loss to the public exchequer, which would directly affect the economic rights of the public at large”.\n", "\n", "COAI’s Mathews rejected allegations. “The fact that it (the petition) does not have any reference to the other companies — besides operators — that are also included in this matter, appears to show mala fide interest to create problems, rather than solving it,\" said Mathews.\n", "\n", "He was referring to the fact that even non-telecom companies, such as staterun ", "GAIL", ", ", "Power Grid Corporation", " of India and ", "Oil India", ", have been served demand notices by DoT for AGR dues. The PIL has not named these companies.\n", "\n", "According to analysts, if lossmaking Vodafone Idea was to be forced to pay up the entire dues at one go, it would be forced to shut down. In such a scenario, Jio and Airtel will benefit most from a private sector duopoly in the market.\n", "\n", "The Supreme Court on October 24 widened the definition of AGR to include noncore items and asked telcos to pay their dues by January 23. This meant 15 telcos had to pay additional licence fees, spectrum usage charges (SUC), interest and penalty dues of more than ?1.47 lakh crore by January 23. Licence fees and SUC are calculated on the basis of AGR. Of the 15, Vodafone Idea, Airtel and Jio are the only surviving private telcos in India.\n", "\n", "Vodafone Idea and Bharti Airtel had filed review petitions which were dismissed by the top court. Then, they filed for modification of the deadline and that petition is scheduled for hearing this week.\n", "\n", "DoT, in the interim, directed its circle offices not to take any coercive action against the telcos who had missed the payment deadline.\n", "\n"]], "tags": ["Airtel", "Telecom", "AGR", "tata teleservices", "Power Grid Corporation", "Vodafone Idea", "Oil India", "reliance jio", "gail"]},
{"heading": [["Regulating OTT players complicated: Trai"]], "sub_heading": [["Trai has realised that it is no longer a financial arbitrage issue between telcos and apps, but one of security and lawful interception. There is also an absence of a global example of similar rules and the regulator needs to factor in clauses in the upcoming data protection law and social intermediary guidelines before making any recommendations."]], "time": [["Last Updated: Jan 30, 2020, 11.43 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The issue of whether to regulate communication apps, known as over-the-top (", "OTT", ") players, isn’t likely to be resolved any time soon given that the matter is far more complicated than earlier thought, officials said.\n", "\n", "The telecom regulator has realised that it is no longer a financial arbitrage issue between telcos and apps, but one of security and lawful interception. In addition, there is an absence of a global example of similar rules to govern apps and the regulator needs to factor in clauses in the upcoming data protection law and social intermediary guidelines before making any recommendations.\n", "\n", "“It started as an economic issue, but then as the consultation went along, the issue changed and it’s become more of a security and lawful enforcement matter,” a senior official at the ", "Telecom Regulatory Authority of India", " told ET.\n", "\n", "While telcos are required to allow lawful interception by security agencies, communication apps are not bound by similar rules.\n", "\n", "Telcos want regularity parity with such apps, saying they were free network riders that eroded their revenue by offering similar services for free without having to pay levies such as licence fees. App companies oppose any move to be regulated, saying they are already governed under the IT Act and such a move would stifle innovation.\n", "\n", "Following demands from telecom operators, the watchdog came out with a consultation paper on the regulation of communication OTT players such as ", "Facebook", ", ", "WhatsApp", ", Viber and ", "Google", " in March 2015.\n", "\n", "Trai", " started another consultation in November 2018 on whether regulating communication apps was necessary, but the regulator is yet to come out with its recommendations. Officials said Trai is principally of the view that regulatory imbalances between telcos and communication apps should be addressed. But the task is complicated.\n", "\n", "“We figured out that OTT providers such as WhatsApp’s architecture by design is not meant for interception and is end-to-end encrypted…(the) intermediary does not participate in the encryption process,” a second official said.\n", "\n", "WhatsApp, with over 400 million users, is the largest communication app operating in India. Trai has found that no country has done anything to regulate communication apps.\n", "\n", "“Australia has made a law that says intermediaries will have to provide for encryption… but that’s only a law, they have not enforced the law deliberately because of issues around interception of messages on WhatsApp,” said the official.\n", "\n", "Adding to the complexity of the issue is the upcoming data protection law and social intermediary guidelines, the officials said.\n", "\n", "“Who are intermediaries, what are their liabilities? US laws talk about a safe harbour, that the intermediary is not liable. But here, intermediaries may be made liable under new guidelines, but one would have to understand it,” the official said.\n", "\n", "The government wants WhatsApp to allow traceability of messages that lead to criminal activities, but the US social media major has pushed back, saying it can’t do so due to its privacy rules.\n", "\n"]], "tags": ["trai", "WhatsApp", "facebook", "Telecom Regulatory Authority of India", "google", "OTT"]},
{"heading": [["Trai defends spectrum pricing; says up to companies to decide if they want to buy"]], "sub_heading": [["Trai's views assume significance as Bharti Airtel, earlier this month, made it clear that it will not buy 5G spectrum in the upcoming auction if its base price is fixed at Rs 492 crore per megahertz as recommended by the telecom regulator. Trai chairman RS Sharma said that it is up to the cos to participate in the auction.  "]], "time": [["Last Updated: Feb 12, 2020, 03.37 PM IST"]], "publisher": [["PTI"]], "article": [["Telecom regulator ", "Trai", " on Wednesday strongly defended its recommendations on pricing of ", "spectrum", ", including 5G airwaves, saying its views had been finalised based on industry feedback, and it is for the individual stakeholders to decide whether to participate in the auction or not.\n", "\n", "Trai's views assume significance as Bharti ", "Airtel", ", earlier this month, made it clear that it will not buy 5G spectrum in the upcoming auction if its base price is fixed at Rs 492 crore per megahertz as recommended by the telecom regulator.\n", "\n", "Minister of State for telecom and IT Sanjay Dhotre had informed ", "Rajya Sabha", " last week that a Draft Cabinet Note has been prepared for the auction of the spectrum, and that the document is under consideration within the Department.\n", "\n", "\"I don't react on decisions that individual companies take. Trai has recommended the reserve pricing after taking into account the feedback and comments from various stakeholders and has given that to the ", "government", ".\n", "\n", "\"The government has also apparently accepted those reserve prices and it is for the government to decide on the timing of the auction,\" ", "Telecom Regulatory Authority of India", " (Trai) Chairman RS Sharma said.\n", "\n", "He was speaking on the sidelines of a joint workshop on `Digital Radio Vision for India' organised by Xperi Corporation and ", "India Cellular and Electronics Association", " (ICEA).\n", "\n", "\"...of course while the government will decide the time of the auction, it is for the stakeholders to decide whether they want to participate in the auction or not. What comment can I give,\" Sharma said when asked about Airtel's recent statement that aired concerns around the high spectrum prices.\n", "\n", "The government is planning to hold next round of spectrum auction in April-May this year. The auction will also include radiowaves for 5G services. The Digital Communications Commission has approved reserve price recommended by Trai but it will be placed before the Cabinet for the final approval.\n", "\n", "Sharma further said the regulator has not been approached by the Department of Telecom (DoT) yet for recommendations on new spectrum bands.\n", "\n", "Asked if the regulator has received a reference for new 5G bands, Sharma said, \"Not yet but as and when they approach us, we will be ready to carry out a consultation\".\n", "\n", "The DoT plans to seek Trai's recommendations on pricing and other modalities for coveted 5G bands of 24.75-27.25 GHz, and late last year a senior government official had said that DoT wants sale of additional bands too in 2020.\n", "\n", "This new 5G chunk is separate from the Rs 5.22 lakh crore spectrum sale plan approved by the Digital Communications Commission on December 20, under which 8,300 MHz of airwaves across 22 circles are set to be put on block in March-April timeframe.\n", "\n"]], "tags": ["trai", "Airtel", "Government", "spectrum", "Telecom Regulatory Authority of India", "Rajya Sabha", "India Cellular and Electronics Association"]},
{"heading": [["DoT still working on final calculation of pending AGR dues"]], "sub_heading": [["According to sources, DoT has detected variation in accounting practices adopted by different circle offices."]], "time": [["Last Updated: Feb 19, 2020, 08.09 PM IST"]], "publisher": [["PTI"]], "article": [["The Department of Telecom is still working on final adjusted gross revenue dues that service providers have to pay as it has detected variation in accounting practices adopted by different circle offices, according to official sources. The licence finance wing of the telecom department (", "DoT", ") on February 3 issued a letter with guidelines to all controller General of Communication Accounts to reconcile ", "AGR dues", " and asked them to give 15 days time to operators for the submission of appeals and documents related to deductions they make in the final payment, sources said. \n", "\n", " The letter was a follow up to a previous note sent by the licence finance wing on December 4 and a follow-up on December 13 to the circles for re-verification of debit voucher reports (DVR). \n", "\n", " \"The department has been facing a challenge in carrying out the revised assessments due to various issues related to DVRs. Telecom operators, including Airtel and ", "Vodafone Idea", ", have challenged many DVRs. \n", "\n", " \"Also, circle offices have not adopted uniform practice in accounting. The DoT has asked them to re-verify DVRs at the earliest in the light of Supreme Court judgement,\" an official source said. \n", "\n", " Telecom operators have been submitting two separate audited details of deduction towards interconnection usage charges and roaming fee to the DoT. In one set, deductions have been claimed by telecom operators on a paid basis while on an accrual basis on the other. \n", "\n", "\"DoT noticed that many Controllers of Communication Accounts have been cherry picking the figures claimed by telecom operators in their final DVRs. In some cases, DoT guidelines regarding deduction verification issued in 2014, 2015 and 2016 have not been followed. There have been cases where one CCA has allowed one kind of deduction and another has disallowed,\" the source said. \n", "\n", " According to estimates prepared by the DoT, Airtel owes nearly Rs 35,586 crore, including licence fee and spectrum usage charges, to the government. \n", "\n", " Vodafone Idea is staring at dues worth Rs 53,000 crore, which includes up to Rs 24,729 crore of spectrum dues and another Rs 28,309 crore in licence fee. Tata Teleservices owes around Rs 13,800 crore, BSNL Rs 4,989 crore and MTNL Rs 3,122 crore. \n", "\n", " While the deadline to make ", "AGR", " payment ended on January 23, 2020 as per Supreme Court order, the DoT has been following up with circle offices to verify DVRs of 10 years starting from 2006-2007 which involve around millions of entries in a quarter and then start verification for 2017-18 and 2018-19.\n", "\n", "The DoT on December 13, 2019, gave 15 days time to submit the re-verified accounts but the same could not be done in absence of uniform guidelines. \n", "\n", "\"The headquarters will also need time to check DVRs once they are submitted by the circle office. Thereafter notice will be sent to telecom operators for submitting appeals and documents related to claims that are not admissible,\" the source said. \n", "\n", "The apex court on February 14 came down heavily on the telecom department for not taking steps to recover statutory dues, estimated to be around Rs 1.47 lakh crore, from operators including ", "Bharti Airtel", ", Vodafone Idea, Tata Teleservices, among others. \n", "\n", " Of Rs 1.47 lakh crore, around Rs 1.13 lakh crore is likely to be recovered, as other companies, which are liable to pay AGR dues, have shut down their businesses. \n", "\n", " ", "Reliance Communications", " and Aircel are going through insolvency proceedings. \n", "\n", "Of the total demand raised, Bharti Airtel, Vodafone Idea and Tata Group have made part payment of about Rs 10,000 crore, Rs 2,500 crore and Rs 2,197 crore, respectively. \n", "\n", "The next hearing of the case is listed for March 17.\n"]], "tags": ["agr dues", "DoT", "Vodafone Idea", "Reliance communications", "bharti airtel", "AGR"]},
{"heading": [["DoT holds meeting as industry seeks movement of essential staff, other waivers for business continuity"]], "sub_heading": [["Representatives from industry bodies like COAI and Tower and Infrastructure Providers Association (TAIPA) as well as telecom operators like Bharti Airtel, Vodafone Idea, Reliance Jio and state-owned telcos attended the meeting called by senior telecom department officials."]], "time": [["Last Updated: Mar 20, 2020, 08.56 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: The ", "telecom", " department on Friday met ", "telcos", " and associations to discuss critical issues around business continuity of communication networks, as industry sought the government's intervention for allowing movement of essential field staff and sought other waivers to keep services up-and-running amid the ", "coronavirus outbreak", ".\n", "\n", "Representatives from industry bodies like COAI and Tower and Infrastructure Providers Association (TAIPA) as well as telecom operators like ", "Bharti Airtel", ", ", "Vodafone Idea", ", ", "Reliance Jio", " and state-owned telcos attended the meeting called by senior telecom department officials.\n", "\n", "\"We are grateful to the ", "DoT", " for convening a meeting today (Friday) to address various issues highlighted by the industry in the light of challenges faced by the industry relative to COVID-19. The DoT was clear that they were keen to work with the industry to ensure our networks remained available 99.99 per cent of the time and customers were not inconvenienced, especially those operating now from their homes,\" Cellular Operators Association of India (COAI) Director General Rajan Mathews told PTI.\n", "\n", "The industry is also pitching for additional spectrum both access and backhaul microwave on a temporary basis to augment capacity given that bigger data pipes will be needed as people work from home.\n", "\n", "The industry has urged DoT to issue directions to states that telecom be treated under essential services and, accordingly, staff and engineers have access to network operations centres, data centres and other critical sites in the event of any lockdown.\n", "\n", "In a letter to DoT on Friday, COAI urged the Department of Telecommunications \"to also instruct term cells to provide necessary relaxations to telecom service providers\".\n", "\n"]], "tags": ["telcos", "Vodafone Idea", "bharti airtel", "reliance jio", "DoT", "coronavirus OUTBREAK", "Telecom"]},
{"heading": [["TRAI issues recommendations on reserve price for auction of FM radio channels"]], "sub_heading": [["TRAI finalised its recommendations after considering all comments received from stakeholders during the consultation process and further analysis of the issues. TRAI recommended that the valuation of FM radio channels in 273 new cities has been worked out as a simple mean of the three valuation approaches."]], "time": [["Last Updated: Apr 11, 2020, 10.16 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: The ", "Telecom Regulatory Authority of India", " on Saturday recommended that the reserve price for ", "FM radio", " channels for 273 new cities has been fixed at 80 per cent of the valuation for each city.\n", "\n", "The reserve price will be 80 per cent of the valuation except for the cities in the northeast region, and Jammu and Kashmir for which it has been fixed at 40 per cent of the valuation for each city.\n", "\n", "The ", "Ministry of Information and Broadcasting", " (", "MIB", ") had sent a letter to ", "TRAI", " in August last year, requesting it to furnish recommendations on fresh reserve price for 283 cities -- 260 new and 23 existing, under FM phase-III policy.\n", "\n", "TRAI finalised its recommendations after considering all comments received from stakeholders during the consultation process and further analysis of the issues.\n", "\n", "TRAI recommended that the valuation of FM radio channels in 273 new cities has been worked out as a simple mean of the three valuation approaches which are based on population of the city, per capita gross state domestic product, listenership of FM Radio, per capita gross revenue earned by the existing FM Radio operators, and market intensity index of various cities.\n", "\n", "\"The reserve price for FM radio channels for each of the 273 new cities has been fixed at 80 per cent of the valuation for each city except for the cities situated in North East (NE) region, Jammu and Kashmir for which reserve price has been fixed at 40 per cent of the valuation for each city,\" TRAI said.\n", "\n", "For 10 cities of 'others' category, having a population less than 1 lakh in the border areas of Jammu and Kashmir and the northeast region, the reserve price is kept as Rs 5 lakh for each channel of each city, the TRAI said. \n", "\n", "\n"]], "tags": ["trai", "Ministry of Information and Broadcasting", "MIB", "Telecom Regulatory Authority of India", "FM radio"]},
{"heading": [["Fix tariff or be prepared for monopoly: Vodafone Idea"]], "sub_heading": [["Vodafone Idea flagged the \"deep financial distress\" in the telecom sector, reflecting in unprecedented decline in revenues. Over the last three years, half a dozen operators have exited by either merging their businesses with existing Telecom Service Providers (TSPs) or declaring bankruptcy, Vodafone Idea Ltd (VIL) rued."]], "time": [["Last Updated: Mar 05, 2020, 06.57 PM IST"]], "publisher": [["PTI"]], "article": [["Troubled ", "Vodafone Idea", " has warned that the Indian telecom market may move towards a position of \"virtual monopoly\" if Trai does not intervene in tariff fixation, while Airtel has cited \"huge existential and financial crisis\" to bat for fixation of floor price for two years.\n", "\n", "Jio has termed the fixation of floor price for data services as \"vital\" for the health of telecom sector, and urged Trai to continue the policy of forbearance for voice services, which it said is the preferred telecom service of the subscribers at the bottom of the pyramid.\n", "\n", "Jio further said hike in floor price should be undertaken gradually and be fixed at Rs 15 per GB for now -- against the prevailing Rs 9 to 12 per GB -- and taken to Rs 20 per GB after six to nine months depending on the data consumption growth.\n", "\n", "In its recent submission to the Telecom Regulatory Authority of India (Trai), Vodafone Idea -- confronted with Rs 53,000 crore in AGR dues, of which it has so far only paid 7 per cent -- flagged the \"deep financial distress\" in the telecom sector, reflecting in unprecedented decline in revenues.\n", "\n", "Over the last three years, half a dozen operators have exited by either merging their businesses with existing Telecom Service Providers (TSPs) or declaring bankruptcy, Vodafone Idea Ltd (VIL) rued.\n", "\n", "\"If the existing financial stress in the sector is not addressed within a short period, it could result in further bankruptcy and exit of TSPs from the market, leading to a state of virtual monopoly and absence of fair competition in the market,\" VIL said in its written submission.\n", "\n", "The telco's comments were in response to Trai's consultation paper on 'Tariff Issues of Telecom Services'.\n", "\n", "Making a strong case for Trai intervention, the company said to address the current financial stress, floor price must be considered for pure data plans, metered data plans and bundled usage plans; and fixed subscription charges for voice only, data only or voice and data subscribers.\n", "\n", "Floor price should also be considered for unlimited usage plan on voice (say plan with 1,000 minutes limit) or data which will construe as a bundled plan; and off-net outgoing calls.\n", "\n", "\"Subject to above, other services, including on-net voice may continue to be under forbearance,\" Vodafone Idea said.\n", "\n", "VIL said that among the telecom companies in the market, the public sector operator has been provided a significant financial assistance to sustain itself.\n", "\n", "In a commentary which clearly underlines extent of the crisis in the sector, VIL said there is a \"very strong likelihood\" of further exits in the Indian telecom sector, and therefore it is likely that India may move towards a position of virtual monopoly.\n", "\n", "Meanwhile, Bharti Airtel has said the industry is facing a huge existential and financial crisis, caused by cut throat competition due to 'below cost' pricing, and that operators have \"bled\".\n", "\n", "The operators have a choice of raising tariffs unilaterally to correct the situation, but that is \"easier said than done\" given the extremely competitive nature of the market.\n", "\n", "Airtel believes the industry needs an unprecedented intervention in terms of orderly conduct of the players.\n", "\n", "\"The only way to realise this orderly conduct for now is through the fixation of floor tariffs,\" it said.\n", "\n", "Airtel said that after two years, however, the industry must go back to tariff forbearance.\n", "\n", "\"Our recommendation is to therefore have a clear time bound floor price which migrates back to forbearance at the end of two years. We believe that once industry health is restored, the Indian consumer will be well served by the innovation that tariff forbearance naturally provides,\" it said.\n", "\n", "The Sunil Mittal-led company said the industry requires over Rs 1 lakh crore (excluding spectrum) in just 18-24 months to expand existing networks.\n", "\n", "\"For operators to themselves act sensibly and raise tariffs is very difficult given the brutal competitive intensity. We therefore believe that a temporary intervention by TRAI for a two year period so as to ensure orderly conduct has become essential to restore a dying industry,\" Airtel said.\n", "\n", "The most critical need for the industry is to restore the financial health, Airtel said, adding that in its estimate even after the recent tariff hike of December 2019, the company will need an additional ARPU (Average Revenue Per User) of Rs 80 for 15 per cent return on capital employed.\n", "\n", "It said that there should not be any specific floor price for voice and voice price may be kept under forbearance.\n", "\n", "\"While we have recommended voice to be under forbearance, there are bundled packs which have unlimited voice. Hence, there will be a requirement to add a voice price component, in order to arrive at the overall floor tariff,\" Airtel said responding to Trai's question on whether there should be a limit on telcos to offer free off-net calls.\n", "\n", "Airtel has recommended including Rs 60 per month towards voice charges in case of bundled pack with unlimited voice.\n", "\n", "\"No limit to be applied on TSPs to offer free off-net minutes. Any charging of calls, outside the unlimited bundle pack, may be left to the discretion of the operator given the broader over-arching recommendation of tariff forbearance on voice,\" it said.\n", "\n", "It has opposed any need for price ceiling, citing among other factors the competitive market.\n", "\n", "Jio, on the other hand, has said that fixation of floor price for data services is vital for maintaining the health of the telecom sector and delivering best value to Indian consumers.\n", "\n", "\"We therefore submit that the data floor should be fixed on the basis of realized revenue from data services. As mentioned by the Authority, the realized revenue ranges from Rs 9 to 12 per GB. The authority should target to improve the realisation at least to Rs 20 per GB,\" Jio said.\n", "\n", "Floor should to be prescribed for data service for all categories -- that is corporate, consumer and segmented, it said.\n", "\n"]], "tags": ["Mobile tariff", "Vodafone Idea", "data prices", "reliance jio", "sunil mittal"]},
{"heading": [["No question of speeding up floor pricing process, no deadline on it: Trai chairman RS Sharma"]], "sub_heading": [["\"We have already floated a consultation paper on the subject of floor pricing… There is no question of expediting the process…There is no such deadline of 1st April on it,\" Trai chairman RS Sharma told ET on Friday. \"Telcos are well within their right to fix a floor if they see an urgent need for it. There is nothing stopping them from doing that,\" he added."]], "time": [["Last Updated: Feb 29, 2020, 07.31 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: ", "Telecom Regulatory Authority of India", " (", "Trai", ") chairman ", "RS Sharma", " rejected calls by phone companies to expedite the consultation process on a ", "floor for tariffs", ". He asked mobile phone operators to set a base price themselves, if they wanted to.\n", "\n", "“We have already floated a consultation paper on the subject of floor pricing… There is no question of expediting the process,” Sharma told ET on Friday. “There is no such deadline of April 1 on it… Telcos are well within their rights to fix a floor if they see an urgent need for it. There is nothing stopping them from doing that.”\n", "\n", "In the midst of financial turmoil due to the adjusted gross revenue (AGR) dues crisis, which exacerbated the stress in the industry stemming from brutal price competition and debt of over Rs 7 lakh crore, telcos have called on the government to set a floor for tariffs urgently — by April 1— among other relief measures, to restore the health of the industry. ET has reported that officials at the highest levels of government have also nudged Trai to expedite the establishment of a floor for tariffs.\n", "\n", "The government is trying to put together relief measures to ensure that the market will continue to have three viable private sector telcos.\n", "\n", "A base price is considered crucial by all operators for restoring the long-term viability of the sector.\n", "\n", "Prodded by the rare unanimity among private telcos Bharti Airtel, Vodafone Idea and Reliance Jio Infocomm and a push from the government, a reluctant Trai floated a consultation paper in December on whether a floor price was needed for voice and data services. It, however, warned that such exercises had historically been dubbed “market distorting” by economists. It also called the move “anti-consumer”.\n", "\n", "The deadlines for filing comments and counters to them have been extended to February 28 and March 13, respectively, from January 17 and 31. The submissions will be followed by open house discussions on the issue, after which the regulator will make its recommendations, all of which usually take two to three months, experts said.\n", "\n", "“We don’t give any deadlines (for Trai’s recommendations). Consultation processes have their own timetables… we have not received any such suggestion from the government (to speed it up),” Sharma said.\n", "\n", "In a recent letter to top government authorities, the Cellular Operators Association of India (COAI) lobby group appealed for a tariff floor from April 1 to improve average revenue per user (ARPU), which it said was much lower in India than what it is in China, Brazil and Russia. ", "COAI", " represents Bharti Airtel, Vodafone Idea and Jio.\n", "\n", "“Floor pricing is imperative to ensure the sector is sustainable, and in a position to bear the deferred spectrum and AGR (adjusted gross revenue) dues, while continuing to invest in world class networks and services,” COAI said in its letter.\n", "\n", "Vodafone Idea, in a separate letter to the government, urged that a floor price be put in place at the earliest. It wants minimum tariffs for mobile data fixed at Rs 35 per GB, around seven-eight times the current price and for calls at 6 paise per minute from April 1, to enable it to pay statutory dues and make its business sustainable. That compares with voice being free in some plans now.\n", "\n", "Bharti Airtel has previously said that ARPU needs to go up initially to Rs 200, and eventually to Rs 300, for which a floor price was needed. Bharti Airtel’s ARPU was Rs 135 in the October-December quarter.\n", "\n", "Telcos and experts said a floor price will help the sector’s revenue recovery, making lenders and investors more confident about its viability.\n", "\n", "The industry was hit by a Supreme Court order in October that said AGR should include non-core items. The ruling left 15 telcos, including Vodafone Idea and Bharti Airtel, facing AGR dues of around Rs 1.64 lakh crore, as per government estimates.\n", "\n", "While Bharti Airtel, with dues of Rs 40,000 crore, is well funded, Vodafone Idea, staring at dues of Rs 57,000 crore, faces an uncertain future, since it hasn’t yet got any relief on payments from either the government or the judiciary, experts said. Bharti Airtel has paid Rs 10,000 crore of its liabilities, while Vodafone Idea has paid Rs 3,500 crore.\n", "\n"]], "tags": ["trai", "Trai chairman", "RS Sharma", "Telecom Regulatory Authority of India", "COAI", "floor pricing", "floor for tariffs", "telecom news"]},
{"heading": [["Telecom industry seeks faster DoT approvals to enable ease of doing business"]], "sub_heading": [["\"There is no immediate impact but the pain point is the volume of gear that needs to be imported to keep networks provisioned with spares and equipment in the next nine to 12 months, may not happen since the industry has not received the ETA certificate from the WPC,\" an industry source on anonymity told ET Telecom."]], "time": [["Last Updated: Apr 16, 2020, 03.38 PM IST"]], "publisher": [[", ETTelecom"]], "article": [["NEW DELHI: Telecom carriers, gear makers and mobile handset companies have sought intervention from the ", "Department of Telecommunications", " (DoT) to fast-track Equipment Type Approval (ETA) process, also a part of ease of doing business to enable imports, deployment and new product launches in the country.\n", "\n", "\"There is no immediate impact but the pain point is the volume of gear that needs to be imported to keep networks provisioned with spares and equipment in the next nine to 12 months, may not happen since the industry has not received the ETA certificate from the ", "WPC", ",\" an industry source on anonymity told ETT.\n", "\n", "The uncertainty around equipment approvals by the department's Wireless Planning & Coordination Wing (WPC) is likely to impact further imports into the country that may also force companies to pay penalties to the customs department.\n", "\n", "Both, the Cellular Operators Association of India (COAI) and the Indian Cellular Electronics Association (IESA) that lobbies for handset makers, have sought arbitration from the department's top officials, and in separate letters dated April 8, seen by ETT, have said that the department's wing has not processed any application since more than a month and that despite the process moving to online.\n", "\n", "\"With the current Covid-19 situation, digitalisation and remote working is gaining more importance and any hindrances on approvals to import products like short-range devices by delaying the approvals will be a counterproductive measure,\" the COAI in the letter said.\n", "\n", "The Delhi-based telco group represents ", "Reliance", " Jio, ", "Bharti Airtel", " and Vodafone Idea in addition to gear vendors such as ", "Huawei", ", ", "Nokia", ", Ericsson, Cisco and ZTE.\n", "\n", "Queries to the Wireless Advisor and Member - T at the Department of Telecommunications did not elicit any response.\n", "\n", "The department's statutory body that offers licensing and regulation, and radiofrequency allocation in coordination with the ", "International Telecommunication Union", " (ITU), typically takes a week's time to approve applications digitally.\n", "\n", "In Septemeber 2018, the department headed by then secretary Aruna Sundararajan had moved the certification and import licensing regime to an online system as a part of ease of doing business policy initiative.\n", "\n", "Meanwhile, on Monday, the representatives of the Delhi-based industry body met telecom secretary Anshu Prakash and other top officials who have, however, assured the group that the issue of timely approval would be addressed expeditiously.\n", "\n"]], "tags": ["Nokia", "huawei", "Reliance", "International Telecommunication Union", "Department of Telecommunications", "WPC", "bharti airtel"]},
{"heading": [["Spectrum auction likely to be held before October without 5G radiowaves"]], "sub_heading": [["\"Four bidders have qualified in the technical round. They include 2 firms that have experience of spectrum auction. In case an experienced firm is selected, then the auction can begin after two months, and in other case, it can begin after 3 months. Based on the plan in process, the auction can start in August-September also, but the timeline will not go beyond October,\" a source said. "]], "time": [["Last Updated: May 18, 2020, 01.54 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: The Department of Telecom (DoT) is likely to hold the ", "spectrum", " auction before October without the frequency band considered suitable for 5G services, according to official sources involved in the process. The department is expected to finalise the auctioneer-- agency that will develop and manage software for the auction -- by May 22 and the timeline will also depend on the firm selected. \n", "\n", " \"Four bidders have qualified in the technical round. They include 2 firms that have experience of spectrum auction. In case an experienced firm is selected, then the auction can begin after two months, and in other case, it can begin after 3 months. Based on the plan in process, the auction can start in August-September also, but the timeline will not go beyond October,\" a source said. \n", "\n", " The source mentioned that DoT is also preparing a Cabinet note to get approval for the auction which does not include spectrum in the frequency range of 3,300 -3,600 Mhz band that was proposed to be used for 5G services. \n", "\n", " The defence ministry has demanded 100 Mhz of spectrum in the 5G radiowaves that leaves DoT with only 175 Mhz for auction. \n", "\n", " \"The discussion is on between DoT and the ", "Ministry of Defence", ". However, several licences of ", "Bharti Airtel", " and ", "Vodafone", " Idea are coming up for renewal and they will need to bid for spectrum to continue their mobile services. Therefore, DoT will need to go ahead with the auction for the rest of the bands,\" the source said. \n", "\n", " The planned auction will put around 8000 Mhz of spectrum under the hammer. This would include 700Mhz, 800Mhz, 900 Mhz, 1800 Mhz, 2100 Mhz, 2300 Mhz and 2500 Mhz bands cumulatively valuing around Rs 3 lakh crore. \n", "\n", " Telecom operators have not been comfortable with what they claim as the high base price of Rs 492 crore per megahertz of ", "5G spectrum", " finalised by the Digital Communications Commission (DCC). \n", "\n", " A task force constituted under the finance ministry too echoed that the 5G spectrum price is too high given the stress in the sector. \n", "\n", " Telecom regulator Trai had initially given recommendation for radiowaves valued at Rs 4.9 lakh crore. Later, DoT included additional spectrum for the auction which would be free from expiration of licences of ", "Reliance Communications", ", Bharti Airtel in 8 circles and Vodafone and ", "Idea Cellular", " in 4 circles each. This addition raised the value of Trai-recommended auction plan to Rs 5.22 lakh crore. \n", "\n", " However, the exclusion of 5G spectrum from the plan has reduced the total value of airwaves to be put on auction to around Rs 3 lakh crore at the base price. \n", "\n", " As per the rules finalised by DCC ,successful bidders will have to pay 25 per cent of the amount upfront for sub 1 GHz, and 50 per cent upfront for higher frequency bands. \n", "\n", " Installment will be spread over a period of 16 years. There will be a two-year moratorium for payment after the upfront amount is given. This means that installment will have to be paid from third year, in 16 annual installments. \n", "\n", " Successful bidders will be required to make only 10 per cent upfront payment for sub-1 GHz band and 20 per cent for above 1 GHz band for the set of spectrum that will not be available after 6 or 12 months and balance before 1 month of their availability, according to the decision taken by DCC.\n"]], "tags": ["spectrum", "idea", "Reliance communications", "ministry of defence", "5g spectrum", "bharti airtel", "idea cellular", "Vodafone"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["trai", "Trai chairman", "RS Sharma", "5g spectrum", "5g airwaves", "telecom regulator Trai"]}
]