[
{"heading": [["Tata Motors resumes operations across all manufacturing plants"]], "sub_heading": [["Around 59 per cent of company's passenger vehicle showrooms, covering 69 per cent of the retail market, have commenced operations, it added."]], "time": [["Last Updated: Jun 02, 2020, 03.28 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Tata Motors", " on Tuesday said it has resumed operations across all its ", "manufacturing plants", " in the country.\n", "\n", "The company has restarted operations at all plants with ", "Jamshedpur facility", " also getting approval on May 27, Tata Motors said in a regulatory filing.\n", "\n", "Around 59 per cent of company's ", "passenger vehicle showrooms", ", covering 69 per cent of the retail market, have commenced operations, it added.\n", "\n", "\"From supply side, 90 per cent of suppliers in ", "commercial vehicle segment", " have received permissions to commence,\" Tata Motors said.\n", "\n", "Of the lot, only 60 per cent have been able to start supplies, it added.\n", "\n", "As of March 31, 2020, the company had cash and cash equivalent of Rs 4,700 crore, and undrawn credit facility of Rs 1,500 crore, the auto major said.\n", "\n", "To further shore up the liquidity, the company has issued commercial papers of Rs 3,500 crore and also raised Rs 1,000 crore through non-convertible debentures (NCDs), it added.\n", "\n"]], "tags": ["Commercial vehicle segment", "manufacturing plants", "Tata Motors", "jamshedpur facility", "passenger vehicle showrooms"]},
{"heading": [["Automobile industry to see double-digit sales decline in FY21: Crisil Research"]], "sub_heading": [["The automobile industry is headed for another year of double-digit sales decline this fiscal, Crisil said."]], "time": [["Last Updated: May 29, 2020, 06.19 AM IST"]], "publisher": [["PTI"]], "article": [["The domestic ", "automobile industry", " is headed for another year of double-digit sales decline this fiscal, given the extended lockdown to contain the ", "COVID-19 pandemic", ", ", "Crisil Research", " said on Friday. Overall sales volume would plunge to multi-year lows, with sales of both passenger and commercial vehicles reaching fiscal 2010 levels, it said. \n", "\n", " For the full fiscal, sales of ", "passenger vehicles", " (PVs) are expected to decline 24-26 per cent as compared with a 21-23 per cent contraction for two-wheelers, according to Crisil Research. \n", "\n", " Commercial vehicles (CVs) sales are expected to decline by 26-28 per cent. However, contraction in tractor sales in the current fiscal is expected to be around 7-9 per cent only, it added. \n", "\n", " \"Automobile sales are running out of steam as urban income sentiment wilts under the pandemic. We assessed around 26,000 companies that have a total employee cost of Rs 7 lakh crore,\" ", "Hetal Gandhi", ", Director, Crisil Research said at a webinar jointly hosted with Crisil Ratings. . \n", "\n", " \"It indicates that over 60 per cent of this cost resides in companies that are expected to see a sharp reduction in revenue growth, and where employees are a meaningful cost head. This is expected to lead to higher risk of job losses or pay cuts,\" Gandhi added. \n", "\n", " According to Crisil Research, what started as a supply-side pain has quickly engulfed the demand side too, with job loss and pay cut fear dampening consumer sentiment. \n", "\n", " A recovery in demand is expected only from the festival season in the third quarter of this fiscal, and largely for two-wheelers and tractors, which have a higher rural share. \n", "\n", " However, PVs and CVs, which have a higher share of replacement demand, are expected to recover only in the fourth quarter, it said. \n", "\n", " Given this, PVs, a big-ticket item with a replacement share of 60-70 per cent, are expected to see purchasing decisions postponed. That's also because the segment has a high finance penetration of 78-80 per cent, and given the income uncertainty, fewer consumers would be willing to take a loan, it said. \n", "\n", " At the other end, CV sales have been languishing under the impact of new axle load norms, and are unlikely to show much recovery till freight demand remains low, it said. \n", "\n", " However, tractors and two-wheelers are likely to see relatively faster recovery in the second half of this fiscal. \n", "\n", " Both the segments will benefit from a bumper rabi production and forecast of a normal monsoon, which augurs well for rural incomes, Crisil Research stated. \n", "\n", " \"A sharp contraction in sales would lead to a decline in average utilisation at the industry level from around 58 per cent to below 50 per cent this fiscal. \n", "\n", " \"In the PV segment, utilisation would roll down from 58 per cent to 44 per cent, in two-wheelers from 65 per cent to 50 per cent, in tractors from 59 per cent to 51 per cent, and in CVs from 51 per cent to 39 per cent,\" Pushan Sharma, Associate Director, Crisil Research, said. \n", "\n", " Within two-wheelers, which have a lower replacement share of around 50 per cent and lower finance penetration of 35-40 per cent, motorcycles are expected to fare better, riding on rural demand, while for tractors, sentiment is only moderately negative as agricultural activity is exempt from the lockdown and the prospects for crop season are better, it said.\n"]], "tags": ["Hetal Gandhi", "passenger vehicles", "Crisil Research", "automobile industry"]},
{"heading": [["Closure of economic activities should have been reviewed carefully: Yamaha"]], "sub_heading": [["The company, which has three plants in the country, said saving human lives is the top priority for any nation but economic activities should not be shut completely."]], "time": [["Last Updated: May 31, 2020, 12.33 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Japanese two-wheeler major ", "Yamaha", " has said that complete closure of ", "economic activities", " should have been reviewed carefully in a large country like India and a proper road map should have been planned to handle the ", "coronavirus", " pandemic in the country. The company, which has three plants in the country, said saving human lives is the top priority for any nation but economic activities should not be shut completely. \n", "\n", " \"We must remember that India is one of the world's largest economy and is also the world's largest two-wheeler market. Complete closure of economic activities in this market as well as other markets in the world has led to a massive depression, the worst since Great Depression in 1920s. The recovery period from such depression will take a long time,\" Yamaha Motor India Chairman ", "Motofumi Shitara", " told in an interview. \n", "\n", " A nationwide lockdown was imposed in the country on March 25 in order to prevent the spread of coronavirus. The lockdown is still in force but with many relaxations, helping industries to resume operations partially. \n", "\n", " He further said, \"I would say the decision to shut down the economic activity completely should have been reviewed carefully and a proper road map should have been planned to handle the crisis which is not only affecting the businesses but the lives of each and every individual involved with it.\" \n", "\n", " Shitara said that with chances of coronavirus never going away, people should be encouraged to work with effective safety precautions in place. \n", "\n", " \"As per the WHO, COVID-19 may never go away. Concerns are growing about a second wave of infections. And perhaps a third. In such a situation, we may have to learn to live with coronavirus and everyone should start thinking in this direction,\" he added. \n", "\n", " Shitara said that while lockdown has certainly helped contain the pandemic but it would be difficult to assess the complete picture whether it has been a complete success. \n", "\n", " \"We are observing that despite the continued lockdown, the states have witnessed a surge in coronavirus cases in the past few weeks,\" he noted. \n", "\n", " Last week, ", "Mahindra Group", " Chairman ", "Anand Mahindra", " had mooted moving away from the term \"lockdown\", saying it needs to have a defined tenure. \n", "\n", " He had stated that lockdown extensions are not just economically disastrous but also create another medical crisis due to its psychological effects. \n", "\n", " When asked to comment on the sales outlook for the two-wheeler industry, Shitara said the current financial year will continue with stifled sales volume owing to low demand due to the prolonged lockdown, disruption in manufacturing operations and supply chain as well as stigma attached to social distancing. \n", "\n", " \"However, the demand is expected to gradually grow from the next fiscal although the total sales volume for the year 2020 will remain the lowest in a decade,\" he noted. \n", "\n", " Shitara said that initiatives like reduction in GST rates on two wheelers would help in triggering demand to some extent. \n", "\n", " He, however, added that there is some ray of hope for the two wheeler industry with various surveys predicting a shift towards personal mobility in the post lockdown period. \n", "\n", " \"Due to aversion from shared or public mobility, it is predicted that demand for personal mobility can be higher,\" Shitara said.\n"]], "tags": ["Yamaha Motor Company", "Yamaha", "Motofumi Shitara", "economic activities", "Anand Mahindra", "coronavirus", "Mahindra Group"]},
{"heading": [["DICV to invest Rs 2,277 cr to expand commercial vehicle production at Oragadam plant"]], "sub_heading": [["The company has signed a memorandum of understanding (MoU) with the Tamil Nadu government, covering Rs 2,277 crore of investments designed to expand its commercial vehicle production, DICV said in a statement."]], "time": [["Last Updated: May 28, 2020, 05.47 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Daimler India Commercial Vehicles", " (DICV) on Thursday said it will invest Rs 2,277 crore to expand ", "commercial vehicle production", " at its ", "Oragadam plant", " near Chennai.\n", "\n", "The company has signed a memorandum of understanding (", "MoU", ") with the ", "Tamil Nadu government", ", covering Rs 2,277 crore of investments designed to expand its commercial vehicle production, DICV said in a statement.\n", "\n", "The fresh investment would generate around 400 jobs, it added.\n", "\n", "\"This is the second MoU that DICV has signed with the Government of Tamil Nadu. It demonstrates our unshakeable confidence in the long-term potential of India as a market for commercial vehicles, and our ongoing commitment to the country as a whole,\" DICV MD and CEO Satyakam Arya said.\n", "\n", "DICV has already invested Rs 5,500 crore on its Oragadam plant.\n", "\n", "Since launching its made-for-India CV brand BharatBenz in 2012, DICV has sold well over 1 lakh trucks and buses in India and abroad.\n", "\n", "The company also exports to around 50 countries, and has already exported more than 30,000 vehicles and 1.25 crore parts. \n", "\n"]], "tags": ["tamil nadu government", "MoU", "Oragadam plant", "Daimler India Commercial Vehicles", "Commercial vehicle production"]},
{"heading": [["Auto majors struggle to convert online bookings to sales"]], "sub_heading": [["Dealers are far from convinced about the digital strategy. While online enquiries have increased in the past few weeks, they’re not getting converted into sales, dealers said. “Web enquiries have overtaken walk-ins and are likely to continue post-Covid,” said Shashank Srivastava, ED, marketing & sales, Maruti Suzuki."]], "time": [["Last Updated: Jun 01, 2020, 06.03 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: With the Covid-19 lockdown having brought automobile sales to nil in April automakers pulled out all stops to woo customers.\n", "\n", "Hyundai, ", "Maruti Suzuki", ", ", "BMW", ", ", "Mahindra", " & Mahindra, ", "Mercedes-Benz", " and ", "Toyota", " all recently announced digital car-buying initiatives. However, companies are yet to see online enquiries translate into major sales of vehicles.\n", "\n", "Dealers", " are far from convinced about the digital strategy. While online enquiries have gone up in the past few weeks for most manufacturers, they’re not getting converted into sales, dealers said.\n", "\n", "“Automobiles continue to be an engaging purchase and take a longer time to buy. Web enquiries have overtaken walk-ins and are likely to continue post-Covid days,” said Shashank Srivastava, ED, marketing & sales, at Maruti Suzuki. “Conversion to sales continue to be the highest for referrals on the back of existing consumer loyalty.”\n", "\n", "Manufacturers said the prevailing conditions are preventing consumers from purchasing cars. The lockdown had stalled economic activity across the country.\n", "\n", "“There is income uncertainty that is pushing consumers to postpone discretionary purchases,” said Vinay Raghunath, head of auto practice at EY.\n", "\n", "EY’s recent study mentions that Indian customers prefer online and contactless modes of purchasing, especially while researching vehicles. However, online sales are rare due to limited awareness, options and flexibility. An integrated ‘phygital’ platform with a digitally enabled agile salesforce will become a critical success criterion to tap into select consumer segments.\n", "\n", "Tarun Garg, director of sales & marketing at Hyundai, which launched its ‘Click to Buy’ online sales platform last January, said that online enquiries are happening, but it's taking longer for consumers to decide and buy. A typical conversion to sales takes more than a month nowadays compared with 15 days earlier.\n", "\n", "Dealers are hopeful that as the lockdown is lifted, customers will become more confident and start visiting dealerships. Manufacturers have mapped 28 touch points in the car-buying process, from start to final purchase, said Nikunj Sanghi, an automotive dealer.\n", "\n", "“While we have digitalised almost 25 points, financing, test drives/registration and delivery need a physical interface. Consumers want to physically see and inspect the vehicle before taking delivery,” Sanghi said, adding that the business module of physical dealerships won’t be eliminated, especially because registration and final deliveries will happen at the dealerships.\n", "\n", "Vinkesh Gulati, VP of the Federation of Automobile Dealers Associations, said online sales in the auto industry won’t be easy. \n", "\n", "Given the Indian auto product line-up, customers will buy vehicles after test drives for quality and performance, unlike their European counterparts.\n", "\n", "Luxury car maker BMW, which introduced four products during the lockdown, said that while web enquiries have been good, conversion to sales has yet to take place because vehicles could not be despatched or delivered.\n", "\n", "Mercedes-Benz, on the other hand, got bookings for 100 cars, a mix of new and pre-owned cars, through its online initiative launched last month, but walk-ins at showrooms were lower.\n", "\n", "Lack of unanimity between car companies and dealers over the online sales approach needs a speedy solution, which would only augur well for the struggling auto industry, experts said.\n", "\n", "\n"]], "tags": ["Maruti Suzuki", "Mahindra", "Dealers", "toyota", "bmw"]},
{"heading": [["Auto industry capex falls by a staggering Rs 26,000 crore in FY20"]], "sub_heading": [["Auto makers including TVS and Ceat have announced capex cuts. Ceat has announced a 33% or Rs 250-crore cut in capex to Rs 500 crore, while TVS Motor has announced a capex of Rs 300 crore down 58% from the Rs 719 crore spent last year. Others like Hero MotoCorp have announced they will defer capacity expansion and other investment plans."]], "time": [["Last Updated: Jun 01, 2020, 10.07 AM IST"]], "publisher": [[", TNN"]], "article": [["CHENNAI: An 18-month slowdown and the pandemic-triggered lockdown has resulted in a sharp decline in planned investment by the automobile industry. The auto and component industry combined will see its overall capex shrink from Rs 31,750 crore in FY19 to an estimated Rs 26,000 crore in FY20 - a drop of 18%, according to a report by Crisil.\n", "\n", "Individual segments will however see a much sharper drop as the BS6 transition investment is already in place and the overall ", "auto industry", " is working with 50% capacity utilisation. \"Between this year and next year, auto OEMs (vehicle manufacturers) will see a capex contraction of 30-35%, whereas component companies may see a contraction of 40-45% depending on their exposure to commercial vehicle market and export,\" said Anuj Sethi, senior director, Crisil Ratings. The reason is because there are \"no major regulation requirements in the next couple of years and even after recovery next year the capacity utilisation will be less than 70% with companies investing only in new model, R&D and electric mobility\".\n", "\n", "Auto makers including TVS and Ceat have announced capex cuts. Ceat has announced a 33% or Rs 250-crore cut in capex to Rs 500 crore, while TVS Motor has announced a capex of Rs 300 crore down 58% from the Rs 719 crore spent last year. Others like Hero MotoCorp have announced they will defer capacity expansion and other investment plans.\n", "\n", "Bosch has announced that it has cut its capex by half due to slowdown in the auto market amid the pandemic. Auto parts makers' trade body ACMA has announced that parts makers will defer planned capex of around $4 billion till 2022 to preserve cash and tide over demand and supply disruptions due to Covid-19.\n", "\n"]], "tags": ["maruti", "Hyundai", "coronavirus", "covid 19", "auto industry", "Car prices"]},
{"heading": [["Hyundai sales decline 79 per cent in May"]], "sub_heading": [["\"The company has made a humble beginning towards normalcy by registering cumulative sales of 12,583 for the month of May,\" HMIL Director (Sales, Marketing & Service) Tarun Garg said in a statement. "]], "time": [["Last Updated: Jun 01, 2020, 01.08 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Hyundai Motor India Ltd", " (", "HMIL", ") on Monday reported a 78.7 per cent decline in total sales at 12,583 units in May. The company had reported sales of 59,102 units in May 2019. \n", "\n", "Domestic sales during the last month were down 83.8 per cent to 6,883 units as against 42,502 units in May 2019. \n", "\n", "The company said it exported 5,700 units during the last month as compared to 16,600 units in May last year. \n", "\n", "\"The company has made a humble beginning towards normalcy by registering cumulative sales of 12,583 for the month of May,\" HMIL Director (Sales, Marketing & Service) ", "Tarun Garg", " said in a statement. \n", "\n", "This performance was possible on account of strong customer interest and demand for products like ", "Creta", ", ", "Verna", " and Venue, he added.\n"]], "tags": ["Hyundai motors may sales", "Hyundai", "Hyundai Motor India Ltd", "verna", "HMIL", "Creta", "Tarun Garg"]},
{"heading": [["Auto sales may slip to 10-yr low amid weak sentiment"]], "sub_heading": [["Passenger vehicles sales are predicted to dip 25% on the low base of FY20 when sales declined 18%. Commercial vehicles sales were predicted to decline 27%. Demand is predicted to sharply rebound in FY22, with a double-digit growth, albeit on the extremely low base. "]], "time": [["Last Updated: May 28, 2020, 11.23 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Mumbai: ", "Automobile", " sales will touch decadal lows in FY21as job losses and salary cuts in urban areas sour consumer sentiment, according to ", "Crisil", " research. Passenger and commercial ", "vehicle sales", " are expected to fall down to 2010 levels. \n", "\n", "Up to 80% of cars are bought through financing and consumers would be hesitant to take a loan in these circumstances. Also, two-third of passenger vehicles sales are from people who are replacing their car, an “unnecessary expense” that could be deferred. \n", "\n", "Passenger vehicles sales are predicted to dip 25% on the low base of FY20 when sales declined 18%. ", "Commercial vehicles", " sales were predicted to decline 27%. Demand is predicted to sharply rebound in FY22, with a double-digit growth, albeit on the extremely low base. \n", "\n", "The fall in demand for automobiles in the short term could be cushioned by vehicle purchase from people being hesitant to use public transport. This will benefit the two-wheeler and used vehicle segments, said Hetal Gandhi, director, Crisil Research.\n", "\n"]], "tags": ["Auto", "Crisil", "Automobile", "vehicle sales", "Auto sector", "Commercial Vehicles"]},
{"heading": [["Maruti extends warranty, service timelines till June end"]], "sub_heading": [["This initiative will give an opportunity to the customers who could not avail the previous service and warranty benefits due to lockdown, the company said. "]], "time": [["Last Updated: May 30, 2020, 04.09 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: The country's largest carmaker Maruti ", "Suzuki", " India (MSI) on Saturday said it has decided to extend warranty and service timelines for customers by a month owing to the current situation. The company has decided to offer the free service, warranty and extended warranty to the customers till June end, whose validity is expiring in May, ", "MSI", " said in a statement. \n", "\n", " This initiative will give an opportunity to the customers who could not ", "avail", " the previous service and warranty benefits due to lockdown, it added.\n"]], "tags": ["maruti", "avail", "msi", "maruti suzuki india", "suzuki"]},
{"heading": [["BMW India resumes operations post temporary suspension due to lockdown"]], "sub_heading": [["Production at Chennai plant has resumed with less than 50 per cent of the regular workforce catering to the production demand in the country, it added. "]], "time": [["Last Updated: Jun 01, 2020, 04.24 PM IST"]], "publisher": [["PTI"]], "article": [["German luxury carmaker ", "BMW", " on Monday said it has resumed operations in accordance with the government guidelines. Consumers can once again safely explore and experience the complete range of BMW, MINI and BMW Motorrad products at company dealerships, ", "BMW Group India", " said in a statement. \n", "\n", " Production at Chennai plant has resumed with less than 50 per cent of the regular workforce catering to the production demand in the country, it added. \n", "\n", " \"It brings us great joy to finally restart operations at our dealerships, plant and corporate office. Customers and prospects can now explore, test-drive and purchase their favourite vehicles in a safe and sanitised environment at our dealerships,\" BMW Group India acting President Arlindo Teixeira said. \n", "\n", " The company continues to see an increase in demand for 3 Series, X1 and Mini Countryman, it added. \n", "\n", " The company's Chennai facility will be instrumental in fulfilling this market demand, he added.\n"]], "tags": ["BMW Chennai Plant", "coronavirus", "BMW Group India", "bmw", "BMW India"]},
{"heading": [["Passenger vehicle demand may drop by almost a quarter in FY21 due to lockdowns: ICRA"]], "sub_heading": [["The rapid spread of COVID-19 across the region and consequent lockdown extension has wiped off volume during the first two months (April-May) of the current fiscal, ICRA said. "]], "time": [["Last Updated: Jun 01, 2020, 08.03 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: Domestic ", "passenger vehicle", " demand may decline by almost a quarter in the current fiscal as against earlier projections of a 10-12 per cent drop due to multiple lockdowns, ratings agency ", "Icra", " said on Monday. \n", "\n", "ICRA in a note also said it continues to have 'negative' outlook on the passenger vehicle (PV) industry since the second quarter of the previous fiscal FY2020 but it can turn to stable from negative if demand environment improves on a consistent basis over the next 12-18 months. \n", "\n", "\"As per ICRA note, the PV passenger demand is now estimated to decline by 22 per cent to 25 per cent in FY2021, as against earlier estimated volume decline of 10-12 per cent in FY2021, post-Lockdown 1.0. The expectation then was that normalcy would return by the second week of May,\" it said. \n", "\n", "However, multiple ", "lockdown", " extensions are having a direct bearing on the economic environment and consumer sentiments. \n", "\n", "The rapid spread of COVID-19 across the region and consequent lockdown extension has wiped off volume during the first two months (April-May) of the current fiscal, ICRA said. \n", "\n", "\"Each lockdown extension by 15 days has taken a toll on full-year industry demand by 3-5 per cent. Given the adverse overall conditions, ICRA continues to have 'Negative' outlook on the PV industry since Q2 FY2020,\" it said. \n", "\n", "According to the note, multiple factors like liquidity crunch and tighter financing environment, weak rural income and overall slowdown in economic activity, consumer sentiments have been negatively impacted. As a result, industry demand has been under pressure over the last few quarters. \n", "\n", "Noting that some signs of recovery visible in the March quarter of FY2020 almost came to a nought post-COVID-19 pandemic outbreak which significantly altered the macro-economic environment. \n", "\n", "ICRA expects ", "GDP", " to decline by 5 per cent in FY21 as compared to earlier 4.7 per cent growth expectation prior to COVID-19 lockdown. \n", "\n", " The rating agency also expects the real income to decline in near-term which will directly impact large discretionary purchases like car, real-estate amongst others. \n", "\n", " \"Compared to our initial expectation of about 50-55 per cent decline in volume during Q1 FY21, the decline could be upwards of 80 per cent, thereby significantly impacting overall volume growth estimate for full year. \n", "\n", " \"While the demand environment is likely to remain weak for next 4-6-months, low base of Q2 FY20 (when wholesale dispatches declined by 29% Y-o-Y) will moderate pace of decline in Q2 FY2021.\"\n"]], "tags": ["gdp", "icra", "lockdown", "passenger vehicle"]},
{"heading": [["Mahindra sales dip 79% in May, exports fall 80%"]], "sub_heading": [["In the domestic market, sales were down 79 per cent to 9,076 units last month compared to 43,056 units in May 2019. Exports during the period under consideration dropped by 80 per cent to 484 units as against 2,365 units in the year-ago month. "]], "time": [["Last Updated: Jun 01, 2020, 02.45 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Auto major Mahindra & Mahindra (M&M) on Monday reported a steep 79 per cent decline in total sales at 9,560 units in May. The company had sold 45,521 units in the same month last year, M&M said in a statement. \n", "\n", "In the domestic market, sales were down 79 per cent to 9,076 units last month compared to 43,056 units in May 2019. \n", "\n", "Exports during the period under consideration dropped by 80 per cent to 484 units as against 2,365 units in the year-ago month. \n", "\n", "In the passenger vehicles segment -- which includes ", "UVs", ", cars and vans -- it sold 3,867 vehicles in May, against 20,608 vehicles in the same month last year, down 81 per cent. \n", "\n", "In the commercial vehicles segment, the company sold 5,170 vehicles as against 17,879 units earlier, a dip of 71 per cent. \n", "\n", "\"Our performance during May has been muted, due to the challenges the industry is facing,\" Veejay Ram Nakra, Chief Executive Officer, ", "Automotive Division", ", M&M Ltd said. \n", "\n", "The company has opened 70 per cent of its dealerships and retail sales have begun, he added. \n", "\n", "\"We are seeing initial traction for our small commercial vehicles and SUV brands such as the Bolero and Scorpio. \n", "\n", "As new lockdown norms are being announced we are hopeful of demand gaining traction in the coming months,\" Nakra said.\n"]], "tags": ["UVs", "Automotive Division", "Mahindra Group", "Mahindra & Mahindra", "M&M Ltd"]},
{"heading": [["Passenger vehicle sales crash to decades low in May"]], "sub_heading": [[" Passenger vehicle sales slumped to their lowest in decades last month amid Covid-19 lockdown."]], "time": [["Last Updated: Jun 02, 2020, 06.32 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: ", "Passenger vehicle sales", " slumped to their lowest in decades last month, as limited production amid disruptions in supplies, shortage of labour and a weak market on the back of the ", "Covid-19 pandemic", " and the ", "lockdown", " hit dispatches from factories.\n", "\n", "Industry estimates put wholesale numbers of passenger vehicles at 37,000 in the local market in May, an 85% fall from a year earlier. In April, production as well as dispatches had come to a complete halt due to the nationwide lockdown imposed to check the spread of the ", "coronavirus", " pandemic.\n", "\n", "Retail sales last month fared better than wholesale numbers, claimed several manufacturers, helping align inventory in the channel. Market sentiment though is expected to remain tepid next couple of months, with some recovery expected only around the festive season towards the end of the calendar year.\n", "\n", "Automakers in India report wholesale dispatches from factories and not retail sales made to customers.\n", "\n", "By the end of May, about half the retail outlets and 80% of workshops had reopened after remaining closed from late March when the lockdown was clamped.\n", "\n", "“The response for new sales is very low as of now although fresh bookings have started,” Federation of Automotive Dealers Association president Ashish Kale said. Most of the deliveries happening now are of vehicles booked before the lockdown, while new demand is mostly for cars and small commercial vehicles (SCVs), followed by two-wheelers, he said. “Financiers are more confident in cars and SCV … as they relook credit norms for all segments. There is negligible demand for heavy trucks as of now,” Kale added.\n", "\n", "The country’s largest carmaker, Maruti Suzuki, sold 13,865 units in the domestic market in May. It exported 4,651 units following the resumption of port operations at Mundra and Mumbai and also sold 23 units to alliance partner Toyota.\n", "\n", "Maruti Suzuki resumed manufacturing operations post lockdown on May 12 at its Manesar facility and from May 18 in Gurgaon. Production also resumed at Suzuki Motor Gujarat, which manufactures cars on a contract basis for Maruti Suzuki, from May 25.\n", "\n", "Rival ", "Hyundai Motor India", " sold 6,883 units. Including exports, it dispatched 12,583 vehicles in May, sales, marketing & service director Tarun Garg said.\n", "\n", "The company said it received 15,000 bookings and delivered 11,000 vehicles to customers last month. Around 850 sales outlets and 1,000 workshops of the company are currently open, it said.\n", "\n", "With the lockdown easing across the country, automakers are hoping demand will improve in June.\n", "\n", "Veejay Nakra, the chief executive of the automotive division at Mahindra & Mahindra, said: “We are seeing initial traction for our small commercial vehicles and SUV brands, such as the Bolero and Scorpio. As new lockdown norms are being announced, we are hopeful of demand gaining traction in the coming months.”\n", "\n", "Mahindra, which said it had 70% of its dealerships now open, sold 3,867 units in May.\n", "\n", "At Toyota ", "Kirloskar Motor", " (TKM), sales in the past month was just 20% of what it would have normally posted, senior vice-president of sales & service Naveen Soni said. The company restarted operations on May 26 and dispatched 1,639 units.\n", "\n", "“However, retail sales have been much higher when compared to wholesales, thereby helping the company reduce the month closing inventory levels at dealerships, Soni said, adding that the company had seen a significant surge in customer orders and enquiries online.\n", "\n", "New entrant ", "MG Motor India", " retailed 710 units in the past month. The company expects to restore normalcy in July, director (sales) Rakesh Sidana said.\n", "\n", "Meanwhile, tractor sales rose, as the farming sector held high hopes amid the pandemic that has crippled the rest of the economy.\n", "\n", "Mahindra registered a 2% increase in tractor sales at 24,017 units in May. Hemant Sikka, president (farm equipment sector) at M&M, said, “The timely relaxation of the lockdown for the agricultural sector helped ensure the speedy recovery of tractor demand during May. In the near term, farmer sentiment is likely to remain positive due to several developments including robust rabi crop production, higher procurement, good price realisations and the forecast of a normal monsoon that bodes well for a good kharif crop.”\n", "\n", "\n", "Domestic wholesale only\n", "*Retail\n", "\n"]], "tags": ["sport utility vehicle", "MG Motor India", "Kirloskar Motor", "Hyundai Motor India", "lockdown", "coronavirus", "Mahindra Group", "Mahindra & Mahindra", "passenger vehicle sales"]},
{"heading": [["With very low sales last month, auto sales may hit record low"]], "sub_heading": [["Industry estimates and numbers released by key auto companies showed vehicle sales at 37,000 in May, an 85 per cent fall from a year earlier. In April, production as well as dispatches had come to a complete halt. Mahindra & Mahindra and MG Motor did a little better than peers with May sales constituting a higher percentage of the February 2020 numbers. "]], "time": [["Last Updated: Jun 02, 2020, 06.48 AM IST"]], "publisher": [["ET Bureau"]], "article": [["New Delhi | Mumbai: ", "Auto companies", " eked out marginal sales in May, with lockdown due to Covid-19 and economic gloom ensuring overall sales hit a decade low.\n", "\n", "Industry estimates and numbers released by key auto companies showed vehicle sales at 37,000 in May, an 85 per cent fall from a year earlier. In April, production as well as dispatches had come to a complete halt.\n", "\n", "Mahindra & Mahindra and ", "MG Motor", " did a little better than peers with May sales constituting a higher percentage of the February 2020 numbers. Mahindra’s May numbers were 35.4 per cent of the February numbers though year-on-year sales fell 81 per cent to 3,867 units. MG Motor’s May sales were 52 per cent of February sales on a low base. ", "Maruti", "’s May numbers, down 89 per cent year on year at 13,865 units, were 10.3 per cent of February sales. Hyundai’s May sales were 17.2 per cent of the February numbers though year-on-year performance saw a whopping 84 per cent drop. \n", "\n", "Tractor sales did very well with Mahindra tractors posting a 2 per cent year-on-year growth at 24,017, a 9.8 per cent increase over February. \n", "\n", "\n", "\n", "Hemant Sikka, president (farm equipment sector) at M&M, said, “Timely relaxation of the lockdown for the agricultural sector helped ensure the speedy recovery of tractor demand during May. In the near term, farmer sentiment is likely to remain positive due to several developments including robust rabi crop production, higher procurement, good price realisations and the forecast of a normal monsoon that bodes well for a good kharif crop.”\n", "\n", "Escorts sold 6,454 tractors against 6,488 in May last year.\n", "\n", "Retail sales last month fared better than wholesale numbers, claimed several manufacturers, helping align inventory in the channel. Market sentiment is expected to remain tepid for the next couple of months, with some recovery expected near festive season.\n", "\n", "Automakers in India report wholesale dispatches from factories, and not retail sales made to customers. By the end of May, about half the retail outlets and 80 per cent of workshops had reopened.\n", "\n", "“The response for new sales is very low as of now although fresh bookings have started,” Federation of Automotive Dealers Association president Ashish Kale said. Most of the deliveries happening now are of vehicles booked before the lockdown, while new demand is mostly for cars and small commercial vehicles (SCVs), followed by two-wheelers, he said.\n", "\n"]], "tags": ["maruti", "auto companies", "M&M", "Mahindra Group", "MG Motor"]},
{"heading": [["Tyre sector may grow 7-9% in 5 years buoyed by demand, lower crude"]], "sub_heading": [["The domestic tyre industry has benefited from strong growth in both original equipment (OE) and replacement segments in the ongoing fiscal."]], "time": [["Last Updated: Dec 31, 2018, 05.39 PM IST"]], "publisher": [["PTI"]], "article": [["The Indian ", "tyre industry", " may log 7-9 per cent growth over the next five year backed by favourable outlook for the domestic automotive industry, rating agency ", "Icra", " said in a note Monday.\n", "\n", "Icra, in the note also forecast the industry to see a capital expenditure of around Rs 20,000 crore during this period.\n", "Besides, the domestic tyre industry margins, which declined by 120 bps year-on-year in the September quarter, are expected to improve in the second half of the current fiscal due to the falling crude prices and stable prices of the natural rubber, it said.\n", "\n", "\"Tyre demand is estimated to grow by 7-9 per cent over the next five years (FY2019-23) supported by favourable outlook for the domestic automotive industry,\" Icra said.\n", "\n", "The rating agency also said said it has a stable outlook on the Indian tyre industry.\n", "\n", "Amidst continued investments towards capacity additions (partly being debt funded), the liquidity position, capitalisation and coverage indicators of the industry players are expected to remain comfortable largely supported by the stable earnings and healthy cash reserves available with most of the players, Icra said in the note.\n", "\n", "According to an industry report, the domestic ", "automobile industry", ", which is currently the fourth largest in the world, is expected to become the third largest by 2021.\n", "\n", "The industry (including component manufacturing) is expected to grow at a compounded annual growth rate of 5.9 per cent and reach USD 251.4-282.8 billion by 2026, thereby becoming the fastest growing industry in the country, as per the report.\n", "\n", "The domestic tyre industry has benefited from strong growth in both original equipment (OE) and replacement segments in the ongoing fiscal, according to Icra note. \n", "\n", "According to an industry report, the domestic automobile industry, which is currently the fourth largest in the world, is expected to become the third largest by 2021.\n", "\n", "The industry (including component manufacturing) is expected to grow at a compounded annual growth rate of 5.9 per cent and reach USD 251.4-282.8 billion by 2026, thereby becoming the fastest growing industry in the country, as per the report.\n", "\n", "\"While there have been some headwinds like Kerala floods, tightened financing, insurance related regulatory changes impacting two-wheeler (2W) demand, rising fuel and interest costs, among others, the YTD (year-to-date) sales growth across most segments have been robust leading to healthy OE tyre demand growth,\" it said.\n", "\n", "Replacement tyre demand, especially in the truck and bus segment, too has recovered sharply in the last one year supported by post-effects of goods and service tax (", "GST", "), pick-up in infrastructure activities, and healthy consumption driven demand, it said.\n", "\n", "Besides, tyre exports have been steadily increasing in the last one year with recovery in tyre demand from overseas markets and rising competitiveness of Indian tyre makers, both in terms of quality and pricing, Icra stated.\n", "\n", "The tyre industry in the country has witnessed large capacity additions in the last decade with a cumulative spend of around Rs 27,800 crore, of which about 70 per cent was spent in the last six years.\n", "\n"]], "tags": ["icra", "Indian industry", "gst", "automobile industry", "tyre industry"]},
{"heading": [["Suzuki Motor resumes production at Gujarat plant"]], "sub_heading": [["Suzuki Motor Gujarat had suspended production at the Hansalpur (Gujarat) plant on March 23 to check the spread of COVID-19. The facility, which rolls out two models, Baleno and Swift, currently has an installed production capacity of 5 lakh units per annum. "]], "time": [["Last Updated: May 25, 2020, 11.06 AM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Maruti Suzuki India", " (MSI) on Monday said ", "Suzuki Motor Gujarat", " has resumed manufacturing operations after having suspended work for over two months due to coronavirus lockdown. ", "Suzuki Motor", " Gujarat (", "SMG", ") manufactures cars on a contract basis for ", "MSI", ". \n", "\n", "The company has been informed by SMG that it would re-start production of vehicles from the May 25, strictly in accordance with the government regulations and guidelines, MSI said in a regulatory filing. \n", "\n", "SMG had suspended production at the Hansalpur (Gujarat) plant on March 23 to check the spread of COVID-19. \n", "\n", "The facility, which rolls out two models, Baleno and Swift, currently has an installed production capacity of 5 lakh units per annum. \n", "\n", "MSI has already commenced operations at its two plants in ", "Manesar", " and Gurugram. \n", "\n", "Both the plants have an installed capacity to produce over 15.5 lakh units per annum. \n", "\n", "The Gurugram facility rolls out models like S-Cross, Vitara Brezza, Ignis and Super Carry light commercial vehicle. \n", "\n", "The Manesar plant, on the other hand, produces high selling models like Alto, Swift, Dzire, S-Presso, Ertiga and Baleno.\n"]], "tags": ["msi", "Manesar", "maruti suzuki india", "Suzuki Motor", "SMG", "Gujarat", "Suzuki Motor Gujarat"]},
{"heading": [["IRFPC hopes to start tyre production by the end of 2019"]], "sub_heading": [["The company plans to start with 2000 tyres a day and scale it up to 5000 tyres gradually."]], "time": [["Last Updated: Jun 24, 2019, 06.08 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Kochi: The integrated rubber farmer producer company (", "IRFPC", ") floated by the rubber growers in the country is planning to acquire a new fully equipped two and three wheeler tyre factory in Erode in Tamil Nadu to begin production.\n", "\n", "The company hopes to begin production by the end of 2019 after completing acquisition formalities, said Ajit C John, a member of technical and financial experts group of the company. \"We plan to start with 2000 ", "tyres", " a day and scale it up to 5000 tyres gradually,’’ he said.\n", "\n", "The company has started mobilising the capital for its tyre project, estimated to cost Rs 100 crore initially, from rubber growers across the country through shares issued at a face value of Rs 10. The minimum amount to become a member is Rs 10,000 but for voting right the grower will have to possess shares for Rs 1 lakh.\n", "\n", "John said there is a provision for forming a group by farmers having 1,000 shares each and nominating one of them to cast vote. Andreas Hermes Academe (AHA) an NGO based in Germany and working closely with grower groups around the world has expressed its desire to work with IRFPC.\n", "\n", "Ajit John said the proposal for the tyre project was conceived when the rubber prices began to show a consistent decline post 2012, hitting the growers. \"The realisation dawned on the farmers that there is no salvation for them unless they move up value chain,’’ he said. The Indian government’s amendments in 2013 to the concept of farmer producer companies has given impetus to the formation of such companies which will be run with professional management, he said.\n", "\n", "The company decided on two and three wheeler tyres as these accounted for 51 % of all tyres produced and are growing at the rate of 12-13% while the industry is witnessing 5 to 6% growth. The market is more regional and demand in replacement tyre market is not brand sensitive unlike passenger tyre segment. Besides, the technology is easily available and the scale of investment is less compared to other segments.\n", "\n"]], "tags": ["NTPC Limited", "tyres", "tyres industry india", "JVC", "IRFPC"]},
{"heading": [["Mercedes Benz offers customised finance options to lure customers back"]], "sub_heading": [["Also, the company is providing ‘Step-Up 2020’ option, under which a customer can pay small sum as EMIs for the first six months of the contract and regular EMIs starting from the seventh month. "]], "time": [["Last Updated: May 25, 2020, 04.04 PM IST"]], "publisher": [["PTI"]], "article": [["Mercedes Benz India", " on Monday launched ", "flexible financial solutions", " with an aim to instill ", "customer confidence", " and create a positive sentiment in the market currently reeling under the impact of slowdown and coronavirus-induced ", "lockdown", ". Under its 'Wishbox 2.0', the German luxury carmaker is offering customised financial solutions including no ", "EMI", " for first three months, lesser EMIs for the first six months with regular EMIs starting from 7th month of purchase and 10-year extended loan.\n", "\n", "\"As the markets across the country start reopening and operations begin in a graded manner, we are introducing ‘Wishbox 2.0’, a host of customised and highly flexible financial solutions, aimed at reinstalling customer confidence and empowering them to buy their Mercedes,\" Mercedes-Benz India Managing Director and CEO ", "Martin Schwenk", " said in a statement. He further said, \"Wishbox 2.0 is highly flexible and we are confident will instill customer confidence by offsetting some of their financial commitments.\n", "\n", " These smart financing solutions are one-of-its kind and are our own way of supporting our customers’ investments and addressing the prevalent market challenges.\" Under ‘Wishbox 2.0’ a customer opting for a standard loan can avail of an EMI free period for the first three months and monthly installments will only commence after three months of the 3, 4, 5 years loan as customised.\n", "\n", "Also, the company is providing ‘Step-Up 2020’ option, under which a customer can pay small sum as EMIs for the first six months of the contract and regular EMIs starting from the seventh month. Mercedes-Benz India also said if is offering for the first time ever a 10-year loan tenure with the customer also having the option to opt for a guaranteed buy back after five years.\n", "\n", "Commenting on business resumption following relaxation of lockdown guidelines, Schwenk said, \"We are swiftly getting back to business with gradual re-opening of our dealerships across markets following all the social distancing protocols and adhering to all safety and sanitisation measures. We are confident, we will be able to operationalise the remaining outlets following the local authorities’ directives, soon.\"\n", "\n"]], "tags": ["emi", "Martin Schwenk", "Customer Confidence", "lockdown", "flexible financial solutions", "Mercedes Benz India"]},
{"heading": [["Luxury cars bring attractive offers to encourage sales"]], "sub_heading": [[" The spec sheets are in real danger of being outdone by the swelling list of purchase offers."]], "time": [["Last Updated: May 26, 2020, 08.27 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: This, perhaps, is the best time to buy a ", "luxury car", ". The spec sheets for these swish sets of wheels are in real danger of being outdone by the swelling list of purchase offers: ", "EMI holidays", ", extended loan tenures, and step-up repayment options.\n", "\n", "Mercedes Benz has tailored a bouquet of flexible financial solutions ‘Wish Box 2.0’. These draw-cards include extended loan tenures of 10 years, lower EMIs of Rs 1,499 per Rs 1 lakh, and EMI holidays for the first three months.\n", "\n", "“These smart financing solutions are one-of-its kind and are our way of supporting our customers’ investments and addressing the prevalent market challenges,” said Martin Schwenk, managing director, ", "Mercedes Benz India", " (MBIL). \n", "\n", " \n", "\n", "Wish Box 2.0 is applicable on purchase of select Mercedes models: the C-Class, the E-Class and the GLC. Doctors can avail of an additional price benefit of Rs 1 lakh. These schemes come at a time when sales of luxury cars declined about a third in the first quarter. Industry estimates showed that about 7,000 luxury cars were sold in the three months to March.\n", "\n", "Audi India", " isn’t too far behind either. It has drawn up service packages of up to 8 years, extended warranty up to 7 years and road-side assistance up to 11 years, in addition to flexible payment schemes. “As things gradually return to normal, we are analysing buying patterns to understand how we can encourage sales and offer financial solutions to our customers,” said Balbir Singh Dhillon, Head, Audi India. \n", "\n", "Volvo Cars", " is offering BS-VI vehicles at the same price as BS-IV-compliant versions. “We’ve kept the same price for BS-VI models after all our BS-IV stock was sold out before the deadline,” said Charles Frump, MD, Volvo Car India.\n", "\n"]], "tags": ["Luxury car", "Mercedes Benz India", "Audi India", "EMI holidays", "Volvo Cars"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["crash testing", "automobiles", "global ncap’s crash test", "four wheelers", "indian cars"]},
{"heading": [["Suzuki defers production at new Maruti plant"]], "sub_heading": [["Maruti’s parent Suzuki has decided to defer the start of production from a new car plant in Gujarat — being built with an investment of Rs 3,800 crore — till next year as a slowdown in demand due to the coronavirus is likely to keep buyer sentiment low."]], "time": [["Last Updated: May 26, 2020, 11.19 AM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: Maruti’s ", "parent Suzuki", " has decided to defer the start of production from a new car plant in Gujarat — being built with an investment of Rs 3,800 crore — till next year as a slowdown in demand due to the ", "coronavirus", " is likely to keep buyer sentiment low. ", "Maruti", " is also going slow on the shifting of its Gurugram facility — which falls within a residential area — to a new location due to coronavirus restrictions, chairman ", "R C Bhargava", " has said.\n", "\n", "“The third plant (at Gujarat) is more or less ready, but there is no market for it. So, there will be a further delay in its production,” Bhargava said, while speaking at the opening session of TOI Dialogues, a unique leadership summit that was held last Tuesday (the topic was business continuity in the times of Covid). “I think the start of production is now planned for some time in 2021, and not in 2020. Earlier, we were hoping for the beginning of 2021. Now the timing will depend on what is required from the third plant,” he said.\n", "\n", "Suzuki has two plants at Hansalpur in Gujarat, and these have a cumulative annual vehicle production capacity of 5 lakh units, apart from a powertrain manufacturing unit. The third plant, which would be adding 2.5 lakh units, had been under construction, though the work seems to have slowed down. The Maruti chairman said that the pandemic and resultant lockdown and further restrictions will keep the demand for new cars low.\n", "\n", "\n", "\n", "Maruti chairman R C Bhargava has said the company will not raise car prices even though its ", "manufacturing costs", " have gone up due to the safety precautions and the protective apparatus. “Costs will be higher this year and margins will be lower because we are not going to run at full capacity either. We cannot increase the prices even if the costs go up,” Bhargava said.\n", "\n", "\n"]], "tags": ["maruti", "parent suzuki", "coronavirus", "r c bhargava", "manufacturing costs"]},
{"heading": [["Hyundai Motor exports over 5k units in May"]], "sub_heading": [["Hyundai Motor India Ltd (HMIL) on Saturday said it has exported over 5,000 units this month after resuming production at its Chennai-based plant on May 8."]], "time": [["Last Updated: May 30, 2020, 01.47 PM IST"]], "publisher": [["PTI"]], "article": [["Hyundai Motor India Ltd (HMIL) on Saturday said it has exported over 5,000 units this month after resuming production at its Chennai-based plant on May 8. The company has reinforced its commitment to support the government's '", "Make in India", "' vision with more than 5,000 ", "export units", " for May, the automaker said in a statement. \n", "\n", " \"We have once again made a humble beginning towards normalcy by exporting more than 5,000 units in May. This is a testimony of Hyundai's resilient efforts towards localisation and to accentuate economic recovery,\" HMIL MD and CEO SS Kim said. \n", "\n", " The company initiated ", "vehicle exports", " from India in 1999 has till date dispatched over 30 lakh units to around 88 countries in four continents, he added. In last calendar year, the company exported 1,81,200 units with 792 customised variants according to country-specific preference and demand. \n", "\n", " \"With a market share of 26 per cent in 2019 to the total exports of passenger cars from India, the company has made a significant contributor to the Indian automobile industry,\" HMIL said. The company currently exports 10 models, including Venue and Creta, from the country.\n"]], "tags": ["Hyundai Motor company", "make in India", "Schutzstaffel", "Export units", "Vehicle Exports"]},
{"heading": [["Commercial vehicle dealers in dire straits, 10% may have to shut shop"]], "sub_heading": [["Dealerships have reached out to original equipment manufacturers to increase margins and liquidity, failing which they will have to lay off workforce. Some may have to merge with larger dealers, threatening independent existence, say experts."]], "time": [["Last Updated: May 29, 2020, 09.20 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Hit hard by the ", "lockdown", ", there is expected to be an exodus of at least 10% of the nearly 1,500 ", "commercial vehicle", " (CV) dealerships in the next eight to 12 months.\n", "\n", "Dealerships have reached out to original equipment manufacturers to increase margins and liquidity, failing which they will have to lay off workforce. Some may have to merge with larger dealers, threatening independent existence, say experts.\n", "\n", "“Most CV dealerships find it difficult to survive in in tier II-III markets, where cost of manpower and operations is extremely high,” said Mukesh Haritash, director, ", "Chetak Logistics", ".\n", "\n", "“Those in metro cities will feel the pinch. The cost structures and operating economics of a dealership have gone haywire,” said Vinkesh Gulati, vice-president, the Federation of Automobile Dealers Associations of India. Margins for commercial vehicles at Indian dealerships are wafer thin at about 1-2%. Dealerships are over leveraged with profitability at an all-time low.\n", "\n", "As the Covid lockdown continues to create mayhem with the auto sector, the commercial vehicle (CV) industry finds itself in dire straits. With economic activity yet to take off after the lockdown, dealers are looking at an alarming option of shutting shops.\n", "\n", "There are nearly 1500 CV dealerships across India and it is expected that there will be an exodus of atleast 10% of these dealerships in the next 8-12 months.\n", "\n", "Dealerships are looking at OEMs to bail them out during these times. Some of these dealers may have to merge their businesses with larger dealers, thretening their independent existence, say experts.\n", "\n", "While dealers agree that either shutting down unviable ones or merging with larger dealerships will help them, \"it's all about getting liquidity and inventory funding for business continuity. Most of the CV dealerships in tier 2-3 markets find it difficult to survive in markets where manpower and cost of operations are extremely high,” said Mukesh Haritash, director ,Chetak Logistics,a large fleet operator based from Delhi.\n", "\n", "In fact, one large fleet operator based out of Delhi recently took up a truck dealership and has decided not to go ahead as demand is at an all time low.\n", "\n", "“While many dealerships in tier 3 towns can sustain even though costs have gone up there too, but those in metro cities will feel the pinch”, says Vinkesh Gulati, vice president of dealer association, FADA. “The cost structures and operating economics of a dealership have gone haywire,” adds Gulati.\n", "\n", "Dealerships have reached out to OEMs to increase margins and liquidity, failing which they will have to lay off workforce. Margins for commercial vehicles at Indian dealerships are wafer thin at about 1-2%.\n", "\n", "Dealerships are over leveraged with profitability at an all-time low. \n", "\n", "The commercial vehicle dealerships would have no cash post opening up, making daily running costs difficult, say dealers.\n", "\n", "During FY21, CV sales will be the slowest to recover and will not make a comeback soon, says Vinod Aggarwal, MD & CEO, VE Commercial Vehicles\n", "\n", "\"The steep price increase from BS4 to BS6, the financing crisis and the recent axle norms have all affected CV offtake, \" says Aggarwal.\n", "\n", "CV dealers say that FY21 looks like a washout as the first quarter will see very low sales. Already CV sales have dropped 29 per cent to 717,688 units in April-March 2020.\n", "\n", "The conversion cost from BS4 to BS6 CVs is upwards of 15 per cent, which is also a deterrent for consumers to buy such vehicles, Gulati added.\n", "\n", "While 60 per cent of the truck service centres have opened up and seeing some business, it's the retail sales that have taken a big hit , say dealers.\n", "\n", "Footfalls have fallen as consumers lack confidence to step into showrooms citing finance for CVs coming to a virtual standstill, says Ashok Khanna, ex HDFC auto finance retail head.\n", "\n", "The CV industry is also staring at one of its worst phases given the exodus of drivers who have returned to their villages. With the country having seen a bumper harvest, drivers see a future in the agricultural space atleast for the short term, say experts.\n", "\n", "\n"]], "tags": ["car dealer", "Commercial vehicle", "lockdown", "coronavirus", "Chetak Logistics"]},
{"heading": [["Volkswagen India introduces leasing, flexible financing options to drive sales amid COVID-19"]], "sub_heading": [["Volkswagen India on Wednesday introduced leasing options and flexible financing instruments for purchase of its vehicles with an aim to drive sales in a market battered by COVID-19 disruptions. "]], "time": [["Last Updated: May 27, 2020, 01.29 PM IST"]], "publisher": [["PTI"]], "article": [["Volkswagen India on Wednesday introduced ", "leasing", " options and ", "flexible financing", " instruments for purchase of its vehicles with an aim to drive sales in a market battered by COVID-19 ", "disruptions", ". Under its omni-channel mobility solutions, the company has integrated '", "Power Lease", "' -- a 'pay-for-usage' model complete with zero down payment scheme -- with Volkswagen Secure which allows customers to purchase a Vento or a Tiguan Allspace model with flexible down payment and low EMI, including insurance coverage for a tenure of three or four years. \n", "\n", " Commenting on the omni-channel mobility initiative Volkswagen Passenger Cars India Director Steffen Knapp said, \"with the prevailing economic situation, we, at Volkswagen would like to offer customers financial prudency through our omni-channel mobility program.\" \n", "\n", " The Volkswagen Secure and Power Lease initiatives provide customers the power and independence to purchase their favourite Volkswagen in a hassle-free, contactless and digitalised manner, he added. \n", "\n", " In the current scenario, wherein accessible individual mobility is on the rise, these solutions will reduce the financial strain on customers, the company added. \n", "\n", " Through Volkswagen Power Lease, a customer can access all Volkswagen BS-VI cars and avail 'pay-for-usage' model complete with zero down payment, low rental charges, insurance coverage and flexible maintenance option across varied tenure period of two, three and four years, the statement said. \n", "\n", " Customers will have the option for either wet lease or dry lease. While wet lease covers all maintenance cost and offers buy-back at the market value of the car; under dry lease customer will have to bear the maintenance cost and the buy-back will be available only at a pre-determined value. \n", "\n", " Power Lease also enables a customer upgrade to other Volkswagen models, avail tax benefits depending on the customer's financial preferences while providing lucrative buy-back/retain options, it added. \n", "\n", " As part of Volkswagen Secure, customer will also get guaranteed residual value along with an assured buy back option. The customer may also choose to retain the car/upgrade to another model with refinance options available from Volkswagen Financial Services, the company said.\n"]], "tags": ["leasing", "Power Lease", "Volkswagen Tiguan", "Disruptions", "flexible financing"]},
{"heading": [["Coronavirus impact: Toyota Kirloskar sales dip 86 pc in May"]], "sub_heading": [["\"We are conscious of the dealer business conditions in various parts of the country and we have been prioritising production at our end as per dealer requirements, both in terms of quantity as well as the grades that they require,\" TKM Senior Vice President, Sales & Service, Naveen Soni said."]], "time": [["Last Updated: May 31, 2020, 05.07 PM IST"]], "publisher": [["PTI"]], "article": [["Toyota Kirloskar Motor", " (TKM) on Sunday reported a 86.49 per cent decline in domestic vehicle ", "sales", " to 1,639 units in May. The company had posted sales of 12,138 units in May 2019, TKM said in a statement. \n", "\n", "\"We are conscious of the dealer business conditions in various parts of the country and we have been prioritising production at our end as per dealer requirements, both in terms of quantity as well as the grades that they require,\" TKM Senior Vice President, Sales & Service, ", "Naveen Soni", " said in a statement. \n", "\n", "The market has been slow and with demand being less, the company has been able to wholesale only 20 per cent of what it would have clocked under a normal situation, he added. \n", "\n", "\"However, retail sales have been much higher when compared to wholesales, thereby helping us reduce the month closing inventory levels at dealerships,\" Soni said. \n", "\n", "There has also been a significant surge in customer orders and enquiries online, through digital platforms, he added. \n", "\n", "Soni said operations have resumed in more than 300 company sales outlets across the country.\n"]], "tags": ["Toyota Kirloskar", "Naveen Soni", "domestic vehicle sales", "coronavirus impact", "Toyota Kirloskar Motor", "sales"]},
{"heading": [["Toyota to resume manufacturing operations from Tuesday"]], "sub_heading": [["After weeks of lockdown and partial lifting of restrictions across the country, the company will re-start production at the facility from May 26 in a phased manner, in concurrence with the directives of both, the state and the central governments, TKM said in a statement. "]], "time": [["Last Updated: May 25, 2020, 05.21 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Toyota Kirloskar Motor", " (TKM) on Monday said it will resume ", "manufacturing", " operations at its Bidadi (Karnataka) plant from Tuesday. After weeks of ", "lockdown", " and partial lifting of restrictions across the country, the company will re-start production at the facility from May 26 in a phased manner, in concurrence with the directives of both, the state and the central governments, TKM said in a statement. \n", "\n", " The company officials are closely monitoring and evaluating the situation to gradually ramp up operations, it added. \n", "\n", " More than 290 dealerships of the company and 230 service outlets have also resumed operations across the country, the automaker said. \n", "\n", " \"While restarting operations, we have deliberately been very circumspect to take some more time owing to the fact that we wanted to take extra precautions so as to ensure that both the workplace and its surrounding are safe for us to resume work,\" TKM Deputy Managing Director Raju B Ketkale said. \n", "\n", " The physical and mental wellbeing of employees is of utmost importance to the company and it does not want to jeopardise the same at any cost, he added. \n", "\n", " The company said it had introduced a set of safety initiatives at its plant as well as dealerships.\n"]], "tags": ["Kirloskar Motor", "manufacturing", "lockdown", "toyota", "Toyota Kirloskar Motor"]},
{"heading": [["Indian carmakers offer teaser loans as banking sources say RBI softens stance"]], "sub_heading": [["Teaser loans offer low interest rates for the first few months or years to attract customers, but rates are later rapidly increased. So far, at least Maruti Suzuki, Hyundai and Mercedes Benz have launched such schemes, according to press releases over the past week."]], "time": [["Last Updated: Jun 02, 2020, 12.44 PM IST"]], "publisher": [["Reuters"]], "article": [["MUMBAI: Several Indian automakers have hooked up with banks to offer purchase schemes involving long frowned-upon ", "teaser loans", ", as sources say the central bank has softened its stance amid the pandemic-induced economic slump in India.\n", "\n", "So far, at least ", "Maruti Suzuki", ", ", "Hyundai", " and Mercedes Benz have launched such schemes, according to press releases over the past week.\n", "\n", "Teaser loans offer low interest rates for the first few months or years to attract customers, but rates are later rapidly increased.\n", "\n", "For years, the Reserve Bank of India said their terms were not transparent and warned that similar products had been instrumental in the 2007-2008 subprime crisis in the United States.\n", "\n", "Although the ", "RBI", " never banned teaser loans, its disapproving stance kept lenders from offering them in the past, bankers said.\n", "\n", "Five banking sources said there was now consensus that the promotional teaser loans were needed to revive car sales, which automakers have warned could fall as much as 45% this fiscal year in a worst-case scenario.\n", "\n", "\"People will require some easier terms due to COVID-19 and thereafter they can pay higher, so it's a scheme which is in line with the times,\" said one of three sources aware of the RBI'S change in stance.\n", "\n", "The RBI and the automakers did not respond to requests for comment.\n", "\n", "Banking sources say the Finance Ministry is pressuring banks to increase lending, though they are already saddled with over $120 billion of bad loans, an amount likely to rise in the wake of a two-month lockdown that has pummeled India's economy.\n", "\n", "The Finance Ministry did not immediately respond to a request for comment.\n", "\n", "\"There is a huge demand from the market to bring back promotion-led loans,\" said the retail head of a private bank that is mulling the launch of a similar scheme. \"After all, what other option do we have right now?\"\n", "\n", "Another banker at a state-owned lender said that their bank was considering using teaser loans schemes for mortgages to attract borrowers.\n", "\n", "One ex-banker said he was worried by the risk that these schemes will lead to more bad loans.\n", "\n", "\"A lot of mis-selling happens with these loans,\" said the Mumbai-based source. \"Both the bank and the borrower should be aware and beware.\" \n", "\n"]], "tags": ["Maruti Suzuki", "Hyundai", "RBI", "teaser loans"]},
{"heading": [["Maruti Suzuki sells 13,865 units in the local market in May"]], "sub_heading": [["The company exported 4,651 units following resumption of port operations at Mundra and Mumbai port, ensuring that all guidelines for safety were followed. The company also sold 23 units to alliance partner Toyota in this period. "]], "time": [["Last Updated: Jun 01, 2020, 10.28 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The country’s largest car maker Maruti ", "Suzuki", " sold 13,865 units in the ", "domestic market", " in May after resuming operations at its manufacturing facilities in Gurugram and Manesar (Haryana) in a graded manner due to the COVID-19 induced lockdown. \n", "\n", "“Likewise, the company’s showrooms opened in accordance with Centre and State guidelines in a graded manner across different cities. The remaining showrooms would open in due course if they are not in containment zone or if not specifically restricted by any local guidelines”, the company said in a statement. \n", "\n", "Maruti Suzuki sold 125,552 units in the local market in the corresponding period of the last financial year. \n", "\n", "The company exported 4,651 units following resumption of port operations at Mundra and ", "Mumbai", " port, ensuring that all guidelines for safety were followed. The company also sold 23 units to alliance partner ", "Toyota", " in this period. \n", "\n", "The company resumed its manufacturing operations post lock down strictly in accordance with the government regulations and guidelines, from May 12th at its Manesar facility and from May 18th at its Gurugram facility. \n", "\n", "Production also resumed at ", "Suzuki Motor Gujarat Pvt Limited", " (SMG) from May 25th 2020. SMG manufactures cars on a contract basis for Maruti Suzuki.\n", "\n"]], "tags": ["Maruti Suzuki", "mumbai", "Gurgaon", "domestic market", "toyota", "suzuki", "suzuki motor gujarat pvt limited"]},
{"heading": [["Nissan Motor India launches new version of Datsun redi-GO"]], "sub_heading": [["The new Datsun redi-GO comes in two engine variants of 0.8 litre petrol and 1-litre petrol with automated manual transmission option, Nissan Motor India said in a statement.  Commenting on the launch, Nissan Motor India Managing Director Rakesh Srivastava said, \"With the new Datsun redi-GO, we have introduced a high-quality product with a strong value proposition.\" "]], "time": [["Last Updated: Jun 02, 2020, 03.33 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Nissan Motor India", " on Tuesday launched a new version of its Datsun ", "redi-GO", " hatchback priced between Rs 2.83 lakh and Rs 4.77 lakh (ex-showroom Delhi). The new ", "Datsun redi-GO", " comes in two engine variants of 0.8 litre petrol and 1-litre petrol with automated manual transmission option, Nissan Motor India said in a statement. \n", "\n", " Commenting on the launch, Nissan Motor India Managing Director ", "Rakesh Srivastava", " said, \"With the new ", "Datsun", " redi-GO, we have introduced a high-quality product with a strong value proposition.\" \n", "\n", " Built with Japanese technology, the new redi-GO offers segment-leading technological features that cater to growing ambitions of young India, he added. \n", "\n", " \"We aim to enhance the value propositions of Datsun products in line with our mission of enabling progressive mobility,\" Srivastava said. \n", "\n", " The entry level car is also equipped with features such as L-shaped day time running lights (DRLs), LED fog lamps, 14-inch wheels with pentablade dual tone wheel cover, LED signature tail-lamps and door trim with fabric, it added. \n", "\n", " It also has an 8-inch touchscreen advanced infotainment system with voice recognition, compatible with Android Auto and Apple CarPlay. \n", "\n", " Besides, the car is equipped safety features, including a strong crash-resistant body structure that protects passengers from frontal offset impact, side impact, pedestrian protection compliant, rear seat belt with retractive function, dual airbags and a rear-view camera with projection guide, the company added.\n"]], "tags": ["Nissan Motor India", "Datsun", "Nissan Motor India Private Limited", "rakesh srivastava"]},
{"heading": [["Michelin launches new tyre range for passenger vehicles in India"]], "sub_heading": [["The new range, priced from Rs 5,090, would be available at the company's authorised dealers across the nation in 30 sizes (12-16 inch) from early next year."]], "time": [["Last Updated: Dec 09, 2019, 02.38 PM IST"]], "publisher": [["PTI"]], "article": [["French tyre major ", "Michelin", " on Monday said it has introduced a new tyre range in India primarily for small and mid-size passenger cars.\n", "\n", "The company said the Energy XM2+ range replaces Energy ", "XM2 ", " tyre range in the country.\n", "\n", "\"Long lasting performance is at the heart of Michelin's activity. In India, we are again raising the bar for daily commuting tyres with ", "Michelin Energy", " XM2+, which improves on its predecessor, the Michelin Energy XM2, a leading mass-market tyre for eight consecutive years,\" Michelin India Vice President Mohan Kumar said in a statement.\n", "\n", "The new range, priced from Rs 5,090, would be available at the company's authorised dealers across the nation in 30 sizes (12-16 inch) from early next year.\n"]], "tags": ["XM2+", "Michelin Energy", "passenger vehicle", "Michelin", "XM2 tyre"]},
{"heading": [["Budget 2019: Tyre industry finds budget a mixed bag"]], "sub_heading": [["What will lend an impetus to the auto and tyre sectors is Finance Minister’s proposal to invest Rs 100 lakh crore in the infrastructure sector over next five years."]], "time": [["Last Updated: Jul 05, 2019, 06.25 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOCHI: Automotive Tyre Manufacturers Association (Atma) has said that while it welcomed the proposal for reduction in corporate tax for more companies and increased investment in infrastructure, the industry’s major concerns remain unaddressed.\n", "\n", "What will lend an impetus to the ", "auto and tyre sectors", " is Finance Minister’s proposal to invest Rs 100 lakh crore in the infrastructure sector over next five years. Upgradationn of 125000 km of road length over the next five years under the ", "Pradhan Mantri Gram Sadak Yojana", " –III augurs well for the ", "transportation sector", " and thereby Auto & Tyre sectors.\n", "\n", "“Tyre Industry was keenly looking to correction in ", "inverted duty", " either by increasing import duty on finished goods (tyres) or reducing it on Natural Rubber (NR) the principal raw material. Basic customs duty has been increased on some auto parts in the Budget but tyres have been deprived of the relief. It is wished duty on tyres could have been increased too with a view to face the onslaught of cheaper imports”, said K M Mammen, Chairman ATMA.\n", "\n", "The duty on variants of ", "butyl rubber", ", an ", "important raw material", " for ", "Tyre Industry", ", which has no domestic production, has been increased from 5-10%. That is a dampener for the Industry and will impact price competitiveness.\n", "\n", "Auto sector, which is battling tough times, was hopeful of a stimulus measure. A fiscal support in terms of lowering of GST could have helped. Unfortunately, the prices of petrol and diesel stand increased which will increase cost of ownership especially that of commercial vehicles.\n", "\n"]], "tags": ["tyre industry", "auto and tyre sectors", "important raw material", "union budget", "budget 2019", "Pradhan Mantri Gram Sadak Yojana", "Inverted duty", "butyl rubber", "transportation sector"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [["J K Tyre & Industries aims to reduce debt by over 50% in three years, banks on exports and replacement mkt to de-risk biz"]], "sub_heading": [["Already sitting on a debt of Rs 5000 crore, the company has decided to defer Rs 675 crore investment by a year in Cavendish Industries (a firm it acquired in 2016 from B K Birla Group) to ensure lean operations.  With series of cost cutting initiatives and expected improvement in capacity utilisation, the company’s CFO Sanjeev Aggarwal said J K Tyre is planning to pare its debt to more than half in the coming three years. "]], "time": [["Last Updated: Jan 06, 2020, 11.11 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["JK ", "Tyre", " and ", "Industries", ", India's largest commercial vehicle tyre maker is banking on the growing replacement market and overseas push to counter crippling slowdown in the Indian automotive industry. \n", "\n", "Already sitting on a debt of Rs 5000 crore, the company has decided to defer Rs 675 crore investment by a year in Cavendish Industries (a firm it acquired in 2016 from B K Birla Group) to ensure lean operations. \n", "\n", "With series of cost cutting initiatives and expected improvement in capacity utilisation, the company’s CFO Sanjeev Aggarwal said J K Tyre is planning to pare its debt to more than half in the coming three years. \n", "\n", "Reviewing the year 2019, Aggarwal said the company spotted the slowdown quite early in October of 2018 and increased focus on replacement market and exports market to de-risk from the domestic market slowdown.\n", "\n", "“The replacement has grown by 12% last year, the overseas markets grew by an impressive 40%. The new launches for the replacement and expansion of network drove growth. We will look at reducing our long term debts by 40% in three years, we think with higher capacity utilization and growth in the coming year, we will try to accelerate the debt reduction further,” added Aggarwal.\n", "\n", "The share of OE business has come down to a fifth from a one-third of total revenues last financial year. Aggarwal says the push on exports and replacement will continue and he expects the double digit growth in both businesses to continue.\n", "\n", "To be sure, the share of exports of the total revenues has increased from 11-16% and replacement market share in the overall business has increased from 65% to 70% in the last three to four quarters.\n", "\n", "The company exports to over 100 countries and is trying to break into markets of Eastern and Southern Europe and penetrate deeper into Africa.\n", "\n", "The investment of Rs 675 crore in Cavendish was to expand the capacity of truck and bus radial plant by half a million tyres, which will be moved by a year, as commercial vehicle market is expected to remain in red with anticipated spike in acquisition price.\n", "\n", "Aggarwal says he is hoping that the scrappage policy announced by the government will help in containing the slide and revive demand.\n", "\n", "The company’s two wheeler tyre capacity has already hit a 100% utilisation, Aggarwal says J K Tyre would need additional capacity to build market share, but it is yet to take a call on addition of fresh capacity.\n", "\n"]], "tags": ["JK Tyre", "Sanjeev Kumar", "Original Equipment Manufacturer", "industries", "Tyre"]},
{"heading": [["Kia Motors launches refreshed version of SUV Seltos, prices start at Rs 9.89 lakh"]], "sub_heading": [["The refreshed Seltos now comes equipped with ten new features related to safety, convenience, connectivity and design, over and above other key enhancements, the company said in a statement. Moreover, many existing features in higher variants such as sunroof are now available in lower variants too, the statement added."]], "time": [["Last Updated: Jun 01, 2020, 03.07 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Kia Motors", " India on Monday launched a refreshed version of its popular ", "SUV", " Seltos with price starting at Rs 9.89 lakh (ex-showroom, Delhi).\n", "\n", "The refreshed ", "Seltos", " now comes equipped with ten new features related to safety, convenience, connectivity and design, over and above other key enhancements, the company said in a statement.\n", "\n", "Moreover, many existing features in higher variants such as sunroof are now available in lower variants too, the statement added.\n", "\n", "The company further said that based on market research and customer preference, it has also decided to discontinue its two variants of – Smartstream Petrol 1.4T-GDI GTK and GTX 7DCT.\n", "\n", "\"The refreshed Seltos is the result of a deep understanding of the Indian automotive market, and our customers' desires and requirements, and we are confident it will continue to win hearts for Kia in India,\" Kia Motors India Managing Director & CEO Kookhyun Shim said.\n", "\n", "He further said, \"the Seltos marked the arrival of the Kia brand in India. It laid a strong foundation for Kia in the country and as a vehicle... the Seltos enabled us to address all the unmet needs of the segment.\"\n", "\n", "Similar to the previous version of the Seltos, the refreshed version will continue to be available in two distinct design lines: Tech Line aimed at family-oriented customers and GT Line aimed at enthusiasts who are young at heart, Kia Motors India said.\n", "\n", "\"With the next-gen technology in the refreshed Seltos, we are confident that we will deliver customer delight that is unparalleled,\" Shim added.\n", "\n", "The SUV will be available in three engine options of 1.5 litre petrol, 1.4 litre GDI petrol and 1.5 litre diesel, across 16 variants priced between Rs 9.89 lakh and Rs 17.34 lakh (ex-showroom Delhi), it added.\n", "\n"]], "tags": ["kia seltos price", "seltos price", "new seltos price", "seltos", "SUV", "kia seltos", "Kia Motors"]},
{"heading": [["Synergies launches world’s first black chrome-plated wheels"]], "sub_heading": [["The latest technology combines the best of traditional electroplating, and new age requirement for environmentally safe and compliant ‘black’ colour, said the company, adding that the premium electroplating process guarantees a rich, lustrous, silky smooth chrome-plated blackness. "]], "time": [["Last Updated: Jan 29, 2020, 09.21 AM IST"]], "publisher": [["ET Bureau"]], "article": [["Synergies Castings, India’s leading aluminium alloy wheel manufacturer, has announced launching the world’s first black chrome plated wheels – Magic Black – manufactured at its modern automated ", "chrome plating", " plant in Visakhapatnam.\n", "\n", "In a statement, the company said the black premium chrome-plated wheels - Magic Black – were produced using the world’s first chrome plating system through precision engineering, advanced materials and revolutionary manufacturing process to ensure stunning finish and looks.\n", "\n", "The latest technology combines the best of traditional electroplating, and new age requirement for environmentally safe and compliant ‘black’ colour, said the company, adding that the premium electroplating process guarantees a rich, lustrous, silky smooth chrome-plated blackness. As it follows the entire copper-nickel-special-chrome plating, it ensures better corrosion resistance, apart from increasing the longevity, durability and resistance to abrasion and protects the metal from corrosion, chemical damage, and wear. \n", "\n", "Synergies Castings’ President Shekhar Movva said more than two years of intense research, development of several custom processes, creation of new rinses, have finally yielded success. “These wheels are meant for the ultra-premium segment of the car market, with an overall market share of 3-5% and most suited to the luxury and ultra-luxury segment.”\n", "\n", "The company claims that ", "Black Magic", " wheels technically far exceeds all OEM requirements comfortably, including the CASS, thermal, microporous requirements that guarantee resistance to corrosion, pelleting, pitting, waviness, sputtering.\n", "\n", "Synergies Castings", " is a globally approved alloy wheels supplier for over 17 years to several ", "automobile", " manufacturers including General Motors, Ford, Chrysler, Toyota, Hyundai, Fiat, Volkswagen, Honda, Tata Motors and Mahindra & Mahindra, among others.\n", "\n", "\n"]], "tags": ["synergies castings", "Automobile", "aluminium alloy wheels", "Black magic", "Chrome plating"]},
{"heading": [["Warburg Pincus to invest $150 mn in Apollo Tyres"]], "sub_heading": [["The Board of Directors of Apollo Tyres today approved an issuance of compulsorily convertible preference shares in the company worth Rs 10,800 million (approximately US$150 million) to an affiliate of Warburg Pincus, a leading global private equity firm focused on growth investing. The investment represents a primary capital infusion into the company and is subject to shareholder and regulatory approvals. "]], "time": [["Last Updated: Feb 26, 2020, 03.28 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Global private equity investment firm ", "Warburg Pincus", " is set to invest $150 million in ", "Apollo Tyres", ".\n", "\n", "The Board of Directors of Apollo Tyres today approved an issuance of compulsorily convertible preference shares in the company worth Rs 10,800 million (approximately US$150 million) to an affiliate of Warburg Pincus, a leading global private equity firm focused on growth investing. \n", "\n", "The investment represents a primary capital infusion into the company and is subject to shareholder and regulatory approvals. \n", "\n", "Commenting on the transaction, ", "Onkar S Kanwar", ", Chairman and Managing Director, Apollo Tyres said, “I am delighted to announce Warburg Pincus’ investment in Apollo Tyres. Their investment is a strong vote of confidence in our business, management team and growth prospects. I believe the company will benefit from the backing of a large financial investor of their pedigree and our partnership will further strengthen Apollo Tyres’ board and governance.” \n", "\n", "Vishal Mahadevia, Managing Director and Head, ", "Warburg Pincus India", ", said “We see a compelling growth story in Apollo Tyres and believe the company is well-positioned to build upon the strong leadership position it has carved out within the industry. Warburg Pincus is excited to partner with the management team of Apollo Tyres in this journey and looks forward to supporting them during the next phase of the company’s growth.” \n", "\n"]], "tags": ["Onkar S Kanwar", "warburg pincus", "Apollo Tyres", "Vishal Mahadevia", "Warburg Pincus India"]},
{"heading": [["Maxxis bets big on India as it eyes to enter top 5 global tyre maker list"]], "sub_heading": [["The company is investing USD 400 million on its first manufacturing plant at Sanand in Gujarat, where it is working to hike output to 60,000 units of two-wheeler tyres per day from the current 20,000 units a day, as part of the project's phase I expansion."]], "time": [["Last Updated: Mar 01, 2020, 11.37 AM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Taiwanese tyre major ", "Maxxis Group", " is betting big on India, where it plans to build up to five factories, as it expects the country to play a crucial role in its chase to become a top five global player by 2025, according to a senior company official.\n", "\n", "The company, which clocked revenue of around USD 4 billion in 2019, is currently the world's 9th largest tyre brand and sees India along with Indonesia to play significant part in meeting its 2025 target.\n", "\n", "The company is investing USD 400 million on its first manufacturing plant at Sanand in Gujarat, where it is working to hike output to 60,000 units of two-wheeler ", "tyres", " per day from the current 20,000 units a day, as part of the project's phase I expansion.\n", "\n", "\"Maxxis has a group goal of growing into the top five globally in next five years. We have accomplished much in East Asia, Southeast Asia and have significant presence in Europe and in American market.\"\n", "\n", "\"The next major international markets for us will be two places -- one is India and the another Indonesia, the major two-wheeler markets in the world,\" Maxxis India Marketing Head Bing-Lin Wu said.\n", "\n", "He further said, \"in achieving the group goal of 2025, India will play a pivotal role. We have estimated a certain output from the Indian market alone that will help us to achieve that target. On backward calculations four or five production units will be the minimum requirement to achieve that.\"\n", "\n", "When asked about investments and timeline for setting up these plants, he said, \"we will start a discussion very soon.\"\n", "\n", "Also, he said the investments on the new plants would be comparably lesser than on its first plant at Sanand where the company has already made \"some heavy advanced investments\" on machinery for processes such as mixing, vulcanising and calendering and the \"capacity of one machine is so huge that it can supply six to seven production lines\".\n", "\n", "\"In the subsequent plants, we will try to make an optimisation between our investments and utilising the current capacity of our Sanand plant,\" Wu said.\n", "\n", "At present, Maxxis India supplies two-wheeler tyres to ", "Honda", ", ", "Hero MotoCorp", ", ", "Yamaha", " and Suzuki from its Sanand plant, while it supplies four-wheeler tyres to Mahindra & Mahindra, Tata Motors, Maruti Suzuki and ", "Jeep", ".\n", "\n", "Commenting on Sanand plant expansion, Lu said, \"we have used half of the land (106 acres) we got from the Gujarat government for the planned 60,000 units capacity. The other half of the land, we are still deciding whether to put another 60,000 units capacity of two-wheeler or we are going to put four-wheeler tyre production.\"\n", "\n", "Maxxis has set a target of garnering 15 per cent of two-wheeler tyre market in India by 2023.\n", "\n", "Lu said the company expects the Indian market to grow to around 10 crore units of two-wheeler tyres per year and if the company achieves its target of 15 per cent market share \"we will more or less utilise the entire capacity of our Gujarat plant and anything beyond will require expansion of production in India\".\n", "\n", "On four-wheeler tyre segment, he said the group's 2025 target and expectations from India are pinned on both two and four-wheeler tyres segment \"but volume-wise, definitely two-wheeler tyres in India has more advantage than four-wheeler tyre business\".\n", "\n", "When asked about growth prospects for 2020, Lu said Maxxis expects to continue with its growth momentum from last year, despite the automobile industry suffering a downturn as it was able to enhance its original equipment manufacturer (OEM) business share.\n", "\n", "\"I will say we are still in a position to aim at high growth given that we're going to have even higher share in the existing partnership and we are looking at multiple projects simultaneously with OE (original equipment) partners,\" he said.\n", "\n"]], "tags": ["tyres", "Yamaha", "Hero MotoCorp", "jeep", "Honda", "Mahindra & Mahindra", "Maxxis Group"]},
{"heading": [["Coronavirus impact: Apollo Tyres, Ceat suspend manufacturing operations"]], "sub_heading": [["The expected financial impact of the above is not ascertainable at this stage and the duration of this shutdown will depend upon directives to be further issued by the respective government authorities in this regard, said Apollo Tyres."]], "time": [["Last Updated: Mar 24, 2020, 08.04 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Apollo ", "Tyres", " on Tuesday said it has suspended production at its plants till March 31 in view of the lockdown in many states to contain the ", "coronavirus", " pandemic.\n", "\n", "\"The operations at our plants in the states of Kerala (at Kalamassery and Perambra), Gujarat (Limda) and Tamil Nadu (Chennai) are shut down till March 31, 2020,\" the company said in a regulatory filing.\n", "\n", "Further, the employees and other staff in various offices have been instructed to work from home, it added.\n", "\n", "The expected financial impact of the above is not ascertainable at this stage and the duration of this shutdown will depend upon directives to be further issued by the respective government authorities in this regard, it said.\n", "\n", "Similarly, ", "Ceat", " said it has suspended manufacturing operations till such regulatory advisories prevail.\n", "\n", "The company is taking all recommended ", "precautions", " and preventive measures to ensure health and safety of its employees and to contain the spread of coronavirus, including implementation of the work from home policy for all its offices, it added.\n", "\n"]], "tags": ["Apollo Tyres", "ceat", "tyres", "Precautions", "coronavirus"]},
{"heading": [["Tyre industry foresees a loss of about Rs 5000 crore in six months to July"]], "sub_heading": [["All tyre manufacturing facilities have stopped functioning and the industry now expects to resume operations only by mid-April. \" We have estimated the loss assuming things will get better from August,’’ said Rajiv Budhraja, director general of Automotive Tyre Manufacturer’s Association."]], "time": [["Last Updated: Mar 30, 2020, 03.36 PM IST"]], "publisher": [[", "]], "article": [["KOCHI: With Covid-19 bringing the production to a halt, the ", "tyre industry", " is expecting a loss of Rs 4500 to 5000 crore for six months from February to July.\n", "\n", "All tyre manufacturing facilities have stopped functioning and the industry now expects to resume operations only by mid-April. \" We have estimated the loss assuming things will get better from August,’’ said Rajiv Budhraja, director general of ", "Automotive Tyre Manufacturer’s Association", "\n", "\n", "According to him after re-starting operations, it would take another six months for the market to stabilise. So the impact of Covid-19 will be felt for the entire financial year, he added .\n", "\n", "The present crisis, Budhraja said, started with a routine slowdown followed by restriction of mobility of vehicles and then a lockdown. \"The abrupt stoppage has led to the accumulation of raw materials, semi-finished and finished goods in the supply chain process. It would take at least one month after resuming operations to restore normalcy in the production front,’’ Budhraja said.\n", "\n", " Untill the crisis started the industry was performing slightly better than the previous year. \" Upto middle of January, the market was showing signs of recovery and then slowly the crisis unfolded,’’ he noted.\n", "\n", "The natural rubber physical trade has also come to a stop with the industry at a standstill. The prices of sheet rubber variety RSS-4 dropped by 7% in the month to Rs 125 per kg on March 23 the last day of the trade. Until the industry resumes operations, the trade may not function.\n", "\n", "At ", "Indian Commodity Exchange", " (ICEX), April contract for delivery traded at Rs 116.62 per kg on Monday.\n", "\n", "\"In the last few weeks, only one tyre company was active in the market purchasing rubber. When the industry starts functioning again there will be a shortage of rubber,’’ said C J Augustine, secretary of ", "Indian Rubber Dealers Federation", ".\n", "\n", "Though overall tapping was less from February, due to hot weather, he reckons that there is some stock left with the traders. \"With the rise in demand, the rubber prices could reach a level of Rs 130 to 140 per kg by May -June,’’ he said. \n", "\n", "\n"]], "tags": ["indian Commodity exchange", "coronavirus", "Automotive Tyre Manufacturer’s Association", "Indian Rubber Dealers Federation", "tyre industry"]},
{"heading": [["Tyre firms upbeat about demand for replacements"]], "sub_heading": [["Tyre makers are upbeat about the demand stemming from the replacement of tyres in the second quarter and reckon that original equipment (OE) sector will take more time to recover. "]], "time": [["Last Updated: May 01, 2020, 11.27 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Tyre makers are upbeat about the demand stemming from the replacement of tyres in the second quarter and reckon that original equipment (OE) sector will take more time to recover. Tyre companies have been operating some of their units with limited number of workers for over a week. “The work is mostly to clear the inventory before the lockdown was declared and to produce agricultural vehicle tyres,” said ", "Rajiv Budhraja", ", director general of ", "Automotive Tyre Manufacturers", "’ Association (Atma).\n", "\n", "Apollo Tyres", " has resumed partial operations in three of its four plants in India. CEAT Tyre has begun operation in five of its six units, except in Mumbai. The situation in Maharashtra is not conducive for opening of the plants, it is said. A large number of tyre units are located in the western and southern parts of the country. But the tyre units are currently running at around 30% capacity as the demand is still weak. \"The first quarter in 2020 has been a washout and in the second quarter, the replacement tyre demand is showing signs of revival,\" Budhraja said. The OE segment had been performing badly before the lockdown and Covid-19 has further worsened the situation, he added.\n", "\n", "The replacement tyre demand is mostly from the truck tyres that brings bulk of the revenue for the sector. The OE segment contributes to around 50% of passenger cars and two wheelers but it has a share of 20% in the truck and bus tyre category.\n", "\n", "\"Now the demand is largely for farm and mining vehicles and truck tyres. Once the lockdown is lifted, we are expecting the replacement demand of passenger cars and two wheelers to go up,\" said ", "Anup Mangaserri", ", senior vice-president, sales, ", "CEAT Tyres", ", adding that the production capacity can be scaled up to 50% in the current situation.\n", "\n"]], "tags": ["Automotive tyre manufacturers", "Ceat Tyres", "Apollo Tyres", "Rajiv Budhraja", "anup mangaserri"]},
{"heading": [["Apollo Tyres leadership team takes pay cut due to coronavirus"]], "sub_heading": [["Gurugram-based Apollo Tyres Friday said it’s leadership team has announced a voluntary reduction in pay due to the impact of COVID-19 on the automotive industry. "]], "time": [["Last Updated: Mar 20, 2020, 01.51 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Gurugram-based ", "Apollo Tyres", " Friday said it’s leadership team has announced a voluntary reduction in pay due to the impact of ", "COVID-19", " on the automotive industry. \n", "\n", "Chairman and Managing Director, ", "Onkar S Kanwar", " and the Vice Chairman & MD, ", "Neeraj Kanwar", " announced a 25% reduction in their salary. Furthermore, the senior management has also taken a voluntary reduction in their salary by 15% in a show of solidarity due to the rapidly deteriorating market conditions caused by the COVID-19 pandemic. \n", "\n", "“Apollo Tyres has a diversified and multinational presence and the pay cuts will affect all senior management at the global level. ", "Coronavirus", " is impacting sales and profitability across the automotive industry as anticipation builds that the worst is yet to come with COVID-19”, the company said in a statement. \n", "\n", "Onkar S Kanwar, Chairman and Managing Director, Apollo Tyres, added, “This is an incredibly difficult time for our employees and their families. We are in unchartered waters but as ‘One Family’ we will work together and make the necessary sacrifices to steer Apollo Tyres in the right direction, to overcome this period.\"\n", "\n", "Kanwar added the company is experiencing slowing demand and disrupted supply chains due to COVID-19. He said the company is working on further measures which it will provide updates on, as they make final decisions.\n", "\n"]], "tags": ["Onkar S Kanwar", "Neeraj Kanwar", "Apollo Tyres", "coronavirus", "virus outbreak"]},
{"heading": [["MRF Tyres partially resumes operations"]], "sub_heading": [["\"We would like to state that based on various relaxations and guidelines issued by the Ministry of Home Affairs, Government of India and by the respective state governments and permissions from local authorities, the company has partially resumed its operations in most of its plants with restricted manpower,\" MRF said in a filing. "]], "time": [["Last Updated: May 06, 2020, 04.13 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Tyre major ", "MRF", " on Wednesday said it has partially resumed operations in most of its plants with restricted manpower following relaxation of ", "lockdown", " guidelines by the government. On March 25, the company had announced that operations of its head office, sales offices and plants across India will remain shut until the lockdown which was imposed to curb spread of the COVID 19 pandemic is lifted. \n", "\n", " \"We would like to state that based on various relaxations and guidelines issued by the ", "Ministry of Home Affairs", ", Government of India and by the respective state governments and permissions from local authorities, the company has partially resumed its operations in most of its plants with restricted manpower,\" ", "MRF Ltd", " said in a regulatory filing. \n", "\n", " Some of the stocking points have also partially resumed operations, it added. \"The continuance of operations in these places however depends on directives of local authorities, issued from time to time, based on the incidence of COVID-19 cases in the area concerned,\" the company said. \n", "\n", " The operations will be scaled up as and when authorities relax the restrictions imposed on the operations, it said.\n"]], "tags": ["mrf", "MRF Ltd", "MRF Tyres", "lockdown", "ministry of home affairs"]},
{"heading": [["JK Tyre resumes partial operations at manufacturing plants across country"]], "sub_heading": [["The tyre maker has commenced production in a graded manner at its manufacturing facilities in Chennai (Tamil Nadu), Kankroli (Rajasthan) and Laksar (through Cavendish industries Ltd - subsidiary company, in Uttarakhand).  The company has also resumed operations at its global research and development hub located in Mysore, Karnataka, JK Tyre said. "]], "time": [["Last Updated: May 08, 2020, 12.57 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "JK Tyre", " and ", "Industries", " on Friday said it has resumed partial operations at various ", "manufacturing", " facilities across the country. The company has restarted operations after adhering to the guidelines issued by the ", "Ministry of Home Affairs", ", and receiving permissions by the respective state governments and local authorities, JK Tyre said in a statement. \n", "\n", " The tyre maker has commenced production in a graded manner at its manufacturing facilities in Chennai (Tamil Nadu), Kankroli (Rajasthan) and Laksar (through Cavendish industries Ltd - subsidiary company, in Uttarakhand), it added. \n", "\n", " The company has also resumed operations at its global research and development hub located in Mysore, Karnataka, JK Tyre said. \n", "\n", " The remaining manufacturing plants of the company in India and Mexico are in preparatory mode and will resume operations subsequently, it added. \n", "\n", " \"As a nation, we are passing through a challenging phase, yet it is imperative that we take small, but significant steps in our endeavour to achieve the right balance again,\" JK Tyre Chairman and MD Raghupati Singhania said. \n", "\n", " The company has worked out a thorough and stringent roadmap that is not only aligned with the protocols of the authorities, but goes a step further in ensuring access to safe workplace, he added. \n", "\n", " \"We are optimistic that the economy and business ecosystem will gradually proceed towards recovery in the coming months,\" Singhania said.\n"]], "tags": ["JK Tyre", "industries", "manufacturing", "lockdown", "coronavirus", "ministry of home affairs"]},
{"heading": [["Ceat extends warranty on tyres by three months"]], "sub_heading": [["The decision to extend warranty on tyres has been taken to express solidarity with customers amidst the continued lockdown, Ceat Tyres said in a statement. The extention is valid on tyres whose warranty is due to expire between March 1 and May 31, it added. "]], "time": [["Last Updated: May 08, 2020, 05.00 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Ceat Tyres", " on Friday said it has extended ", "warranty", " on tyres by three months to support customers due to coronavirus-led nationwide lockdown. The decision to extend warranty on tyres has been taken to express solidarity with customers amidst the continued ", "lockdown", ", ", "Ceat", " Tyres said in a statement. \n", "\n", "The extention is valid on tyres whose warranty is due to expire between March 1 and May 31, it added. \n", "\n", "\"We have taken the decision keeping the safety of our customers in mind. While we all are following the government's directive of social distancing, we want to ensure that our customers continue to get the benefit of the warranty during these trying times,\" Ceat Tyres Chief Operating Officer Arnab Banerjee said.\n"]], "tags": ["ceat", "Ceat Tyres", "extension", "lockdown", "warranty"]},
{"heading": [["Daimler India expects MHCV segment to clock 2.20 lakh units this year"]], "sub_heading": [["The company also said that though the January-March quarter of the 2020 is expected to do a little bit better for the segment, the market may be on a lower trajectory once the BSVI norms come into effect from April 1."]], "time": [["Last Updated: Jan 29, 2020, 01.00 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: Daimler India, which unveiled its all-new range of BSVI-compliant ", "BharatBenz", " brand of trucks and buses on Monday, said it expects MHCV segment to clock 2.20 lakh units this year as against 2.49 lakh units in 2019.\n", "\n", "The company also said that though the January-March quarter of the 2020 is expected to do a little bit better for the segment, the market may be on a lower trajectory once the ", "BSVI norms", " come into effect from April 1.\n", "\n", "\"The Medium and Heavy Commercial Vehicle market went down by 34 per cent to 2.49 lakh units in 2019 as compared to 2.78 lakh units in 2018. That is a massive drop. We are looking the market of the size of 2.20 lakh this year,\" Daimler India Commercial Vehicle Managing Director and Chief Executive Officer, Satyakam Arya, said at the event.\n", "\n", "The 10 per cent expected contraction in volume will be on account of the BS-VI implementation. There is as much as 25 per cent excess capacity in the market as per the fleet owners and there will be some advanced buying in the January-March quarter, he added.\n", "\n", "If all the measures which the government is taking and the budget is really friendly for boosting consumption, \"We expect that the market will then return to recovery somewhere in the July or October quarter,\" he said.\n", "\n", "He, however, sounded confident that the full recovery will take place in 2021.\n", "\n", "Arya said that BharatBenz has lines up 42 launches for the Indian and other markets as against 52 variants last year.\n", "\n", "\"Year-on-year, we look at which variant do we have, which don't make sense any longer and which ones we need to add. We slowly expanding our portfolio and we will continue to do,\" he added.\n", "\n", "He said BharatBenz is hopeful that the finance minister will bring up a budget which is friendly for boosting consumption and investments.\n", "\n", "\"We have also seen a lot of emphasis on infrastructure, investments in infrastructure and we have already started to see that on ground. Of late, the fleet owners have come back to buy trucks. So, all in all looks positive,\" Arya said.\n", "\n", "The company plans to expand the dealership network to 300 this year from 237 at present, he said.\n", "\n", "The new BS-VI compliant product portfolio is available for pre-bookings and will be introduced depending on the fuel availability in each region, the company said.\n", "\n", "\"BharatBenz's new commercial vehicle range offers customers the solution they need for the future, setting new benchmarks for medium and heavy duty trucks with improved fuel efficiency, safety and connectivity,\" Arya said.\n", "\n", "Arya, however, did not disclose the prices of the new offerings and left it for the launch time, they are likely to be 10-15 per cent higher compared to existing range.\n", "\n", "Going forward, BharatBenz will move away from tonnage and focus on customised solutions for different applications, he said, adding its trucks are 10 per cent more fuel-efficient and offer up to 20 per cent longer service intervals, there by giving an up to six per cent cost advantage over other trucks.\n", "\n", "Besides, the new range of trucks will come with a standard warranty of up to 6-years and an extended warranty of eight years.\n", "\n", "Daimler India Commercial Vehicles", " is a 100 per cent subsidiary of the ", "Daimler AG", " of Germany.\n", "\n", "Its plant at Oragadam near Chennai manufactures trucks with a payload of 9-49 tonnes besides buses and coaches under the brand name BharatBenz trucks and Mercedes-Benz buses.\n", "\n", "DICV has already begun receiving orders from customers, the company said. \n", "\n"]], "tags": ["BharatBenz", "Daimler AG", "mercedes", "BSVI", "BSVI norms", "Daimler India Commercial Vehicles"]},
{"heading": [["‘Pre-buying of commercial vehicles gaining momentum’"]], "sub_heading": [["Daimler India Commercial Vehicles (DICV), the maker of Bharat Benz trucks, expects January-March quarter (Q1) to be positive after decline of multiple quarters, and is hoping for sops in the upcoming budget to drive consumption and cushion the decline that is expected post price increase of almost 10-15% in Q2 and Q3 of 2020 due to the implementation of BS-VI norms-compliant technology."]], "time": [["Last Updated: Jan 28, 2020, 10.41 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Contractors with ", "infrastructure", " projects have started to get paid and with additional fiscal fillip widely expected in February’s annual budget just before ", "BS-VI emission norms", " kick in later in April, pre-buying of ", "commercial vehicles", " is gaining momentum.\n", "\n", "Daimler India Commercial Vehicles", " (DICV), the maker of ", "Bharat Benz trucks", ", expects January-March quarter (Q1) to be positive after decline of multiple quarters, and is hoping for sops in the upcoming budget to drive consumption and cushion the decline that is expected post price increase of almost 10-15% in Q2 and Q3 of 2020 due to the implementation of BS-VI norms-compliant technology.\n", "\n", "Satyakam Arya, managing director of DICV, said the liquidity situation in the market has improved and thanks to the government payout to contractors, the offtake in the market has improved too. “All fleet owners know that the cost will go up and we have seen a change; some of them over the last few weeks have resorted to pre-buying. They have said that they have received the payment; new contracts are getting awarded. Scrappage policy, if defined well, can also help the industry,” added Arya.\n", "\n", "The DICV head said he is hopeful the finance minister will put out a budget that boosts consumption and revives investment, which may pull the industry out of this prolonged slowdown.\n", "\n", "IIP growth turned positive in November after declining for four consecutive months. Capital expenditure by the Government of India has gained momentum after a tepid start at the beginning of the year.\n", "\n", "After witnessing a 4% drop in the first four months of this financial year, government capex grew 32% during August to November to Rs 1.06 lakh crore, ETIG data compiled from the Controller General of Accounts showed. In the first eight months of this fiscal, it grew 11.7% to Rs 2.13 lakh crore. The budget estimate for FY20 had projected the figure at Rs 3.38 lakh crore.\n", "\n", "The Union government’s capex is expected to rise further in the next fiscal if the targets for the national infrastructure pipeline are met. Infrastructure spending as a percentage of the gross domestic product is expected at 8.6% in FY21 as compared to 6.6% in the current fiscal, according to Axis Capital.\n", "\n", "The pick-up in the infrastructure projects augurs well for the heavy truck makers given that nearly half the truck demand comes from this segment. It must be noted that heavy truck market and IIP growth have high positive correlation.\n", "\n", "However, Arya cautions that despite demand rising in Q1, the market for medium and heavy trucks is likely to slip by another 10% this year to about 2.2 lakh units as against 2.49 lakh sold in 2019, making it the second consecutive year of decline after the industry registered a 34% fall in sales in 2019 from 3.78 lakh units sold a year earlier.\n", "\n", "On its part, the company has come out with a new range of trucks, which it claims is 10% better on fuel efficiency and has 6% lower maintenance cost than the outgoing BS-IV trucks.\n", "\n"]], "tags": ["Budget 2020", "infrastructure", "Bharat Benz trucks", "Daimler India Commercial Vehicles", "Commercial Vehicles"]},
{"heading": [["NTPC forays into electric bus business"]], "sub_heading": [["Under the project, the company is offering complete transport solution, including twenty air-conditioned electric buses of nine meters each in phase I.  Apart from deployment of electric buses, NTPC and Andaman administration are collaborating for setting up public charging infrastructure in the Island.  Electric buses are all set to start running on a commercial basis by August 2020."]], "time": [["Last Updated: Mar 06, 2020, 05.03 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Kolkata: ", "NTPC Vidyut Vyapar Nigam", " Ltd (NVVN), a wholly-owned subsidiary of NTPC, has signed an agreement with the Department of Transport of Andaman & Nicobar Islands for deployment of electric buses in the Union Territory.\n", "\n", "Under the project, the company is offering complete transport solution, including twenty air-conditioned electric buses of nine meters each in phase I. Apart from deployment of electric buses, ", "NTPC", " and Andaman administration are collaborating for setting up public charging infrastructure in the Island. Electric buses are all set to start running on a commercial basis by August 2020.\n", "\n", "Introduction of electric buses in the island will go a long way in protecting the diverse ecology by completely eliminating tailpipe emission; low levels of sound from e-buses shall also significantly reduce noise pollution. Further, comfortable seating, smooth driving, GPS enabled buses are anticipated to bring in features like security and comfort for commuters. This initiative will lead to an increase in overall usage of public transport in the island mentioned a statement made by the company.\n", "\n", "Last year, NVVN, had expressed its intention of procuring and operating 250 air-conditioned (AC) electric buses. The electric buses were meant for Jabalpur, Bhopal, and Indore in Madhya Pradesh.\n", "\n", "The plan was to introduce 50 buses in Jabalpur and 100 each for Bhopal & Indore under ‘Faster Adoption and Manufacturing of Electric Vehicles in India Phase II (FAME India Phase II) program.\n", "\n"]], "tags": ["NTPC Vidyut Vyapar Nigam", "electric bus business", "NTPC", "electric bus", "NTPC electric bus"]},
{"heading": [["Tractor industry evades Covid-19 bug, gets ready for next stage emission norm"]], "sub_heading": [["The sector, which hardly depends on imports from China as localisation levels of critical parts such as sheet metal, engines and transmission gear are close to 95%, seems to have, for a start, escaped the debilitating effect of the Covid-19 pandemic."]], "time": [["Last Updated: Mar 24, 2020, 09.45 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: India’s ", "tractor", " industry is in for some good cheer this year, if industry experts are to be believed.\n", "\n", "The sector, which hardly depends on imports from China as localisation levels of critical parts such as sheet metal, engines and transmission gear are close to 95%, seems to have, for a start, escaped the debilitating effect of the ", "Covid-19", " pandemic.\n", "\n", "“The supply of tractor parts has been normal with no impact, and growth in tractor sales in February of over 20% is a testimony to that,” said Rajesh Jejurikar, president of the farm equipment sector at Mahindra & Mahindra, the country’s largest tractor maker.\n", "\n", "The demand for tractors is also expected to strengthen on the back of a robust Rabi output and prevailing crop prices, Jejurikar added.\n", "\n", "In fact, just as the automotive sector will move to the new Bharat Stage (BS) VI emission norms from April 1, the tractor industry is also gearing up to adopt the BS TR-Tractor EM-Emission (TREM) IV norms (for tractors over 50 HP) by October this year.\n", "\n", "The proposed switchover to BS TREM IV is likely to impact around 15% of current industry volumes in the near term, while the rest of the industry (tractors below 50 HP) will migrate to the new norms by October 2023.\n", "\n", "“It will be interesting to see how OEMs manage the incremental cost of transition and how consumers react to the final price points that get passed on to them,” said Vinay Raghunath, partner, auto sector, EY India.\n", "\n", "The phased approach of transition to new norms will, however, give OEMs an opportunity to test the response of the Indian tractor consumer, tweak their product portfolios in the medium term and also gradually manage incremental product costs over the next couple of years, Raghunath said.\n", "\n", "“Looking at the farming eco-system, we feel it is important that the transition to TREM IV should be in a phased manner to enable the entire ecosystem to gear up other than authorised service centres, comprising of local village level mechanics/technicians,” said Raman Mittal, executive director of tractor manufacturer Sonalika Group.\n", "\n", "While companies are tight-lipped about the cost of migrating to the new emission norm, Tractors Manufacturers Association (TMA) president TR Kesavan said it would require an investment of approximately Rs 12-15 crore per manufacturer per engine type.\n", "\n", "Under the new norms, the major changes will be in the fuel injection system, exhaust after-treatment for engines and the electronics mechanism, experts said.\n", "\n", "“In addition, around Rs 350-400 crore would be required for each stage of engine development, as nowadays, the volumes for the domestic industry are substantially larger,” he said.\n", "\n", "Kesavan, who is also the group president of Chennai-based tractor manufacturer TAFE, said the industry body is ready to move to the next level of emission norms because India has been exporting tractors to developing countries.\n", "\n", "“However, we have been repeatedly telling the government that farmers are not ready to use high-cost technology that will increase both the ownership and operating cost,” he added.\n", "\n", "Industry experts said farmers may have to shell out between Rs 1.2 lakh and Rs 1.6 lakh for TREM 4 compliant tractors, while it could go up to Rs 1.5-2 lakh for TREM V compliant vehicles, from October 2023.\n", "\n", "With the agrarian economy heavily dependent on the tractor industry , the confidence meted out by its manufacturers will go a long way in restoring the confidence of the Indian economy, say experts. \n", "\n", "\n", "\n"]], "tags": ["coronavirus impact", "tractor", "coronavirus", "Mahindra & Mahindra", "Rabi crops"]},
{"heading": [["VE Commercial Vehicle to go ahead with Bhopal plant investment, production to begin in April 2020"]], "sub_heading": [["“Dealers are defensive, financers are defensive and so are automakers. As a result, there has been hardly any pre-buy. We expect the same to continue in March. Hence, the demand should be much better in the next financial year than expected earlier,” Vinod Aggarwal, managing director said."]], "time": [["Last Updated: Mar 04, 2020, 11.21 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: VE ", "Commercial Vehicles", " Ltd, a joint venture between ", "Eicher Motors", " and Swedish truck maker ", "Volvo", ", has decided to go ahead with its plan of setting up a new 40,000-units-a-year factory in Bhopal, even as the Indian commercial vehicle market stares at its steepest decline in growth in a decade.\n", "\n", "Vinod Aggarwal, managing director, VE Commercial Vehicles, told ET that the first two quarters of 2020-21 may not see a very steep decline on account of price hike. \n", "\n", "“Dealers are defensive, financers are defensive and so are automakers. As a result, there has been hardly any pre-buy. We expect the same to continue in March. Hence, the demand should be much better in the next financial year than expected earlier,” said Aggarwal.\n", "\n", "Sales in the 16-55 tonne truck segment plunged more than 50% year-on-year in February, as against the year-to-date decline of 45%, and it appears that the decline in March may be similar to that for other truck makers as they have stopped producing BS-IV trucks.\n", "\n", "In April 2019-January 2020, VE Commercial Vehicles registered a decline of more than 23% year-to-year to about 39,000 units, with a market share of 6%.\n", "\n", "The company’s BS-IV stock has come to down to just five days and much of its production is aligned to retail demand. Aggarwal said the company is insulated from Covid-19 and has its supplies secured for the month of March.\n", "\n", "The company expects the market to rebound to low single-digit growth in the next financial year and outpace the market, said Aggarwal.\n", "\n", "Unveiling the company’s Eutech BS-VI range of trucks in Pithampur on Wednesday, Aggarwal said that while the company is in the midst of severe cost-cutting plans and may defer some investment, it won’t stop strategic investments like expansion of the Bhopal factory, where production is set to begin from April 1.\n", "\n", "The company has rationalised the number of shifts and controlled all discretionary expenses. It has deferred some capital expenditure but that is not impacting strategic investments like the Bhopal factory.\n", "\n", "The company will invest about Rs 250 crore instead of Rs 400 crore in the Bhopal factory. The paint shop planned for Bhopal plant has been deferred and the company will utilise its Pithampur plant, also in the state of Madhya Pradesh, for the paint operation. The move will ensure that the excess staff from Pithampur can be utilised at the Bhopal plant and there may not be any job cuts.\n", "\n", "The new BS-VI trucks are expected to come at a 7-15% price premium over the existing range and the experience of supplying more than 100,000 Euro VI engines to over 40 countries for Volvo will give the company an edge, said Aggarwal.\n", "\n"]], "tags": ["VE Commercial Vehicle", "Bhopal plant investment", "Eicher Motors", "Commercial Vehicles", "volvo"]},
{"heading": [["Volvo-Eicher JV to go ahead with Bhopal factory plan"]], "sub_heading": [["VE Commercial Vehicles, a joint venture between Eicher Motors and Swedish truck maker Volvo, has decided to go ahead with its plan of setting up a new 40,000-units-a-year factory in Bhopal even as the Indian commercial vehicle market stares at its steepest decline in growth in a decade."]], "time": [["Last Updated: Mar 06, 2020, 12.02 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: ", "VE Commercial Vehicles", ", a joint venture between ", "Eicher Motors", " and Swedish truck maker ", "Volvo", ", has decided to go ahead with its plan of setting up a new 40,000-units-a-year factory in ", "Bhopal", " even as the Indian commercial vehicle market stares at its steepest decline in growth in a decade.\n", "\n", "Vinod Aggarwal, managing director, VE Commercial Vehicles, told ET that the first two quarters of 2020-21 may not see a very steep decline on account of price hike.\n", "\n", "“Dealers are defensive, financers are defensive and so are automakers. As a result, there has been hardly any pre-buy. We expect the same to continue in March. Hence, the demand should be much better in the next financial year than expected earlier,” said Aggarwal.\n", "\n", "Sales in the 16-55 tonne truck segment plunged more than 50% yearon-year in February. In April 2019-January 2020, VE Commercial Vehicles registered a decline of more than 23% year-to-year to about 39,000 units, with a market share of 6%.\n", "\n", "The company’s BS-IV stock has come to down to just five days and much of its production is aligned to retail demand. Aggarwal said the company is insulated from Covid-19 and has its supplies secured for March. It expects the market to rebound to low single-digit growth in the next financial year and outpace the market, said Aggarwal.\n", "\n", "Unveiling the company’s Eutech BS-VI range of trucks in Pithampur on Wednesday, Aggarwal said that while the company is in the midst of severe cost-cutting plans and may defer some investment, it won’t stop strategic investments like expansion of the Bhopal factory, where production is set to begin from April 1.\n", "\n"]], "tags": ["VE Commercial Vehicles", "coronavirus", "Bhopal", "Eicher Motors", "volvo", "auto slowdown"]},
{"heading": [["VE Commercial Vehicles sales down 83 per cent in March"]], "sub_heading": [["New Delhi, Apr 1 () VE Commercial Vehicles (VECV) on Wednesday reported an 82.7 per cent decline in sales at 1,499 units in March as compared to 8,676 units in the same month last year."]], "time": [["Last Updated: Apr 01, 2020, 04.27 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: VE Commercial ", "Vehicles", " (VECV) on Wednesday reported an 82.7 per cent decline in sales at 1,499 units in March as compared to 8,676 units in the same month last year. The company, which is a ", "Volvo Group", " and ", "Eicher Motors", " joint venture, said Eicher branded trucks and buses recorded total sales of 1,476 units last month, compared to 8,545 units in March 2019, a decline of 82.7 per cent. \n", "\n", " In the domestic ", "commercial", " vehicles market, Eicher branded trucks and buses clocked sales of 1,409 units last month as compared to 7,329 units in March 2019, down 80.8 per cent, the company said in a statement.\n"]], "tags": ["Volvo Group", "commercial", "vehicles", "coronavirus", "Eicher Motors"]},
{"heading": [["Tata Motors extends commercial vehicles' warranty expiring during lockdown"]], "sub_heading": [["As part of the service extensions for the commercial vehicle customers, Tata Motors said it is providing two-month extension for free services previously scheduled during the lockdown period. Moreover, the company has also extended 'Tata Suraksha' annual maintenance contract for all those with an expiry during the period of lockdown."]], "time": [["Last Updated: Apr 21, 2020, 02.18 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Tata Motors", " on Tuesday said it has extended by two months the warranty period for all of its commercial vehicles which are expiring during the period of the ", "lockdown", ".\n", "\n", "In the wake of the COVID-19 pandemic, Tata Motors has extended the warranty for its commercial vehicles customers worldwide, the company said in a statement.\n", "\n", "As part of the service extensions for the commercial vehicle customers, Tata Motors said it is providing two-month extension for free services previously scheduled during the lockdown period.\n", "\n", "Moreover, the company has also extended 'Tata Suraksha' annual maintenance contract for all those with an expiry during the period of lockdown.\n", "\n", "It also said a one-month extension for customers to avail the AMC service, previously scheduled during the lockdown is being provided.\n", "\n"]], "tags": ["Tata Motors", "vehicle warranty extended", "lockdown", "coronavirus", "covid 19"]},
{"heading": [["Ashok Leyland to resume operations at three plants"]], "sub_heading": [["The government had relaxed guidelines for extended lockdown and allowed industrial units in rural areas or outside municipal limits to resume partial operations under strict safety and hygiene conditions from April 20."]], "time": [["Last Updated: Apr 22, 2020, 08.07 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Chennai: Commercial vehicles manufacturer ", "Ashok Leyland", " on Wednesday confirmed that it has received permission from the relevant government authorities to resume operations at its Alwar, Bhandara and ", "Pantnagar", " plants.\n", "\n", "\"We are currently working out the supply chain readiness post which we will resume operations and commence production in line with demand,” said NV Balachandar, ", "President", " - HR, ", "Communication", " and ", "CSR", ", Ashok Leyland.\n", "\n", "The government had relaxed guidelines for extended lockdown and allowed industrial units in rural areas or outside municipal limits to resume partial operations under strict safety and hygiene conditions from April 20.\n", "\n", "Vipin Sondhi, Managing Director & CEO, Ashok Leyland emphasised that logistics and transportation are the backbone of the economy, and in these challenging times, vehicles need to be running to transport essentials.\n", "\n", "Further, he said the Government too could assist truck drivers in multiple ways. These include providing minimum wages, ensuring insurance and regulating and mandating the working conditions for them through cabin regulation.\n", "\n"]], "tags": ["CSR", "Pantnagar", "ashok leyland", "communication", "President"]},
{"heading": [["M&M tractor sales down 83% to 4,772 units in April"]], "sub_heading": [["The company had sold a total of 28,552 units in the same month last year, M&M said in a statement."]], "time": [["Last Updated: May 01, 2020, 02.20 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Mahindra & Mahindra (M&M) on Friday reported 83 per cent decline in total tractor ", "sales", " at 4,772 units in April with ", "lockdown impacting sales", ".\n", "\n", "The company had sold a total of 28,552 units in the same month last year, M&M said in a statement.\n", "\n", "Domestic tractor sales were down 83 per cent at 4,716 units last month as against 27,495 units in April 2019, it added.\n", "\n", "Exports were at 56 units last month as compared to 1,057 units in the year-ago period, a decline of 95 per cent, the company said.\n", "\n", "Commenting on the sales performance, M&M President - Farm Equipment Sector ", "Hemant Sikka", " said,\"The extension of the national lockdown impacted the business, with dealers partially open for just a few days.\"\n", "\n", "On the outlook, he said,\"Going forward, several positive factors including a good Rabi ", "output", ", opening of procurement centres by the government, indication of good crop prices, reservoir levels etc., augur well for tractor demand.\"\n", "\n", "Sikka, however, said,\"The rate of improvement will depend on how quickly the on-ground sales operations, including the start of NBFCs are normalised, following the relaxation of the lockdown.\" \n", "\n"]], "tags": ["output", "Tractors", "Mahindra & Mahindra", "Hemant Sikka", "lockdown impacting sales", "sales"]},
{"heading": [["Ashok Leyland reports zero sales in April"]], "sub_heading": [["Commercial vehicle major Ashok Leyland on Tuesday said it sold no units last month amid the nationwide lockdown. The company had sold a total of 13,626 units in the domestic and export markets in April 2019, Ashok Leyland said in a statement."]], "time": [["Last Updated: May 05, 2020, 12.55 PM IST"]], "publisher": [["PTI"]], "article": [["Commercial vehicle major ", "Ashok Leyland", " on Tuesday said it sold no units last month amid the nationwide ", "lockdown", ". The company had sold a total of 13,626 units in the domestic and ", "export markets", " in April 2019, Ashok Leyland said in a statement.\n", "\n", "In view of the lockdown, manufacturing activities and the company's dealerships across India, remained affected and recorded nil production and sales, for the month of April 2020, it said. The company said it will follow the strict directives of government of India on COVID-19 ", "pandemic", " and will start activities upon clearances from the relevant authorities and will report accordingly.\n", "\n"]], "tags": ["ashok leyland april sales", "zero sales", "ashok leyland", "export markets", "lockdown", "pandemic"]},
{"heading": [["Daimler India Commercial Vehicles resumes plant operations"]], "sub_heading": [["The company said it was able to restart operations at the plant in less than 24 hours after receiving permission from local authorities as it had started intensive preparation even before the lockdown in India came into effect in March, DICV said in a statement."]], "time": [["Last Updated: May 07, 2020, 11.43 AM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Daimler India Commercial Vehicles", " (DICV) on Thursday said it has resumed plant operations in a phased manner.\n", "\n", "The company said it was able to restart operations at the plant in less than 24 hours after receiving permission from local authorities as it had started intensive preparation even before the lockdown in India came into effect in March, DICV said in a statement.\n", "\n", "Commenting on the resumption of operations, DICV Managing Director & CEO Satyakam Arya said :\"Being part of the Daimler global network allowed us to see the implications of COVID-19 well before the lockdown was announced here in India. We immediately initiated a Crisis Management Team (CMT) to steer us safely through this difficult situation.\"\n", "\n", "The CMT consists of representatives from across the organisation and holds virtual meetings with DICV's top executives on a daily basis, the company said.\n", "\n", "It has initiated hundreds of health, safety and sanitisation measures over the last few months, ranging from mass cleaning of DICV's 400 acre Oragadam plant, near ", "Chennai", ", to renovations of facilities designed to ensure social distancing norms are followed, it added.\n", "\n", "\"The CMT has also taken charge of tracking the health and safety of the company's over 4,000 employees, plus overseeing the company's extensive CSR contributions,\" the statement said.\n", "\n", "The company is ramping up gradually with a minimum workforce of essential employees to start with, then a planned move to full capacity as and when the lockdown ends, it added.\n", "\n", "\"Dealerships across the country have already begun to reopen as local restrictions ease, ensuring ", "BharatBenz", " customers have access to the free service and warranty extensions the company began offering at the start of the crisis,\" DICV said.\n", "\n", "BharatBenz is a brand of Daimler India Commercial Vehicles.\n", "\n", "Arya said, \"DICV's number one priority is health and safety of our stakeholders, from our employees and customers to our dealers and suppliers.\" \n", "\n"]], "tags": ["BharatBenz", "Lockdown 3.0", "covid impact", "Chennai", "Daimler India Commercial Vehicles", "Back to business"]},
{"heading": [["Tractors a symbol of an upbeat agriculture sector"]], "sub_heading": [[" Demand for tractors is rising as fertiliser sales and foodgrain production hit record highs, reservoirs hold more water than 10-year average and a normal monsoon is forecast."]], "time": [["Last Updated: May 19, 2020, 08.44 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Demand for ", "tractors", " is rising as ", "fertiliser sales", " and foodgrain production hit record highs, reservoirs hold more water than 10-year average and a normal monsoon is forecast. \n", "\n", "Demand for tractors has outstripped supply, as output has fallen with factories operating at a quarter of their capacity. Segment leader Mahindra & Mahindra has started planning for a second shift to meet demand, while rivals Escorts and Sonalika tractors have indicated that the market would return to normal levels within a quarter. Insiders expect the segment to continue growing and post the best performance in the automotive industry.\n", "\n", " \n", "\n", "Demand is getting better by the week and it is adding to the confidence, said Hemant Sikka, chief executive, farm equipment business, M&M. “Enquiry levels are going up, with 65% of our markets opened, this will go up to 80% within a week. The ", "cash flow", " is strong in the rural area on the back of a very good harvest. The government has been proactive in getting the mandi system moving. If the infection curve does not worsen, we can return to normalcy within a quarter,” he said.\n", "\n", " \n", "\n", "More than 80% of wholesale agriculture markets are fully functional now compared with 40% soon after ", "lockdown", " started in late March. The recovery from demand shock due to the lockdown, therefore, is expected to be faster in rural areas than in urban centres, thanks to better cash flow prospects from crops.\n", "\n", "Escorts said sales should start growing in the second quarter.\n", "\n"]], "tags": ["mumbai", "Tractors", "covid", "Fertiliser sales", "lockdown", "coronavirus", "cash flow"]},
{"heading": [["JK Tyre crosses 2 crore units' production milestone of trucks, bus radial tyres"]], "sub_heading": [["Commenting on the feat, JK Tyre Chairman and Managing Director Raghupati Singhania said, \"As a pioneer and market leader, we remain committed to driving innovation and bringing products for our fleet customers that are high on efficiency, safety and cost effectiveness\". "]], "time": [["Last Updated: May 26, 2020, 12.47 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "JK Tyre", " on Tuesday said it has crossed 2 crore units production milestone of trucks and bus radial (TBR) ", "tyres", ". The company had achieved the distinction of crossing the 1 crore production mark of TBRs in August 2016, JK Tyre said in a statement. \n", "\n", " Commenting on the feat, JK Tyre Chairman and Managing Director ", "Raghupati Singhania", " said, \"As a pioneer and market leader, we remain committed to driving innovation and bringing products for our fleet customers that are high on efficiency, safety and cost effectiveness\". \n", "\n", " The company will continue to work towards strengthening its position through technology and revolutionary sustainable mobility solutions, he added. \n", "\n", " The firm had recently launched '", "Smart Tyre", "' technology, which monitors the tyre's vital statistics, including pressure and temperature. \n", "\n", " It had also launched the next generation of fuel-efficient 'Fuel Saver Technology' TBR tyres that save up to 8 per cent fuel in comparison to normal ", "radial tyres", ", the statement said.\n"]], "tags": ["tyres", "JK Tyre", "radial tyres", "Raghupati Singhania", "smart tyre"]},
{"heading": [["Rural prosperity drive demand, tractor makers look to ramp up supply"]], "sub_heading": [["Demand for tractors has outstripped supply, as output has fallen with factories operating at a quarter of their capacity due to the lockdown regulations. "]], "time": [["Last Updated: May 19, 2020, 10.20 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: As India crawls back to work, the farming lot seems to be far ahead of the rest. With fertiliser sales and food-grain production at record highs, reservoirs holding more water than their 10-year average and forecasts of a normal monsoon, the farming sector is holding high hopes amid the Covid-19 pandemic that has crippled the economy. A direct beneficiary of this is the ", "tractor segment", ".\n", "\n", "Demand for tractors has outstripped ", "supply", ", as output has fallen with factories operating at a quarter of their capacity due to the ", "lockdown regulations", ". Segment leader Mahindra & Mahindra has started planning for a second shift to meet demand, while rivals Escorts and Sonalika tractors have indicated that the market would return to normal levels within a quarter. Industry insiders expect the segment to continue growing and post the best performance in the automotive industry.\n", "\n", "Hemant Sikka, President for ", "Farm Equipment Business", " at Mahindra & Mahindra says every week is better than the previous week for the tractor market, which is adding to the confidence. \"The challenge is more on the supply side than on demand, There is strong traction in the market. Enquiry levels are going up. We are open in 65% of our markets, which will go upto 75% within a week. The cash flow is good in the rural markets on the back of a very good harvest. Government has been proactive in getting the Mandi procurement system moving. If the Covid infection curve does not worsen, we can come back to normalcy within a quarter,\" added Sikka.\n", "\n", "\n", "\n", "\n", "More than 80% of wholesale agriculture markets are fully functional now compared with 40% soon after the country went into the lockdown in late March. The government had exempted agriculture activities from the lockdown restrictions and also stepped up procurement of food grains. Meanwhile, the e-NAM online platform for agricultural commodities now covers 1,000 mandis in 18 states and three union territories, helping farmers get better prices for their produce.\n", "\n", "The recovery from demand shock due to the lockdown, therefore, is expected to be faster in rural areas than in urban centres, thanks to better cash flow prospects from crops. The chief executive of a non-bank lender said its loan collection in the rural market even in lockdown period was more than 90%, suggesting that income in rural areas was not affected much by the lockdown. Escorts, in its March quarter earnings conference, said sales should return to half the normal in May, normalise by June and start growing in the fiscal second quarter. Its expectations were based on strong enquiries. Nearly half of Escorts’ showrooms and 90% of repair shops are operational.\n", "\n", "International Tractors, the maker of the Sonalika brand, in a call with investors said there was a loss in volume in April and May, but most of this was expected to be recovered in the coming months. Volume in the tractor segment has grown 5.18% annually in the past five fiscal years, according to data compiled by ETIG. With sales expected to expand this fiscal year as well, the data suggest that the tractor sector is resilient to the general economic cycle.\n", "\n"]], "tags": ["lockdown regulations", "farm equipment business", "Hemant Sikka", "supply", "tractor segment"]},
{"heading": [["Mahindra & Mahindra tractor sales fall 1 per cent in May, exports slump 72 per cent"]], "sub_heading": [["New Delhi, Jun 1 () Mahindra & Mahindra on Monday reported 1 per cent decline in total tractor sales at 24,341 units in May."]], "time": [["Last Updated: Jun 01, 2020, 03.49 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Mahindra & Mahindra on Monday reported 1 per cent decline in total tractor sales at 24,341 units in May. The company had sold 24,704 units of tractor in the same month last year, Mahindra & Mahindra said in a statement. \n", "\n", "Domestic tractor sales stood at 24,017 units last month as compared to 23,539 units in May 2019, it added. \n", "\n", "Exports, however, were down 72 per cent at 324 units as against 1,165 units in May last year. \n", "\n", "Mahindra & Mahindra Ltd President - ", "Farm Equipment Sector", ", Hemant Sikka said the timely relaxation of the lockdown for the agricultural sector helped ensure the speedy recovery of tractor demand during May. \n", "\n", "\"Farmer sentiment is likely to remain positive due to several developments including robust ", "Rabi", " crop production, higher procurement, good price realizations and the forecast of a normal monsoon that bodes well for a good ", "Kharif crop", ". All these augur well for tractor demand going forward,\" he added.\n"]], "tags": ["Farm Equipment Sector", "Mahindra & Mahindra Ltd", "rabi", "exports", "Kharif crop", "Mahindra Group"]},
{"heading": [["Bajaj Auto total sales plunge 70 pc in May"]], "sub_heading": [["Total domestic sales declined by 83 per cent to 40,074 units last month as compared to 2,35,824 units in May 2019, Bajaj Auto said. The company further said its total two-wheeler sales were down 69 per cent at 1,12,798 units as compared to 3,65,068 units in the year-ago month. "]], "time": [["Last Updated: Jun 02, 2020, 11.54 AM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Bajaj Auto", " on Tuesday reported 70 per cent decline in total sales at 1,27,128 units in May as against 4,19,235 units in the same month last year. Total domestic sales declined by 83 per cent to 40,074 units last month as compared to 2,35,824 units in May 2019, Bajaj Auto said. \n", "\n", " The company further said its total two-wheeler sales were down 69 per cent at 1,12,798 units as compared to 3,65,068 units in the year-ago month. \n", "\n", " Domestic two-wheeler sales were at 39,286 units last month as against 2,05,721 units in May 2019, a decline of 81 per cent, it added. \n", "\n", " Overall commercial vehicles sales also declined by 74 per cent at 14,330 units last month as compared to 54,167 units in the year-ago period, with domestic sales dropping by 97 per cent to 788 units as against 30,103 units in May 2019. \n", "\n", " Bajaj Auto said its total exports last month declined by 53 per cent to 87,054 units as compared to 1,83,411 units in same period of last year.\n"]], "tags": ["Bajaj Auto domestic sales", "Bajaj Auto sales", "bajaj auto", "Bajaj Auto May sales"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [["Coronavirus supply chain shock will have negative impact on Indian auto component sector"]], "sub_heading": [["ICRA said province-wide lockdowns and severe containment measures across China in January and February 20 lead to supply chain disruptions globally, given China's role as the fourth-largest exporter of auto components. While China is limping back to a reduced state of normalcy, the global spread of COVID-19, to the USA and Europe, has created new disruptions. "]], "time": [["Last Updated: Apr 03, 2020, 04.11 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Rating agency ", "ICRA", " on Friday said the supply chain shock due to the coronavirus ", "pandemic", " will have negative impact for Indian ", "auto component", " industry. The ", "COVID-19", " supply chain disruptions will manifest into a demand shock lasting multiple quarters for the domestic industry, ICRA said in a statement. \n", "\n", " The rating agency, which undertook an extensive survey across key auto component importers and exporters to understand the impact of disruptions in the global auto component supply chain because of the pandemic, said it expects a significant scale down in exports over the next two quarters. \n", "\n", " \"Though most respondents felt that India stood to gain when global OEMs (original equipment manufacturers) eventually re-source their requirements in a bid to geographically de-risk their supply chain, there were reservations that competition from other countries would make this difficult,\" it said. \n", "\n", " Given the global slowdown, inventory build-up for export-oriented companies is expected in the coming months with a possible receivable stretch, it added. \n", "\n", " Commenting on the scenario, ICRA Vice-President and Sector Head ", "Pavethra Ponniah", " said, \"COVID-19, which has so far disrupted the global complex auto-component supply chains and immediate term automotive demand, could manifest into a demand shock lasting multiple quarters for the domestic industry.\" \n", "\n", " As for the replacement demand, while the same would witness some pick-up, post the lockout, as system inventories are replenished, export demand for components will witness a sharp correction in 2020-21. \n", "\n", " \"Large-scale OEM plant closures in USA and Europe, apart from a global slowdown, will impact demand from India,\" Ponniah said. \n", "\n", " ICRA said that according to its ICRA's channel check, responses indicate that over 70 per cent of the respondents have faced or are likely to face supply chain disruptions because of COVID-19. As many as 35 per cent of the respondents said there were no alternative sources of input material in the event of supply chain disruptions of this nature in China, largely for electronics. \n", "\n", " Of the respondents who said that there were alternative sources globally, 47 per cent said it needed over 3 months, with approvals from OEMs, and would require substantial re-tooling costs and validation time/costs. \n", "\n", " While the demand slowdown from COVID-19 has softened commodity prices, 35 per cent of the sample indicated that there were cost increases; the cost of electronic components has increased with supply disruption from China. \n", "\n", " Ponniah said, \"While the threat from China has started subsiding, after peaking in February 2020, risks emanating from USA and Europe, which are bigger cogs in the global supply chain will impact the industry in Q1 FY2021 and beyond.\" \n", "\n", " On a positive note, China, which reported its first COVID-19 patient on December 31, 2019, has resumed operations across the country, and also recently in the viral epicenter of Hubei, which is an auto component hub housing seven OEMs, 13 large auto ancillaries and over 10 electronic companies. \n", "\n", " \"According to ICRA's findings, factory operations were restored to about 60 per cent, with some persistent absenteeism. Inter- and intra-province, along with port freight, has however been identified as a roadblock for exports from China,\" Ponniah added. \n", "\n", " ICRA said province-wide lockdowns and severe containment measures across China in January and February 20 lead to supply chain disruptions globally, given China's role as the fourth-largest exporter of auto components. While China is limping back to a reduced state of normalcy, the global spread of COVID-19, to the USA and Europe, has created new disruptions.\n"]], "tags": ["Pavethra Ponniah", "icra", "coronavirus", "pandemic", "auto component"]},
{"heading": [["Coronavirus: Minda Industries, Bharat Forge to stop manufacturing operations"]], "sub_heading": [["Meanwhile, Bharat Forge in a filing to the BSE said, \"the company has decided to suspend operations at all their offices and manufacturing locations in India with effect from March 23, 2020 to March 31, 2020, to ensure employee safety and contain the spread of COVID-19. "]], "time": [["Last Updated: Mar 23, 2020, 12.40 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Auto component maker ", "Minda Industries", " and ", "Bharat Forge", " on Monday said they will suspend operations at their manufacturing locations as part of precautionary measures to prevent the spread of deadly coronavirus. In a regulatory filing, Minda Industries said \"in light of heightened concern on spread of COVID-19 in select districts in India, ", "government", " directives and certain OEMs (original equipment manufacturer) announcing production closure, it has been decided to suspend the manufacturing operations in Northern India, Rajasthan and Maharashtra till further notice\". \n", "\n", " Meanwhile, Bharat Forge in a filing to the BSE said, \"the company has decided to suspend operations at all their offices and manufacturing locations in India with effect from March 23, 2020 to March 31, 2020, to ensure employee safety and contain the spread of COVID-19. \n", "\n", " This action is also in line with the directions issued by the Government of Maharashtra on March 22, 2020, Bharat Forge noted. \n", "\n", " Minda Industries further said the duration of this shutdown will depend on government policy. \n", "\n", " It also noted that production has been significantly impacted at its overseas operations in ", "Spain", ", Mexico and ", "Association of Southeast Asian Nations", " (ASEAN). \n", "\n", " At global engineering and development centres in Europe, work from home has been implemented, Minda Industries said. \n", "\n", " \"Well-being and safety of our employees is of utmost priority. We are carefully monitoring the rapidly evolving COVID-19 pandemic and will continue to proactively respond based the evolving situation. We have implemented work from home for staff and provided employees with adequate support,\" Minda Industries added.\n"]], "tags": ["spain", "covid", "Government", "Association of Southeast Asian Nations", "ABI", "Bharat Forge", "Minda Industries"]},
{"heading": [["Kalyani Group contributes Rs 25 cr to PM-CARES to fight coronavirus pandemic"]], "sub_heading": [["The group is also looking at using its R&D facilities to meet requirements of critical medical equipment such as ventilators, respiratory equipment and other sanitation/hygiene goods.\n"]], "time": [["Last Updated: Mar 31, 2020, 03.09 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Auto", " components major ", "Bharat Forge", ", the flagship company of ", "Kalyani Group", ", and other group firms on Tuesday pledged Rs 25 crore contribution to the Prime Minister's Citizen ", "Assistance", " and Relief in Emergency Situations Fund (", "PM-CARES", ") to fight against the ", "coronavirus", " pandemic.\n", "\n", "The group is also looking at using its R&D facilities to meet requirements of critical medical equipment such as ventilators, respiratory equipment and other sanitation/hygiene goods.\n", "\n", "The other group companies involved in the donation are Kalyani Steel, Saarloha Advanced Material Pvt Ltd, Automotive Axles and Hikal Ltd, the group said in a statement.\n", "\n", "Bharat Forge Chairman Baba Kalyani said, \"The group is committed to assist the central and state government and the local authorities in all possible ways to deal with the pandemic.\"\n", "\n", "He further said, \"We are also using our group R&D facilities to look at ways of easing the shortage of critical medical equipments, including ventilators, respiratory equipment and other sanitation/hygiene equipment.\"\n", "\n", "Kalyani said as part of ", "CSR", " activity, the group has started addressing food requirements of local community and will increase the efforts in the coming days.\n"]], "tags": ["Auto", "CSR", "kalyani group", "Bharat Forge", "coronavirus", "assistance"]},
{"heading": [["Labour availability could prove a challenge in ramping up production: Sona Comstar Chairman Sunjay Kapur"]], "sub_heading": [["With domestic demand yet to kickstart, Sona Comstar is currently working to fulfil its export orders. Kapur informed, “In United States, farm equipment is an essential service and has remained open. We are catching up on those orders at this point in time. Domestic market has not kicked off yet because the supply chain is pretty complex.” "]], "time": [["Last Updated: May 21, 2020, 12.31 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Availability of labour on back of mass exodus of migrant labour from industrial belts may prove to be a challenge in ramping up operations, said ", "Sona Comstar Chairman Sunjay Kapur", ".\n", "\n", "Sona Comstar - which started operations earlier this month - said it has workers available locally which has enabled the company to re-start manufacturing facilities in Haryana and Chennai (Tamil Nadu).\n", "\n", "“Fortunately, we have a lot of people living locally and we started work with all of them. Then there is the migrant worker, who has probably gone back. Of course, we are tracking all our employees. But they are not available…Definitely, ramping up is going to be a challenge because it (availability of labour) is not just for us, it is the ", "entire supply chain", ". This is an issue that needs to be addressed”, said Kapur. The company hopes to streamline production in terms of getting personnel back at work over the next couple of months.\n", "\n", "With ", "domestic demand", " yet to kickstart, Sona Comstar is currently working to fulfil its ", "export orders", ". Kapur informed, “In United States, farm equipment is an essential service and has remained open. We are catching up on those orders at this point in time. Domestic market has not kicked off yet because the supply chain is pretty complex.” With the automotive industry losing out on a couple of months of production, Kapur, in fact, expects the domestic market to decline by as much as 20% in the ongoing financial year. The company though will go ahead with capex of Rs 180 crore it has planned for the ", "current fiscal year", ".\n", "\n", "Kapur said the industry has been urging the government to implement the much-awaited vehicle scrappage policy to generate demand. A reduction is ", "GST", " rates to 18% from the current 28% on automobiles would also spur sales. Kapur added it is also imporant that the government view automotive as an essential service. “We really need to see automotive as an essential service. In the event, we have future lockdowns, this start-stop model is very difficult to operate under (especially due to the complexities in the supply chain)”, he said.\n", "\n", "On the positive side, Sona’s plant in China though is running on full capacity where demand has bounced back post the lockdown. “Demand has definitely picked up in China. There are a lot of incentives for car buying. That’s definitely helped. Our plant is running at full capacity. It’s a good sign, which means that if the demand creation measures are right, people will go out and buy vehicles”, Kapur said.\n", "\n", "\n"]], "tags": ["entire supply chain", "export orders", "sona comstar chairman sunjay kapur", "Labour availability", "current fiscal year", "gst", "domestic demand"]},
{"heading": [["MG Motor India: Supplies resume from China but facing hurdles from Italy"]], "sub_heading": [["“Our supplies and production were impacted in February because of the outbreak of coronavirus in China. In March, the situation started improving…Now we are more concerned about Italy… (But) We are still optimistic, because of our bookings, we will be able to meet our annual target,” said MG Motor India president Rajeev Chaba."]], "time": [["Last Updated: Apr 01, 2020, 09.55 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: SAIC-owned ", "MG Motor India", " said supplies of components have resumed from ", "China", " but the company is facing disruption in sourcing parts from Europe due to the outbreak of coronavirus in the continent. The company, however, has not yet revised downwards production, sales and investment plans for calendar year 2020.\n", "\n", "“Our supplies and production were impacted in February because of the outbreak of coronavirus in China. In March, the situation started improving…Now we are more concerned about Italy… (But) We are still optimistic, because of our bookings, we will be able to meet our annual target. We do not see any change in plans immediately,” said MG Motor India president Rajeev Chaba.\n", "\n", "MG Motor India sources some auto parts and engines for diesel vehicles from ", "Italy", ".\n", "\n", "The company has pending orders for 16000 units of SUV Hector and 2000 units of MG ZS EV. The company has sold over 20,000 units of SUV Hector between July 2019 and February 2020.\n", "\n", "MG Motor India has plans to invest Rs 2500 crore over two years to attain annual sales target of 100,000 units by 2021. The resources will be utilised expand production capacity at its manufacturing unit in Halol, Gujarat. The company also plans to launch two new vehicles – a high-end sports utility vehicle Gloster in the festive season of this year and a midsize SUV in 2021.\n", "\n", "MG Motor India’s existing facility at Halol can produce 80,000 vehicles every year and fresh capacity would come in the from a second manufacturing unit. The company has plans to double sales volumes to 200,000 units by 2023.\n", "\n", "“Once we open, we can ramp up very quickly. We now have the material. But the pace at which operations can normalise will also depend on our suppliers in India and the labour situation…The issues are more pressing in India at present”, said Chaba.\n", "\n", "If the lockdown continues beyond April 14, 2020, however, the company would have to go back to the drawing board are re-examine plans, said Chaba.\n", "\n", "Chaba said the measures announced by Finance Minister Nirmala Sitharaman and the Reserve Bank of India are a \"good start,” but various tranches of support would have to come in from the government to alleviate the impact of the lockdown on the economy.\n", "\n"]], "tags": ["MG Motor India", "Coronavirus outbreak", "China", "Italy"]},
{"heading": [["Coronavirus impact: MRF, Maxxis India suspend production till April 14"]], "sub_heading": [["Similarly, Maxxis India said it has suspended manufacturing operations at its Sanand facility till April 14, 2020 in view of the lockdown to contain the pandemic."]], "time": [["Last Updated: Mar 25, 2020, 02.51 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Tyre makers ", "MRF", " and ", "Maxxis", " India on Wednesday announced temporary shutdown of their plants in wake of coronavirus ", "pandemic", ".\n", "\n", "\"In view of the nationwide ", "lockdown", " for a period of 21 days, the operations of our head office, sales offices and plants across India will remain shut until the lockdown is lifted,\" MRF Ltd said in a regulatory filing.\n", "\n", "The expected financial impact of this is not ascertainable at this stage, it added.\n", "\n", "Similarly, Maxxis India said it has suspended manufacturing operations at its Sanand facility till April 14, 2020 in view of the lockdown to contain the pandemic.\n", "\n", "\n"]], "tags": ["mrf", "Maxxis", "production", "lockdown", "coronavirus", "pandemic"]},
{"heading": [["Auto-parts demand from China at pre-coronavirus level: Motherson Group"]], "sub_heading": [[" The recovery in China from the Covid-19 outbreak has been strong and a similar trend should emerge in other parts of the world, helping markets bounce back over the next couple of months, leading automotive component supplier Motherson Group vice chairman Laksh Vaaman Sehgal told ET."]], "time": [["Last Updated: Apr 17, 2020, 08.10 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The recovery in ", "China", " from the Covid-19 outbreak has been strong and a similar trend should emerge in other parts of the world, helping markets bounce back over the next couple of months, leading automotive component supplier ", "Motherson Group", " vice chairman ", "Laksh Vaaman Sehgal", " told ET.\n", "\n", "“In a good indication for our industry, we have surprisingly seen demand come back really strong (in China). Customer demand is already back at the pre-Covid level and the market is strong,” said Sehgal.\n", "\n", "As manufacturing units gradually re-start their operations over the next few weeks across the world, production is expected to ramp up in the next one month. Pent-up demand is expected to help markets bounce back to the pre-Covid levels between June and August. Consumer preference for personal vehicles over public modes of transportation additionally is expected to boost sales in the automotive industry in the near future.\n", "\n", "“We are happy to see the recovery response in China and we believe that is something that should follow in the other parts of the world as well,” Sehgal said. \n", "\n", "“Customer (in China) is pulling strong and that is also further validated by the footfalls in (automobile) dealerships as we are seeing a big resurgence in people opting to go for personal transportation over public transportation because the concern over health is still there.”\n", "\n", "Motherson, which has manufacturing facilities in 41 countries across the world, said most of its plants will be up and running by the middle of next month. The company’s facilities have already resumed production in China and Korea. Those in Europe and India are expected to commence operations in the next couple of weeks. The group is incorporating learnings from its units in China, re-arranging assembly lines to ensure social distancing in other facilities globally to safely restart operations.\n", "\n", "Sehgal said the group is being financially prudent and wherever possible has renegotiated terms with suppliers without hurting either parties “significantly” financially. Motherson, however, is not undertaking extreme cost-cutting measures because the market is expected to normalise. \n", "\n"]], "tags": ["Laksh Vaaman Sehgal", "China", "Motherson Group", "covid effect", "imports india", "auto slowdown"]},
{"heading": [["Auto components industry in preparatory mode to resume operations: ACMA"]], "sub_heading": [["Under the new guidelines issued by the Ministry of Home Affairs (MHA) for the extended lockdown period up to May 3, the government, private industries and industrial establishments operating in rural areas, outside the limits of municipal corporations and municipalities, have been allowed to operate from April 20."]], "time": [["Last Updated: Apr 20, 2020, 03.50 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The ", "auto components", " industry is in preparatory mode and resumption of production will depend on whether the factories are in green zones or permissible areas or not, and if their customers resume operations, ", "ACMA", " said on Monday.\n", "\n", "Under the new guidelines issued by the ", "Ministry of Home Affairs", " (MHA) for the extended ", "lockdown", " period up to May 3, the government, private industries and industrial establishments operating in rural areas, outside the limits of municipal corporations and municipalities, have been allowed to operate from April 20.\n", "\n", "Moreover, manufacturing, industrial units with access control in ", "special economic zones", " (SEZs), export oriented units, industrial estates, industrial townships have also been allowed.\n", "\n", "\"The components industry is in preparatory mode, depending upon whether their factories are in green zones/ permissible areas and if their customer is resuming or not,\" Automotive Component Manufacturers Association of India (ACMA) ", "Director General Vinnie Mehta", " told PTI.\n", "\n", "He further said, \"Prior to resuming operations, manufacturing locations will have to undergo fumigation/sanitisation and all others checks will need to be put in place to ensure employees feel safe coming back to work.\"\n", "\n", "As per the guidelines by MHA, factories manufacturing drugs, pharmaceuticals, medical devices, medical infrastructure, including manufacture of ambulances, have also been allowed to open.\n", "\n"]], "tags": ["Special Economic Zones", "Director General Vinnie Mehta", "auto components", "lockdown", "coronavirus", "ACMA", "ministry of home affairs"]},
{"heading": [["Setco Automotive gets permission to re-start manufacturing operations at two plants"]], "sub_heading": [["Under the new guidelines issued by the Ministry of Home Affairs (MHA) for the extended lockdown period up to May 3, the government, private industries and industrial establishments operating in rural areas, outside the limits of municipal corporations and municipalities, have been allowed to operate from April 20. "]], "time": [["Last Updated: Apr 23, 2020, 01.18 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Auto component maker ", "Setco Automotive", " on Thursday said it has received permission to resume operations at its two plants located in ", "Gujarat", " and Uttarakhand. The company would like to inform that its plants situated at Kalol (Gujarat) and ", "Sitarganj", " (Uttarakhand), have been permitted to re-start manufacturing operations by the respective state governments, ", "Setco", " Automotive said in a regulatory filing. \n", "\n", " The plants have been permitted to operate subject to compliance with the conditions and directions as mentioned in the guidelines of respective state government as well as the order of ", "Ministry of Home Affairs", ", dated April 15, 2020, it added. \n", "\n", " Under the new guidelines issued by the Ministry of Home Affairs (MHA) for the extended lockdown period up to May 3, the government, private industries and industrial establishments operating in rural areas, outside the limits of municipal corporations and municipalities, have been allowed to operate from April 20. \n", "\n", " Moreover, manufacturing, industrial units with access control in special economic zones (SEZs), export oriented units, industrial estates, industrial townships have also been allowed.\n"]], "tags": ["Setco", "Gujarat", "Sitarganj", "ministry of home affairs", "Setco Automotive"]},
{"heading": [["Auto parts companies face late payments"]], "sub_heading": [["Car makers Renault and Nissan, top two-wheeler seller Hero MotoCorp, and the homegrown Eicher group have decided to go for ‘force majeure’ due to restrictions resulting from the 21-day corona-induced lockdown. "]], "time": [["Last Updated: Apr 08, 2020, 10.20 AM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: ", "Payments", " to over 200 component ", "suppliers", " in the auto industry will be partial and delayed as car makers Renault and Nissan, top two-wheeler seller ", "Hero MotoCorp", ", and the homegrown Eicher group have decided to go for ‘force majeure’ due to restrictions resulting from the 21-day corona-induced lockdown that has shut factories and retail sales outlets. Force majeure is a term used to describe unforeseeable circumstances that prevent someone from fulfilling a contract.\n", "\n", "The decision, sources say, may well mean delays in overall payments running between Rs 500 crore and Rs 1,000 crore. In letters to vendors, the companies have cited lack of business, while assuring that they have all the intentions of paying back as soon as the situation normalises.\n", "\n", " \n", "\n", "\n", "In a letter , the country’s top two-wheeler maker said, “Hero MotoCorp (HMCL) in the current situation has no visibility of receivables, have stock of BS4 & BS6 vehicles in the field, and dealership pan-India are now shut for 21 days. In this situation, we are left with no other option but to invoke force majeure and regret to inform that HMCL will not be in a position to meet all its obligations.” \n", "\n", "It added, “Hero MotoCorp made payment on March 22 as per the regular cycle but will not be able to keep up the unblemished track record of timely payment effective today.”\n", "\n", "A senior company official said while announcing emergency measures, the company has decided to fully protect the smaller suppliers. “We have made full payments to all our small vendors and MSMEs as per the due date on a top priority basis. We are releasing the payments to other supply chain partners in a phase-wise manner, we have already made 50% payments to them.”\n", "\n", "Renault Nissan Automotive India (RNAIPL)also said the situation affects the equipment purchasing contracts and orders already issued. “As you would have expected, RNAIPL is no longer in a position to fulfil its obligations under the contracts due to these force majeure events… RNAIPL shall not be responsible for its failure to perform any obligation required under the Master Purchase Agreement as a result of the pandemic, preventive steps, on our compliance with the relevant government orders, instructions and directives.”\n", "\n", "VE Commercial Vehicles, a JV between Eicher and Volvo, told its suppliers that the “unprecedented force majeure situation has created a profound impact on the receivables”, resulting in adverse cash flow situation. “I am therefore constrained to inform you that the payment cycles are disturbed, and you may kindly expect delays in payments,” Pradeep Mishra, senior VP (purchasing and supply Chain), said.\n", "\n", "Vinod Aggarwal, MD & CEO of VECV, however, said not too much should be read in the statement and rather “the company will go out of its way to bail out suppliers” who are in dire straits. “We are even ready to pay advance to the vendors if they have a problem. We will do whatever is required to make sure that suppliers meet their obligations, be it paying their salaries, or taking care of their fixed costs. We have to take care of them.”\n", "\n", "Deepak Jain, president of the ", "Automotive Component Manufacturers Association", ", said the grouping has taken up the matter with the companies. “We first wrote to auto industry body, ", "Siam", ". They assured us that they will write to all the manufacturers on an individual basis. We need to bear in mind that there are severe working-capital issues for suppliers, and requisite cash-flow is not there. We are in need of support at this time.”\n", "\n"]], "tags": ["Hero MotoCorp", "Automotive Component Manufacturers Association", "payments", "Vinod Aggarwal", "suppliers", "SIAM", "lockdown effect", "coronavirus"]},
{"heading": [["Auto parts manufacturers plan diversification of supply chain in the post-Covid-19 world"]], "sub_heading": [["Companies such as Tata Motors and Maruti are keen to increase local sourcing, while some others still see value in buying from China, given the cost competitiveness. To be sure, China isn’t firing on all cylinders now. With BS6 emission norms effective this April, the supply sources must diversify."]], "time": [["Last Updated: Apr 08, 2020, 12.53 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: Diversification is the chosen investment theme for the majority in any stock market. It is finding more takers in the auto-parts business now, with risk mitigation emerging as the cornerstone of the industry’s supply chain strategy in the post-Covid-19 landscape. And the prime beneficiary of that approach could be local sourcing.\n", "\n", "Companies such as Tata Motors and ", "Maruti", " are keen to increase local sourcing, while some others still see value in buying from China, given the cost competitiveness.\n", "\n", "To be sure, China isn’t firing on all cylinders now. With BS6 emission norms effective this April, the supply sources must diversify.\n", "\n", "While India would be still dependent on imports for battery, electronics or a rare-earth magnet for electric motors, other components such as castings, axles and wheel rings can be locally produced here, say ancillary makers.\n", "\n", "“Clearly, the ancillary industry does need handholding from OEMs, which is not going to be an easy task. If the components are made locally, they have to be tested, validated and it is a long drawn game,” said Vinnie Mehta, Director at ACMA (", "Automotive Component Manufacturers Association", ").\n", "\n", "“For certain parts, if the price difference is hardly 5-7%, it does not make it that cost competitive to import and companies will look to source locally,” said Hemant Sikka, the erstwhile head of sourcing, and currently president of the tractor division at Mahindra. OEMs may still have to go to China for certain parts like battery for electric vehicles or electronic parts as China has the scale, Sikka said.\n", "\n", "In FY19, parts worth $4.5 billion were imported from China, translating into a growth of 7%.\n", "\n", "\"It will be a fine balance to enhance localisation content in the short term. The local supply chain needs to be protected, so it will be a joint effort between the ancillary maker and OEMs,” said Deepak Jain, ", "CMD", " Lumax, and president of industry grouping ACMA.\n", "\n"]], "tags": ["maruti", "auto companies", "Automotive Component Manufacturers Association", "cmd", "auto component manufacturers"]},
{"heading": [["Sodium-ion battery maker Faradion mulling over manufacturing in India"]], "sub_heading": [["The company, which had won its first order from ICM Australia, is seeking to push its Sodium-ion batteries over Lithium-ion batteries citing \"exceptional superiority\" and play a significant part in revolutionising automobile/mobility, storage and mobile sectors across the world."]], "time": [["Last Updated: Apr 23, 2020, 01.24 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Sodium-ion battery", " maker ", "Faradion", " Ltd on Thursday said it is actively exploring having a manufacturing presence in India for its batteries for diversified applications.\n", "\n", "The company, which had won its first order from ", "ICM Australia", ", is seeking to push its Sodium-ion batteries over Lithium-ion batteries citing \"exceptional superiority\" and play a significant part in revolutionising automobile/mobility, storage and mobile sectors across the world.\n", "\n", "\"India is one of the largest markets for mobile devices across the world. Recently, the country has also demonstrated significant progress in the adoption of EV (Electric Vehicle) technology, making it a priority market for Faradion,\" the company said in a statement.\n", "\n", "Further, as the world seeks out alternatives to China-dependent Lithium-ion batteries, Faradion's Sodium-ion based technology offers a promising solution, it claimed.\n", "\n", "\"In line with this, Faradion is actively exploring manufacturing presence in India for its Sodium-ion batteries for diversified applications,\" the company said.\n", "\n", "Faradion CEO James Quinn said Australasia is the next logical region for the company given the market conditions.\n", "\n", "“Faradion is accelerating large scale industrialisation of its safe, low cost, Sodium-ion energy storage technology. After Australia, we foresee India as our next priority big market, given the huge growth in mobile devices and a bigger electric mobility market waiting to grow rapidly,\" he said.\n", "\n"]], "tags": ["battery maker", "car parts", "ICM Australia", "Faradion"]},
{"heading": [["Over 80 plants across globe resume operations: Motherson Sumi"]], "sub_heading": [["Around 30 per cent of the functional factories are now running at more than 80 per cent capacities, while rest of them are now running at up to 50 per cent of capacities and slowly picking up, it added."]], "time": [["Last Updated: Apr 29, 2020, 10.34 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Automotive components major Motherson Sumi said on Wednesday that more than half of its 152 plants around the world were now operational and ramping up ", "production", " volumes.\n", "\n", "While more than 80 of the ", "manufacturing", " plants were running, about 30% of them were running at ideal capacities of over 80%, the company said in a statement. However, the company did not specify the locations of these manufacturing facilities.\n", "\n", "Remaining plants too were being prepared to be ready as per post-Covid requirements and once the permissions were obtained, these plants too will start operating, the company said.\n", "\n", "The recovery in China from the pandemic was strong, Motherson Group vice-chairman Laksh Vaaman Sehgal told ET in a recent interview. “In a good indication for our industry, we have surprisingly seen demand come back really strong (in China). Customer demand is already back at the pre-Covid level and the market is strong,” he said.\n", "\n", "Last week, the company raised about Rs 500 crore by issuing non-convertible debentures (NCDs) which were listed on the BSE.\n", "\n"]], "tags": ["production", "manufacturing", "Auto sector", "Motherson Sumi Systems Ltd", "factories"]},
{"heading": [["Auto component suppliers may derail companies’ plan to restart output"]], "sub_heading": [["While some automakers have already placed product planning orders with suppliers, availability of parts could become a challenge. "]], "time": [["Last Updated: May 05, 2020, 07.17 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Automakers are likely to be hit by issues at component suppliers, threatening their schedules as they take initial steps to restart ", "production", ".\n", "\n", "While some automakers have already placed product planning orders with suppliers, availability of parts could become a challenge. The component segment comprises hundreds of companies, including many small and medium enterprises. Many of them are constrained by lack of manpower, because of continuing travel restrictions and missing migrant workers who have left for their hometowns in the wake of the lockdown.\n", "\n", "Auto companies that were planning to start with 20-30% production this month following easing of the lockdown, and their suppliers, are still waiting for clarity from several states on how they want to go ahead, as several of the top cities remain Covid-19 hotspots and aren’t expected to see easing of restrictions at least for several weeks.\n", "\n", "Parts makers ET spoke to said willingness of workers to join back and their transportation were some of the challenges they are facing.\n", "\n", "“The labour that has gone back to the villages are reluctant to join back work immediately, as their family members are showing resistance,” said Ashok Taneja, the managing director at Shriram Pistons.\n", "\n", "\n", "\n", "While some states may have started allowing industries to operate, there are restrictions on the use of buses and private vehicles, he said.\n", "\n", "Companies were hoping that they could get a minimum 50% production in May. \"We cannot stop-start the supply chain. That is very difficult and requires a lot of working capital. This financial year, the automotive sector has started with zero revenue,” said Lumax Industries managing director Deepak Jain, who is also the president of the Automotive Component Manufacturers Association (ACMA).\n", "Also, according to him, there was no point in restarting production and piling up inventory if dealerships weren’t allowed to operate and get the consumers back. “The industry needs some relaxation on taxes such as GST to generate demand,” Jain added.\n", "\n", "Minda group chairman Nirmal Minda said: “As we gear up to start production, we are preparing how much to produce as the customer requirements are very different. We will follow the just-in-time schedule to avoid inventory piling.”\n", "\n", "Another issue that is adding to the problem is the fact that the auto industry has been heavily dependent on China for parts.\n", "\n"]], "tags": ["production", "China imports", "Auto parts", "covid impact", "auto slowdown"]},
{"heading": [["Availability of components critical to restart manufacturing operations: Automakers"]], "sub_heading": [["Major carmakers like Maruti Suzuki, Hyundai, Toyota and Honda have not yet resumed production at their factories stating that availability of components is a prerequisite to re-start operations at factories, which continue to remain inaccessible due to the nationwide lockdown."]], "time": [["Last Updated: Apr 21, 2020, 11.01 AM IST"]], "publisher": [["PTI"]], "article": [["Major carmakers like ", "Maruti Suzuki", ", ", "Hyundai", ", Toyota and ", "Honda", " have not yet resumed production at their factories stating that availability of components is a prerequisite to re-start operations at factories, which continue to remain inaccessible due to the nationwide ", "lockdown", ". It has been nearly a month since automakers suspended operations across their plants as Covid-19 pandemic spread across the country. The factories of all major auto component makers as well as sales outlets also continue to remain closed.\n", "\n", "The country's largest carmaker Maruti Suzuki India (MSI) said it is looking closely at re-starting operations at its two plants in Haryana. \"The availability of components is one of the major requirements for restarting the factories and the company management is looking into it. I guess it will take few days to see how and when can we start operations,\" MSI Chairman ", "RC Bhargava", " told PTI. MSI's Manesar (Haryana) plant falls out of municipal corporation limit while Gurgaon plant is within the city limits. The two plants in Haryana have an installed capacity to roll out 15.5 lakh units per annum. Operations at the plants remain suspended since March 22.\n", "\n", "Under the new guidelines issued by the Ministry of Home Affairs (MHA) for the extended lockdown period up to May 3, the government, private industries and industrial establishments operating in rural areas, outside the limits of municipal corporations and municipalities, have been allowed to operate from April 20. Moreover, manufacturing, industrial units with access control in special economic zones (SEZs), export oriented units, industrial estates, industrial townships have also been allowed.\n", "\n"]], "tags": ["Maruti Suzuki", "Hyundai", "lockdown", "Honda", "RC Bhargava"]},
{"heading": [["Suzuki Motorcycle launches online sales, service platform"]], "sub_heading": [["Suzuki at your doorstep programme will be integrated within SMIPL's official website to enable customers to buy, test-ride and opt for after sales services at the click of a button, the company said in a statement. "]], "time": [["Last Updated: Jun 02, 2020, 03.37 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Suzuki Motorcycle India Pvt Ltd", " (SMIPL) on Tuesday launched its ", "online sales", " and ", "service platform", " through 'Suzuki at your doorstep' programme to meet customer demand during and post ", "COVID-19 lockdown", ". ", "Suzuki", " at your doorstep programme will be integrated within SMIPL's official website to enable customers to buy, test-ride and opt for after sales services at the click of a button, the company said in a statement. \n", "\n", "Through this programme customers can also book Suzuki two-wheeler product through a toll-free number along with an option of connecting the call to the nearest dealership, in case the customer wants to visit the dealership, it added. \n", "\n", "\"The online booking, doorstep delivery and service of Suzuki vehicles has been introduced keeping the safety and wellbeing of our customers and employees at the core of the initiative. \n", "\n", "\"With our online sales solution, we look forward to bring in positivity in two-wheeler segment and the overall industry post COVID-19,\" SMIPL Managing Director Koichiro Hirao said. \n", "\n", "SMIPL said its Suzuki at your doorstep programme will be expanded across over 112 Indian cities.\n"]], "tags": ["online sales", "Suzuki Motorcycle India Pvt Ltd", "suzuki", "service platform"]},
{"heading": [["Focus is on new processes and cut in bad costs: Apollo Tyres MD"]], "sub_heading": [["The world will have to adjust to the new normal of working from home and living with the novel coronavirus, Apollo Tyres managing director Neeraj Kanwar tells Nehal Chaliawala and Satish John."]], "time": [["Last Updated: May 11, 2020, 07.37 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["The world will have to adjust to the new normal of working from home and living with the novel coronavirus, ", "Apollo Tyres", " managing director ", "Neeraj Kanwar", " tells \n", "and \n", ". In preparation for an uncertain demand environment, the company is re-engineering ", "production", " and cutting down on all unnecessary costs or, as Kanwar puts it, \"bad costs\". Edited excerpts:\n", "\n", "\n", "\n", "Most of our plants are open now globally. As far as India is concerned, all our plants have been opened. Gradually we see sales have started going up, especially in the commercial vehicles segment because trucks are still ferrying essential goods back and forth. And in India also demand for agricultural tyres has started picking up. It's a very dynamic situation. \n", "\n", "\n", "\n", "Apollo sales comprise 80% of replacement demand and 20% demand from OEMs (original equipment manufacturers). Our current focus is to try and see how we can sell in the replacement market and gradually start picking up as and when the OEMs open. The demand from OEMs is going to be low. Plants in India in every industry will need to have flexibility in production according to the demand and supply.\\\n", "\n", "\n", "\n", "\n", "The main investor that has come in is Warburg Pincus. Warburg comes as a long-term strategic partner. Given their global experiences in the US, Europe and Asia, we saw it as a partnership which can bring a lot of strategic input into the organisation. We also picked up ₹500 crore by issuing NCDs (non-convertible debentures) and we have approval for ₹1,000 crore more and that's primarily to see that the company is liquid and the balance sheet is not stressed.\n", "\n", "\n", "This government has been talking about a scrappage policy for the past two years which has not come out yet. The second thing is to increase antidumping duties in India against all these Chinese products that are coming in. The automotive segment was down last year even before the virus came ... specifically needs a stimulus package.\n", "\n", "\n", "I cannot put a number to that, but given the situation, what we internally have started looking at is bringing down our cost. \n", "\n"]], "tags": ["lockdown india", "production", "Neeraj Kanwar", "Apollo Tyres", "covid impact", "auto slowdown"]},
{"heading": [["Bajaj Auto dealerships, service centres reopen in several parts of India"]], "sub_heading": [["The reopening began on May 4 with the dealerships taking permission from respective local authorities. ​​All the touch points are following mandated protocols to ensure the safety of customers and dealer staff, Bajaj Auto said in a statement. "]], "time": [["Last Updated: May 11, 2020, 03.50 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Bajaj Auto", " on Monday said it has commenced reopening of dealerships and service centres in various parts of the country following relaxation in guidelines by the government for the third phase of lockdown till May 17. The reopening began on May 4 with the dealerships taking permission from respective local authorities. \n", "\n", "All the touch points are following mandated protocols to ensure the safety of ", "customers", " and dealer staff, Bajaj ", "Auto", " said in a statement. \n", "\n", " Commenting on reopening of dealerships, ", "Bajaj Auto Ltd", " Executive Director Rakesh Sharma said, \"India is gearing up for the new normal post the COVID-19 pandemic and so are we at Bajaj Auto. The opening of workshops and dealerships is another step towards making a fresh start.\" \n", "\n", " To ensure safety, speed and efficiency with minimal contact, a new workflow process has been put in place for both sales and service, he added. \n", "\n", " All the facilities have been have been sanitised prior to restart of business. There are social distancing protocols in place at all customer facing touch points at dealerships, the company said. \n", "\n", " Mandatory thermal screening at the entrance and regular monitoring of employees' health is being done to ensure a completely safe environment at dealerships and service locations, it added. \n", "\n", " Sharma said Bajaj Auto had earlier announced extension of free services and warranty for customers. \n", "\n", " \"We have now also prioritised commencement of workshops to ensure that the vehicle service requirements of all our existing customers are met. Our engineers and workshops are now geared up to ensure that all service requests are met at the earliest to provide a hassle-free commute to our customers,\" he added.\n"]], "tags": ["Auto", "Bajaj Auto Ltd", "coronavirus", "Customers", "bajaj auto"]},
{"heading": [["Royal Enfield recalls 15,200 units of three models in overseas markets to replace a brake part"]], "sub_heading": [["The company is recalling Interceptor 650, Continental GT 650 and Himalayan motorcycles after discovering a brake caliper corrosion-related issue in some specific countries, Royal Enfield said in a statement. "]], "time": [["Last Updated: May 20, 2020, 04.10 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Niche bike maker ", "Royal Enfield", " on Wednesday said it is recalling 15,200 units of three models across the UK, Europe and Korea to replace a brake part. \n", "\n", " The company is recalling Interceptor 650, ", "Continental GT 650", " and ", "Himalayan motorcycles", " after discovering a brake caliper corrosion-related issue in some specific countries, Royal Enfield said in a statement. \n", "\n", " Upon investigation, it was revealed that this corrosion is brought about by sustained, long-term exposure to riding on roads treated with certain salts, or a combination of salts, to prevent formation of ice during winters, it added. \n", "\n", " This corrosion causes damage to the brake caliper piston bore and assemblies, and can result in unusual braking sound, increased brake drag, and may impact braking action, the company, which is part of ", "Eicher Motors", ", said. \n", "\n", " While this issue has been reported only in a small number of cases, the company has decided to undertake a proactive, safety-related service action, it added. \n", "\n", " \"This is a precautionary service intervention, and will be undertaken across the UK, the rest of Europe and Korea. With immediate effect, around 15,200 motorcycles sold in these markets will be called in for inspection, cleaning and part replacement, if required,\" Royal Enfield said. \n", "\n", " In a later phase of the service action, as a preventive measure, the caliper assemblies on these motorcycles will be replaced with the improved part, before the end of this year, it added. \n", "\n", " \"The safety of our riders is of prime importance to us at Royal Enfield and we are deeply committed to the duty of care to all our customers. We are committed to swiftly implement the service action, and customers will be contacted through respective local dealerships,\" the two wheeler maker said.\n"]], "tags": ["Royal Enfield", "Continental", "Continental GT 650", "Eicher Motors", "himalayan motorcycles"]},
{"heading": [["Suzuki Motorcycle resumes production at Gurugram plant"]], "sub_heading": [["The company commenced operations after receiving permission from concerned authorities, by adopting detailed safety guidelines and safety measures for its employees, SMIPL said in a statement. "]], "time": [["Last Updated: May 18, 2020, 01.45 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: ", "Suzuki Motorcycle India Pvt Ltd", " (SMIPL) on Monday said it has resumed production at its manufacturing facility at Kherki Dhaula, ", "Gurugram", ". The company commenced operations after receiving permission from concerned authorities, by adopting detailed safety guidelines and safety measures for its employees, SMIPL said in a statement. \n", "\n", "SMIPL Managing Director ", "Koichiro Hirao", " said, \"At the onset, SMIPL will resume operation with limited workforce and will gradually shift to full production cycle as per the government's directive\". \n", "\n", "He further said the company has implemented detailed operating guidelines with emphasis on social distancing to ensure maximum precautions are taken by all its employees. \n", "\n", "SMIPL had suspended its plant operations on March 23, 2020 under the government's directives to follow the nationwide ", "lockdown", " to avoid ", "COVID-19", " pandemic spread.\n"]], "tags": ["koichiro hirao", "gurugram", "lockdown", "Suzuki Motorcycle India Pvt Ltd", "India", "suzuki"]},
{"heading": [["Okinawa resumes production with 25 per cent workforce"]], "sub_heading": [["It has also issued an advisory to its dealership network, which too will be operating with 25 per cent staff, Okinawa said in a statement. All the products will be sanitised at the plant before being dispatched and the exercise will be repeated again when dealerships receive them, the company added. "]], "time": [["Last Updated: May 11, 2020, 01.08 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Electric two-wheeler maker ", "Okinawa", " on Monday said it has resumed operations at its plant in Bhiwadi (Rajasthan), and corporate office in ", "Gurugram", " (Haryana), with 25 per cent workforce. The company said it will maintain safety measures at its offices, manufacturing unit and dealership networks as it begins business activities. \n", "\n", " It has also issued an advisory to its dealership network, which too will be operating with 25 per cent staff, Okinawa said in a statement. \n", "\n", " All the products will be sanitised at the plant before being dispatched and the exercise will be repeated again when dealerships receive them, the company added. \n", "\n", " \"As the government has announced relaxation in economic activities, we have decided to resume business operations gradually, maintaining all the precautions,\" Okinawa Managing Director ", "Jeetender Sharma", " said. \n", "\n", " Hence, the company is ensuring the safety and sanitation of all the touchpoints, he added.\n"]], "tags": ["gurugram", "lockdown", "coronavirus", "Okinawa", "Jeetender Sharma"]},
{"heading": [["Financiers turn cautious on 3-wheeler buyers"]], "sub_heading": [["With more people avoiding regular public transport due to social distancing and falling income of autorickshaw drivers, the volume decline for the three-wheelers segment is one of the highest in the vehicle segment."]], "time": [["Last Updated: May 22, 2020, 10.19 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: The humble three-wheeler, used as a last-mile connectivity for ferrying masses, is likely to be hit the most after the lockdown lifts. The ", "social distancing mandate", " from the government has already hit the earnings per ride and financers are already turning cautious in tendering new loans for the three-wheeler segment owing to the falling income level of drivers.\n", "\n", "Under the self-employed segment, the drivers of ", "commercial vehicles", " who owned vehicles have witnessed a sizeable drop in income due to the lockdown. This category has opted for up to 70-80% of loan moratorium. A CEO of a leading ", "NBFC", " said that among the self-employed categories, drivers of commercial vehicle are among the largest customers who have opted for the moratorium. Conse-quently, the finance companies have turned risk-averse to disburse any new loans.\n", "\n", "With more people avoiding regular public transport due to social distancing and falling income of autorickshaw drivers, the volume decline for the three-wheelers segment is one of the highest in the vehicle segment.\n", "\n", "The domestic volumes of three-wheelers fell 9% to 6.36 lakh units in FY20, SI-AM data show. The volume pressure is likely to aggravate with financing com-panies lowering their risk by pruning exposure to self-employed categories. According to Hetal Gandhi, director at ", "Crisil Research", ", the three-wheeler segment is expected to post a decline of 20% amid lesser permits and steep price in-crease due to BSVI.\n", "\n", "Rakesh Sharma, ED, ", "Bajaj Auto", ", told ET that the recovery in demand for three-wheelers may be slower than motorcycles. However, the long-term prospects look bright. “When transportation comes to a standstill, the three-wheeler owner does not have the capacity to pay EMIs. So, how finance companies react to a three-wheeler buyer in the current environment will be very critical on reviving demand. Once things open up, a family comprising two or three members will certainly consider the smaller three-wheeler as a safer mode of transport,” Sharma said. \n", "\n", "The passenger carrier accounts for nearly 80% of the total domestic volume, and the balance is goods carriers. Bajaj Auto is the market leader in the domes-tic passenger carrier segment with a market share of 64%, while Piaggio is the largest player in the goods segment. The decline in volume in goods carriers was higher than passenger carriers in the last fiscal. Diego Graffi, MD & CEO, Piaggio Vehicles said, the three-wheeler demand should slowly start picking up and his company is discussing with financiers to provide better financing schemes to the customers and improve affordability.\n", "\n"]], "tags": ["NBFC", "Crisil Research", "social distancing mandate", "bajaj auto", "Commercial Vehicles"]},
{"heading": [["Hero Moto will defer investments, save cash"]], "sub_heading": [["Pawan Munjal, chairman and CEO of Hero Moto-Corp, said the company has gradually resumed production at its factories in India, Bangladesh and Colombia (in Latin America), though the output is limited to begin with. However, he said that while the company conserves cash, it will not be cutting jobs or salaries."]], "time": [["Last Updated: May 20, 2020, 10.57 AM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: The country’s top two-wheeler maker ", "Hero MotoCorp", " has decided to defer planned investments for capacity additions due to the coronavirus pandemic, and has sought an immediate tax relief from the government in terms of ", "GST rate cut", " and relaxations in electric vehicle launch mandates.\n", "\n", "Pawan Munjal, chairman and CEO of Hero Moto-Corp, said the company has gradually resumed production at its factories in India, Bangladesh and ", "Colombia", " (in Latin America), though the output is limited to begin with. However, he said that while the company conserves cash, it will not be cutting jobs or salaries.\n", "\n", "“The plants are not fully functional as yet, as we are working in single shift, with a smaller number of people. We are not operating all assembly lines, and are maintaining a safe distance. This naturally brings down our production and productivity,” Munjal said at the opening session of TOI Dialogues, a unique leadership summit (The topic for Tuesday’s TOI Dialogues was business continuity in the times of ", "Covid", ").\n", "\n", "Hero MotoCorp had said a few months ago that the company was looking to invest as much as Rs 10,000 crore towards model launches, new technologies, and capacity augmentation. Munjal said that some of these investments may now be deferred. “We are paying salaries, and taking care of our overheads in a shutdown when we are not making any revenues. The most important thing for the organisation now is to conserve cash. Cash is very precious, and so investments do take a back seat.”\n", "\n", "Munjal said that investments that were already in progress would be completed. “… we haven’t stopped that. But where we did not start, we definitely stopped… We will definitely defer expansion in Halol (Gujarat) plant and new investments in ", "Andhra Pradesh", " facility.”\n", "\n", "The company does not see the need to produce more when demand is expected to stay weak. “For this fiscal, the total sales will probably be lower than what we had expected previously. Thus, why would we go there and put in investments that will stand still and give no returns?”\n", "\n", "Apart from a cut in GST, Munjal said that the government should also look at reducing dividend tax. “People will then have the ability to give higher dividends and put more money in the hands of the consumers.”\n", "\n"]], "tags": ["Hero MotoCorp", "covid", "GST rate cut", "Andhra Pradesh", "lockdown", "Hero Moto", "Colombia"]},
{"heading": [["HMSI to resume manufacturing operations from next week in phased manner"]], "sub_heading": [["Production will resume in a phased manner starting May 25 from company's biggest plant in Narsapura in Karnataka, followed by other three plants from first week of June, Honda Motorcycle and Scooter India added."]], "time": [["Last Updated: May 21, 2020, 01.54 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Honda Motorcyle & Scooter India (HMSI) Thursday said it will resume production across its four ", "manufacturing", " facilities in the country in a phased manner starting May 25. \n", "\n", "“Production will resume in a phased manner starting 25th May 2020 from its biggest plant in Narsapura in Karnataka followed by other three plants from 1st week of June 2020”, the company said in a statement. \n", "\n", "To keep the business continuity in accordance with the guidelines issued by the government, nearly 99% of Honda’s 300+ supplier plants too have received the necessary approvals to resume their operations. Honda suppliers are now in advance stages of resuming production.\n", "\n", "On the market demand side, over 60% of Honda dealers have by now resumed their sales & service operations. Initial enquiries, though still subdued compared to the pre-lockdown period, are picking up momentum every day, the company said. Hence, strategically aligning supply chain with market demand and available BS-VI inventory across its network, Honda is set to resume production from its 4 factories in a staggered manner from 25th May 2020.\n", "\n", "\n"]], "tags": ["Honda Motorcycle and Scooter India", "Production plans", "lockdown", "manufacturing"]},
{"heading": [["BattRe Electric launches internet-connected scooter at Rs 64,990"]], "sub_heading": [["Mumbai, May 22 () Technology-driven startup BattRE Electric Mobility on Friday announced the launch of its internet-connected electric scooter 'ie,' priced at Rs 64,990 (ex-showroom)."]], "time": [["Last Updated: May 22, 2020, 10.52 PM IST"]], "publisher": [["PTI"]], "article": [["Mumbai: Technology-driven startup ", "BattRE Electric", " Mobility on Friday announced the launch of its internet-connected ", "electric scooter", " 'gps:ie,' priced at Rs 64,990 (ex-showroom). BattRE ", "gps:ie", " scooter, which is a SIM card based ", "smart vehicle", " and is accessible through a smart-phone app, will be available at more than 50 dealer locations across Tamil Nadu, Maharashtra, Andhra Pradesh, Karnataka, Telangana, Gujarat and Uttar Pradesh as well on online marketplace Amazon, the company said in a release. \n", "\n", " Besides, BattRE has also partnered with San Jose (California)-based tech company Aeris Communications, which has its country office in Delhi NCR, for the e-scooter, it said. \n", "\n", " \"The rollout of our new offering, an affordable internet connected electric scooter will change the way people commute. This is the next level of tech revolution to be seen in the EV sector. Our objective is to build an entire ecosystem thereby ensuring that the consumer enjoys a complete e-mobility experience, \" said Nishchal Chaudhary, Founder of BattRE Electric Mobility Ltd. \n", "\n", " The e-scooter has features such as remote immobilisation, geofencing, secure parking, etc. Setting a speed lock would push alerts whenever the speed limit is crossed, he said. \n", "\n", " The EV industry grew at 20 per cent in the previous fiscal and with the positive sentiment of Indian EV and is witnessing strong demand in spite of the coronavirus pandemic, the company said. \n", "\n", " \"This telematics platform will be a game-changer for ride-sharing companies as well. The riders and owners will get the live location of the vehicle through GPS as well as driving behaviour and trip reports,\" Chaudhary added. \n", "\n", " \"We are happy to be part of BattRE's journey right from its inception and helping them launch right-sized and feature-rich connected two-wheelers for both B2B and B2C market segments,\" said Sameer Mahapatra, Country Sales Head- India and SAARC, Aeris Communications.\n"]], "tags": ["smart vehicle", "battre electric", "electric scooter", "internet scooter", "gps:ie"]},
{"heading": [["Ather Energy partners with P2P scooter sharing platform"]], "sub_heading": [["Bengaluru-based start up Bounce already has 'ScooterHero' a P2P initiative, under which individuals can rent out their vehicles directly during the lockdown and the partnership with Ather enables new Ather 450 owners to monetise the idle time of the vehicle by listing their vehicle on the Bounce App, it said."]], "time": [["Last Updated: May 26, 2020, 04.18 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: Hero MotoCorp-backed ", "Ather Energy", " has partnered with dockless mobility solution provider ", "Bounce", " for a ", "scooter sharing initiative", " 'Peer to Peer' (", "P2P", ") with the pilot programme taking off from ", "Bengaluru", " on Monday, a release said on Tuesday.\n", "\n", "Under the partnership, the Ather 450 e-scooter purchased via Bounce's website can be booked for Rs 499 and will be delivered on priority basis post the lockdown once deliveries resume, the release said.\n", "\n", "Bengaluru-based start up Bounce already has '", "ScooterHero", "' a P2P initiative, under which individuals can rent out their vehicles directly during the lockdown and the partnership with Ather enables new Ather 450 owners to monetise the idle time of the vehicle by listing their vehicle on the Bounce App, it said.\n", "\n", "Ather Energy, the electric two-wheeler maker, at present has two scooter models -- Ather 450 and Ather 450X-- in its product portfolio.\n", "\n", "Consumers opting for this P2P models need to book the Ather 450 through the Bounce platform and on delivery the commercially registered vehicle will be listed on the Bounce app, the release said adding Bounce customers will now be able to rent the vehicle for hours or days, as listed by the owner while the consumers will be remunerated when their scooter is rented.\n", "\n", "Ather said it has introduced new post-purchase plans (Ather One), customised for the sharing model, including new service and maintenance plan which will address the wear and tear of multi-rider usage.\n", "\n"]], "tags": ["Ather Energy", "Bengaluru", "Hero MotoCorp", "bounce", "scooter sharing initiative", "scooterhero", "p2p"]},
{"heading": [["Pre-owned vehicles, 2-wheelers to benefit from hesitation to use public transportation: CRISIL"]], "sub_heading": [["Consumers would be averse to making a big-ticket purchase like a car. However, consumers might consider purchasing two-wheelers or used vehicles to serve their personal transportation needs, said Hetal Gandhi, director, Crisil Research."]], "time": [["Last Updated: May 28, 2020, 02.45 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: People will be hesitant to use public transportation in the wake of Covid-19 and will consider purchasing personal vehicles for their daily commute and the beneficiaries will be two-wheeler and used ", "car segments", " rather than new cars, said research and rating agency Crisil.\n", "\n", "Over 60% of urban salaried employees face the risk of job loss or salary cut, while over 34% face the risk of salary cut or moderation in growth, as per ", "Crisil research", ".\n", "\n", "Consumers would be averse to making a big-ticket purchase like a car. However, consumers might consider purchasing two-wheelers or used vehicles to serve their ", "personal transportation needs", ", said Hetal Gandhi, director, Crisil Research.\n", "\n", "Subsequently, the used vehicle market could grow by up to 10% this fiscal, according to Gandhi. During FY20, used car market grew by about 10% to 4.4 million units, substantially more than the new car market at about 2.8 million units.\n", "\n", "“Car buying is not an instinctive purchase in India,” Gandhi said. “People will prefer personal transportation, but income is the first and most sensitive driver.”\n", "\n", "Research showed, Gandhi says, that after a person gets able to afford a new car, typically they will still wait for three to four years more before making the purchase.\n", "\n", "The used vehicles market, meanwhile, will also see ample supply of inventory due to numerous owners of surrendering their cars purchased for deployment in the shared mobility space as they could not afford to repay their loans.\n", "\n", "\n"]], "tags": ["car segments", "personal transportation needs", "Job losses", "Crisil Research", "two wheelers"]},
{"heading": [["TVS Motor Company temporarily cuts salaries for executives till October 2020"]], "sub_heading": [["While there will be no salary cuts for workers, the company has temporarily reduced compensation of executives across levels by 5-20%. "]], "time": [["Last Updated: May 25, 2020, 11.43 PM IST"]], "publisher": [[", ET Bureau"]], "article": [[" Chennai-based ", "TVS Motor Company", " has reduced salaries across different levels for a period of six months till October 2020 amid plummeting sales in wake of the outbreak of the ", "coronavirus pandemic", ". \n", "\n", "While there will be no salary cuts for ", "workers", ", the company has temporarily reduced compensation of executives across levels by 5-20%. \n", "\n", "“In the wake of the unprecedent crisis, TVS Motor Company has rolled out a temporary salary reduction across different levels for a period of six months (May to Oct, 2020). There will be no salary reduction at the workmen level. However, there will be 5% salary reduction at the junior executive level and about 15% to 20% at the senior management level. It was heartening to see employees coming forward and offering to take salary reduction voluntarily”, said a company spokesperson.\n", "\n", "TVS Motor Company has reported a 62% decline in domestic sales at 94,103 units in March 2020. The company’s sales volumes were nil in April on account of the nationwide ", "lockdown", " imposed to check the spread of the pandemic. \n", "\n"]], "tags": ["salary cut", "coronavirus pandemic", "lockdown", "TVS Motor Company", "workers"]},
{"heading": [["Bajaj Auto, TVS chip away at China's share in African two-wheeler market"]], "sub_heading": [["Bajaj Auto and TVS are quickly capturing the two-wheeler market share in the African continent."]], "time": [["Last Updated: Jun 02, 2020, 05.28 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: Amid the border tensions between India and ", "China", " in Ladakh, a pitched battle is being waged between two Indian companies and their Chinese rivals in faraway Africa. In this battle for market share, the Indians have gained ground at the expense of the Chinese companies.\n", "\n", "India’s ", "Bajaj Auto", " and ", "TVS", " Motor are quickly capturing the two-wheeler market share in the African continent. Such has been the rise of the Indian brands that the number of Chinese companies present in the ", "African market", " has come down from more than 200 a decade back to less than 40 now. If the Chinese held as much as 95-100% of the market a decade ago, now they share it almost equally with the Indian manufacturers.\n", "\n", "Bajaj Auto is the No. 1 or 2 in more than a dozen African markets, with a cumulative market share of 40% of the 2.4-2.7 million two-wheelers sold there. It sold more than a million vehicles in Africa in the fiscal year ended in March 2020, recording a compounded annual growth rate of 30% in the last three years.\n", "\n", "“Bajaj has been able to compete and win in Africa based on its product strengths, local assembly operations … quality assurance, network of distribution partners, dealers and service centres,” executive director Rakesh Sharma said. “With a long-term focus, a huge effort has been put in training tens of thousands of mechanics and establishing customer engagement programmes, which is yielding results,” added Sharma.\n", "\n", "TVS didn’t provide specific numbers for Africa, but a spokesperson said the continent offered structural growth opportunities due to rising demand for last-mile connectivity in rural and semi-urban areas.\n", "\n", "Called Boda Boda, two-wheelers in Africa are largely used for commercial purpose — for transporting both people and goods. The Indian brands are well-placed to take advantage if demand for personal mobility increases in the wake of the Covid-19 ", "pandemic", ".\n", "\n", "Bajaj’s Boxer bike has become a ubiquitous brand in Africa and has helped the company grow share from 25% five years ago to 40% in 2019-20. The brand’s nearest competitor sells less than half of the Boxer volume. Bajaj Auto has over 10 assembly facility in Africa and it works with a dozen distributors.\n", "\n", " \n", "\n", "India’s exports of two-wheelers grew 13.4% annually in value between 2008 and 2019, compared with 6.4% for China’s companies, according to Kotak Institutional Equities. In fiscal 2019, two-wheeler exports earned India about $2 billion in foreign exchange, according to its report.\n", "\n", "TVS Motor Company on its part has been growing its presence consistently in Africa over the last few years. Two wheelers volumes have grown 35% CAGR and three wheelers volume grew by 47% CAGR between 2016 to 2020. Countries like Guinea, Kenya and Nigeria are growing at a much faster rate.\n", "\n", "KN Radhakrishnan, Director & CEO, TVS Motor Company told ET, Africa is a growing market primarily due to the large population, increasing affluence and the desire for personal mobility. The existing low penetration of two and three-wheelers when compared to the population offers a structural growth opportunity in the coming years. \n", "\n", "“TVS Motor has always endeavoured to create market focused products, a holistic network of sales, service and spares to provide end-to-end support to our customers,” added Radhakrishnan.\n", "\n", "Much like Bajaj, TVS too has focused its attention on setting up assembly plants and stitching together strong local partnerships.\n", "\n", "For African customers Indian products are aspirational in terms of positioning pricing and quality, Frost & Sullivan associate director Aswin Kumar said. The biggest factor for Indian companies is their strong partnership with local distributors which has enabled them to have a complete set-up unlike the Chinese.\n", "\n", "“Africans have used Chinese products, but the word of mouth from boda boda riders about robustness of Indian products coupled with very strong distributors on the ground with financial muscle is making them win more customers,” added Kumar.\n", "\n", "As many as 36 Chinese brands operate in Africa, but only a few have pan-African presence.\n", "\n", "Exports have helped Bajaj and TVS reduce the risk from the ", "Indian market", " where sales have fallen last year. For Bajaj, international markets accounted for 47% of the total volume in fiscal 2020. At TVS, the share of exports rose to 26.13% from 11.6% ten years earlier.\n", "\n", "\n"]], "tags": ["TVS", "China", "Two wheeler", "African market", "pandemic", "bajaj auto", "Indian market"]},
{"heading": [["Hero MotoCorp sells 106038 units in the local market in May"]], "sub_heading": [["The company sold 106,038 units in the domestic market last month, which is a decline of 82.5% compared to 606,216 units sold in the year ago period. Hero also exported 6644 units in the month under review. "]], "time": [["Last Updated: Jun 01, 2020, 05.53 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["The country’s largest two-wheeler maker ", "Hero MotoCorp", " dispatched a total 112,682 units of two-wheelers in the month of May 2020 after resuming operations post the COVID-19 induced lockdown. \n", "\n", "The company sold 106,038 units in the domestic market last month, which is a decline of 82.5% compared to 606,216 units sold in the year ago period. Hero also exported 6644 units in the month under review. \n", "\n", "The company has re-opened nearly 5000 customer touch-points with ", "strict safety measures", " in place. These outlets, which contribute 85% of the company’s domestic sales, retailed more than 160,000 units of motorcycles and scooters during the month of May, driven by demand in the semi-urban and rural markets, with ", "BS-VI", " vehicles witnessing positive customer response.\n", "\n", "Hero MotoCorp scaled-up production in a graded manner during the month, after reopening three of its manufacturing facilities on May 4. All six manufacturing facilities of the company in India – at Dharuhera and Gurugram in Haryana, Haridwar in Uttarakhand, Neemrana in Rajasthan, Halol in Gujarat and Chittoor in ", "Andhra Pradesh", " – have now resumed operations with limited production.\n", "\n", "The company’s manufacturing facilities at global locations – one each in Colombia and Bangladesh – restarted production during the month.\n", "\n", "Operations have also resumed at the Center of Innovation & Technology (CIT) in Jaipur, Rajasthan, in a graded manner and work on new product development has commenced, with strict safety and hygiene protocols.\n", "\n"]], "tags": ["wheeler maker hero motocorp", "the center of innovation & technology", "Hero MotoCorp", "Andhra Pradesh", "strict safety measures"]},
{"heading": [["Suzuki Motorcycle's 50 pc dealership reopened following relaxation in lockdown"]], "sub_heading": [["\"We have prepared extensive standard operating procedures for the dealerships which include frequent sanitisation and practising social distancing... In addition, for the convenience of our customers, SMIPL also plans to introduce various customer friendly initiatives allowing easy ownership and extending support to our dealer partners,\" SMIPL Managing Director Koichiro Hirao said. "]], "time": [["Last Updated: May 22, 2020, 03.52 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Suzuki Motorcycle India Pvt Ltd", " (", "SMIPL", ") on Friday said 50 per cent of its dealership has reopened following relaxation in lockdown by the government. The company, which resumed dispatch from Monday, said that currently, 5,000 new vehicles have been sold and 50,000 vehicles have been serviced at dealerships. \n", "\n", " SMIPL Managing Director ", "Koichiro Hirao", " said the company has resumed retail and dispatch services in almost all parts of the country except those in containment zones as per the government directives. \n", "\n", " \"We have prepared extensive standard operating procedures for the dealerships which include frequent sanitisation and practising ", "social distancing", "... In addition, for the convenience of our ", "customers", ", SMIPL also plans to introduce various customer friendly initiatives allowing easy ownership and extending support to our dealer partners,\" he added. \n", "\n", " SMIPL said it plans to re-open remaining dealer network, while adhering to social distancing norms, implementing safety measures and introducing newer process to limit human interaction.\n"]], "tags": ["koichiro hirao", "Suzuki Motorcycle India Pvt Ltd", "Customers", "SMIPL", "social distancing"]},
{"heading": [["Hero MotoCorp registers 83% decline in sales during May"]], "sub_heading": [["Total motorcycle sales stood at 1,06,038 units last month as against 6,06,216 units in May 2019, down 82.5 per cent. "]], "time": [["Last Updated: Jun 01, 2020, 06.43 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The country's largest two-wheeler maker ", "Hero MotoCorp", " on Monday reported a 82.71 per cent decline in total ", "sales", " at 1,12,682 units in May. The company had sold 6,52,028 units in the corresponding month of the previous year, Hero MotoCorp said in a statement. \n", "\n", "Total ", "motorcycle", " sales stood at 1,06,038 units last month as against 6,06,216 units in May 2019, down 82.5 per cent. \n", "\n", "Total ", "scooter", " sales declined 85.49 per cent to 6,644 units as compared with 45,812 units in the year-ago month, it added. \n", "\n", "In the domestic market, sales stood at 1,08,848 units last month as compared with 6,37,319 units in the same period a year ago, down 82.92 per cent. \n", "\n", "\"Ensuring stringent safety protocols for employee and customer wellbeing, Hero MotoCorp scaled-up production in a graded manner during the month, after reopening three of its manufacturing facilities on May 4,\" the company said. \n", "\n", "All six manufacturing facilities of the company in India - at Dharuhera and Gurugram in Haryana, Haridwar in Uttarakhand, Neemrana in Rajasthan, Halol in Gujarat and Chittoor in Andhra Pradesh - have now resumed operations with limited production, it added. \n", "\n", "The company's manufacturing facilities at global locations - one each in Colombia and Bangladesh - also restarted production during the month, Hero MotoCorp said. \n", "\n", "Operations have also resumed at the Jaipur-based Center of Innovation & Technology (CIT) in a graded manner and work on new product development has commenced, with strict safety and hygiene protocols, it added. \n", "\n", "Nearly 5,000 customer touch-points of the company which account for 85 per cent of sales have re-opened, the company said.\n"]], "tags": ["motorcycle", "Hero MotoCorp", "center of innovation & technology", "Scooter", "sales"]},
{"heading": [["M&M tractor posts 21% growth in domestic sales"]], "sub_heading": [["Tractor major Mahindra & Mahindra has posted a 21 per cent growth in domestic sales in February 2020 at 21,877 units, as against 18,105 units during the previous corresponding period. "]], "time": [["Last Updated: Mar 02, 2020, 02.00 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Tractor major Mahindra & Mahindra has posted a 21 per cent growth in ", "domestic sales", " in February 2020 at 21,877 units, as against 18,105 units during the previous corresponding period. \n", "\n", "Total tractor sales (Domestic + Exports) during February 2020 were at 22,561 units, as against 18,978 units for the same period last year, a growth of 19%. ", "Exports", " for the month stood at 684 units. \n", "\n", "Commenting on the performance, Rajesh Jejurikar, President - ", "Farm Equipment Sector", ", Mahindra & ", "Mahindra Ltd", ". said, “The tractor demand trend is expected to strengthen on the back of a robust Rabi output and the prevailing crop prices. Going forward, the increase in rural and agri spending on core schemes by the ", "Government", " should augur well for the industry. In the exports market, we have sold 684 tractors”.\n", "\n"]], "tags": ["Farm Equipment Sector", "Mahindra tractor sales", "Government", "Mahindra Ltd", "exports", "domestic sales"]}
]