[
{"heading": [["No let-up in global rainforest loss as coronavirus brings new danger"]], "sub_heading": [["Tropical rainforests disappeared at a rate of one football pitch every six seconds last year, researchers said on Tuesday, urging countries to include forest protection in post-pandemic plans. Loss of primary forest, which hit a record high in 2016 and 2017, was 2.8% higher in 2019 than the year before. Agricultural expansion, wildfires, logging, mining and population growth all contribute to the loss, researchers said."]], "time": [["Last Updated: Jun 02, 2020, 10.01 AM IST"]], "publisher": [["Reuters"]], "article": [["KUALA LUMPUR: Tropical rainforests disappeared at a rate of one football pitch every six seconds last year, researchers said on Tuesday, urging countries to include forest protection in post-pandemic plans.\n", "\n", "\n", "The loss in 2019 of 3.8 million hectares (9.3 million acres) of tropical primary forest - which means intact areas of old-growth trees - was the third biggest decline since the turn of the century, according to data from ", "Global Forest Watch", " (GFW).\n", "\n", "\n", "\"Primary forests are the areas we are the most concerned about - they have the biggest implications for carbon and biodiversity,\" said Mikaela Weisse, a project manager at the GFW forest monitoring service, run by the World Resources Institute.\n", "\n", "\"The fact that we are losing them so rapidly is really concerning,\" she told the Thomson Reuters Foundation.\n", "\n", "Loss of primary forest, which hit a record high in 2016 and 2017, was 2.8% higher in 2019 than the year before.\n", "\n", "Agricultural expansion, wildfires, logging, mining and population growth all contribute to deforestation, according to GFW researchers.\n", "\n", "Cutting down forests has major implications for global goals to curb climate change, as trees absorb about a third of the planet-warming greenhouse gas emissions produced worldwide.\n", "\n", "Forests also provide food and livelihoods for people who live in or near them, are an essential habitat for wildlife, and aid tropical rainfall.\n", "\n", "Governments preparing post-coronavirus economic stimulus plans should include measures to protect forests, said Weisse.\n", "\n", "In the short-term, the virus may weaken enforcement of forest laws, with people taking advantage of that to commit environmental crimes, she warned.\n", "\n", "In the medium-term, economic stress could hike pressure for more extractive industries in forests or larger-scale agriculture, she added.\n", "\n", "Workers coming home from cities after losing jobs could also turn to forests to help feed their families, increasing the risk of deforestation, she said.\n", "\n", "\"The situation has changed,\" Weisse said of the COVID-19 pandemic. \"What we need to do has also changed.\"\n", "\n", "WILDFIRES\n", "\n", "The top three countries for primary forest loss last year - Brazil, Democratic Republic of Congo (DRC) and Indonesia - have remained largely the same this century, GFW researchers said.\n", "\n", "Brazil accounted for more than a third of all primary forest loss in 2019 at 1.36 million hectares.\n", "\n", "Many of the Brazilian forest fires that made international headlines last year did not occur inside primary forest, but in already deforested areas as farmers cleared logged land for agriculture and cattle, according to the data.\n", "\n", "Neighbouring Bolivia, however, experienced record-breaking primary forest loss at 290,000 hectares, due to fires in both forests and surrounding woodlands, GFW said.\n", "\n", "And Australia experienced a 560% jump in tree cover loss from 2018, driven by unprecedented bushfires, making it easily the country's worst year on record.\n", "\n", "The DRC saw its losses fall slightly to 475,000 hectares, still the third-highest year on record for the African nation, the data showed.\n", "\n", "Malaysia lost 120,000 hectares of primary forest last year, ranking 6th behind Peru at 162,000 hectares, it added.\n", "\n", "The figure for Indonesia remained at historically low levels for the third year in a row at 324,000 hectares, a 5% reduction in losses from 2018, according to GFW.\n", "\n", "Tougher law enforcement to prevent forest fires and land clearing, and bans on forest-clearing and new oil-palm concessions all helped, said Arief Wijaya, forests and climate manager at think-tank World Resources Institute Indonesia.\n", "\n", "\"I would (now) like to see the government not only trying to reduce deforestation but reverse deforestation,\" Wijaya said.\n", "\n", "As the Southeast Asian nation battles the coronavirus pandemic, it is important that funds set aside for forest protection and restoration are not reallocated to help the wider economy and healthcare system, he added.\n", "\n", "In total, the tropics lost 11.9 million hectares of tree cover - which includes all natural forests and tree plantations - in 2019, according to the GFW data.\n", "\n", "\"There has been so much international effort to try and slow or stop tropical deforestation, and the fact that we're not seeing the numbers budge at a global level is something we are quite concerned about,\" said Weisse.\n", "\n"]], "tags": ["rainforest loss gfw", "rainforest loss report", "Global Forest Watch", "global forest watch rainforest", "rainforest loss"]},
{"heading": [["Air pollution may harm brain, cause memory decline in elderly: Study"]], "sub_heading": [[]], "time": [["Last Updated: Nov 21, 2019, 05.07 PM IST"]], "publisher": [["PTI"]], "article": [["LOS ANGELES: Exposure to higher levels of fine air pollutants may cause decline in memory, and lead to Alzheimer's-like brain damage, according to a study carried out in elderly women.\n", "\n", "Researchers from the University of Southern California (USC) in the US noted that fine particles, also called PM2.5 particles, are about 1/30th the width of a human hair.\n", "\n", "These particles come from traffic exhaust, smoke and dust and their tiny size allows them to remain airborne for long periods, get inside buildings, be inhaled easily, and reach and accumulate in the brain.\n", "\n", "For an increase of 2.81 microgrammes per ", "cubic metre", " of PM2.5, the annual memory decline rate was accelerated by 19.3 per cent, the researchers found.\n", "\n", "Fine particle pollution is associated with ", "asthma", ", ", "cardiovascular disease", ", lung disease and premature death, they said.\n", "\n", "The study, published in the journal Brain, touches on the renewed interest in preventing Alzheimer's disease by reducing risk, and also hints at a potential disease mechanism.\n", "\n", "\"This is the first study to really show, in a ", "statistical model", ", that air pollution was associated with changes in people's brains and that those changes were then connected with declines in memory performance,\" said Andrew Petkus, assistant professor at USC.\n", "\n", "\"Our hope is that by better understanding the underlying brain changes caused by air pollution, researchers will be able to develop interventions to help people with -- or at risk -- for cognitive decline,\" Petkus said in a statement.\n", "\n", "Previous research has suggested that fine particle pollution exposure increases the risk for Alzheimer's disease and related dementias.\n", "\n", "What scientists haven't known is whether PM2.5 alters brain structure and accelerates memory decline.\n", "\n", "They used data from 998 women, aged 73 to 87, who had up to two brain scans five years apart.\n", "\n", "Those brain scans were scored on the basis of their similarity to Alzheimer's disease patterns by a ", "machine learning", " tool that had been \"trained\" via brain scans of people with Alzheimer's disease.\n", "\n", "The researchers also gathered information about where the 998 women lived, as well as environmental data from those locations to estimate their exposure to fine particle pollution.\n", "\n", "When all that information was combined, researchers could see the association between higher pollution exposure, brain changes and memory problems -- even after adjusting to take into account differences in income, education, race, geographic region, cigarette smoking and other factors.\n", "\n", "\"This study provides another piece of the Alzheimer's disease puzzle by identifying some of the brain changes linking air pollution and memory decline. Each research study gets us one step closer to solving the Alzheimer's disease epidemic,\" Petkus said.\n", "\n", "\n"]], "tags": ["cardiovascular disease", "Cubic metre", "asthma", "statistical model", "machine learning"]},
{"heading": [["Air pollution linked to increased risk of depression, suicide: Study"]], "sub_heading": [[]], "time": [["Last Updated: Dec 19, 2019, 08.46 PM IST"]], "publisher": [["PTI"]], "article": [["LONDON: People exposed to high levels of air \n", " are more likely to experience depression or commit suicide, according to a study that reviewed data from 16 countries.\n", "\n", "\n", "Published in the journal ", "Environmental Health Perspectives", ", this is the first systematic review of evidence connecting air \n", " and a range of mental health problems.\n", "\n", "Researchers from the University College London (UCL) in the UK found that, if the relationship with depression reported in some of these studies is causal, then reducing global average exposure to fine particulate matter (PM2.5) from 44 microgrammes per cubic metre (µg/m3) to 25 µg/m3 could result in a 15 per cent reduction in depression risk worldwide.\n", "\n", "The World Health Organization (WHO) guidelines recommend that fine particulate matter \n", " -- small airborne particles that can include dust and soot -- should be kept under 10 µg/m3, the researchers said.\n", "\n", "\"We already know that air \n", " is bad for people's health, with numerous physical health risks ranging from heart and lung disease to stroke and a higher risk of ", "dementia", ",\" said the study's lead author, Isobel Braithwaite from UCL.\n", "\n", "\"Here, we're showing that air \n", " could be causing substantial harm to our mental health as well, making the case for cleaning up the air we breathe even more urgent,\" said Braithwaite.\n", "\n", "The researchers analysed studies that had investigated the association between particulate matter \n", " and five different adverse mental health outcomes in adults.\n", "\n", "They identified 25 studies that fitted their criteria, nine of which were included in the primary analyses.\n", "\n", "The team found that a 10 µg/m3 increase in the average level of PM2.5 people were exposed to over long periods was associated with an approximately 10 per cent increase in their odds of depression.\n", "\n", "\"We found quite consistent results across the studies we reviewed that analysed the relationship between long-term air \n", " exposure and depression, even after adjustment for many other factors which could explain the association,\" Braithwaite said.\n", "\n", "Global city", " PM2.5 levels range from 114 and 97 in Delhi and Dhaka (Bangladesh), to 6 in Ottawa (Canada) and ", "Wellington", " (New Zealand), the researchers said.\n", "\n", "The researchers also found evidence of a connection between short-term changes in coarse particulate air \n", " (PM10) exposure and the number of suicides, from pooling the results of four different studies.\n", "\n", "The risk of suicide appears to be measurably higher on days when PM10 levels have been high over a three-day period than after less polluted periods, the researchers said.\n", "\n", "The studies into short-term changes in suicide risk accounted for confounding factors such as weather changes, and day of the week.\n", "\n", "The relationship is not affected by other neighbourhood or socioeconomic factors given that the comparisons being made are among the same individuals on days with different \n", " levels.\n", "\n", "The researchers said the evidence was particularly strong for the suicide risk link, but the effect was smaller than for depression -- an increase in suicide risk of 2 per cent for each 10 µg/m3 increase in the average coarse particulate \n", " level over a three-day period.\n", "\n", "They cannot yet confirm whether air \n", " directly causes mental ill health, but said there is evidence to suggest possible causal mechanisms.\n", "\n", "\"We know that the finest ", "particulates", " from dirty air can reach the brain via both the bloodstream and the nose, and air \n", " has been implicated in increased neuroinflammation, damage to nerve cells and to changes in stress hormone production, which have been linked to poor mental health,\" Braithwaite said.\n", "\n", "\"Our findings correspond with other studies that have come out this year, with further evidence in young people and in other mental health conditions,\" said the study's senior author, Joseph Hayes from UCL.\n", "\n", "\"While we cannot yet say that this relationship is causal, the evidence is highly suggestive that air \n", " itself increases the risk of adverse mental health outcomes,\" Hayes said.\n", "\n", "\n"]], "tags": ["global city", "WELLINGTON", "Joseph Hayes (author)", "Particulates", "Environmental Health Perspectives", "dementia"]},
{"heading": [["India should take urgent action to tackle air pollution: WHO"]], "sub_heading": [[]], "time": [["Last Updated: Dec 18, 2019, 04.08 PM IST"]], "publisher": [["PTI"]], "article": [["MADRID: India should take “urgent action” to tackle air pollution as the levels of toxic air in many cities of the country are much higher than the recommended guidelines, which could have a major impact on people's health, WHO director Maria Neira said.\n", "\n", "\n", "Several studies conducted by the World Health Organization (WHO), Centre for Science and Environment and others published in journals such as The Lancet have linked pollution with premature deaths in India.\n", "\n", "Union environment minister Prakash Javadekar recently told Parliament that there was no Indian study to show any correlation between pollution and shortening of lifespan.\n", "\n", "\"The studies conducted in India have not shown a direct correlation of shortening of life because of pollution. Let us not create a fear psychosis among people,\" the minister told the House.\n", "\n", "When asked to comment on the minister's speech in the Lok Sabha, Neira told PTI \"a very strong scientific evidence is telling us that exposure to air pollution is having a major impact on people's health.\"\n", "\n", "\"Independently of which methodology is used or what are the estimates, it is urgent to take action because the levels of air pollution in certain cities in India are very high, and this is definitely having impact on people's health,\" notec Neira, Director, Public Health, Environment and Social Determinants of Health Department (PHE), WHO.\n", "\n", "\"Therefore, we urge governments to take measures to reduce pollution, to reduce the massive damage this pollution is causing to health of their citizens, particularly in those cities where the levels of air pollution are far beyond those guidelines recommended by the WHO,\" she said.\n", "\n", "A study published last year in The Lancet journal found that one out of every eight deaths in India in 2017 could be attributed to air pollution.\n", "\n", "This study showed that India has a higher proportion of global health loss due to air pollution than its proportion of the global population.\n", "\n", "Around 12.4 lakh deaths in India in 2017 can be attributed to air pollution, it said, terming toxic air a leading risk factor for deaths in the country.\n", "\n", "The study also noted that the average life expectancy would have been 1.7 years higher if the pollution levels were less than the minimal level responsible for causing health loss.\n", "\n", "WHO air quality guidelines estimate that reducing annual average fine particulate matter (PM2.5) concentrations from levels of 35 microgrammes per cubic metre (µg/m3) to 10 µg/m3, could reduce air pollution-related deaths by around 15 per cent.\n", "\n", "Neira urged the Indian Government to take urgent action to reduce the pollution levels, saying doing so will result in major health benefits.\n", "\n", "“We are confident that based on the fact that this pollution can be reduced, Indian government, which has an enormous amount of expertise and competence will be doing their best to tackle the sources of pollution, to reduce the toxic levels that the citizens are exposed to at the moment, and start to monitor how the health situation of their citizens will be improved,” she said.\n", "\n", "She said the evidence, interventions, and the plan of action to tackle air pollution is available.\n", "\n", "\"It is just the question of deciding to implement it as soon as possible because the more we delay those measures; the more we will have problems,” Neira added.\n", "\n"]], "tags": ["india pollution who warning", "india pollution measures", "India pollution", "india pollution javadekar", "india pollution who"]},
{"heading": [["India Inc coaxing employees to carpool, use ride-share apps"]], "sub_heading": [["A recent report by Dutch location and navigation services provider TomTom had found Bengaluru to be the most traffic-congested city in the world, followed by Mumbai, Pune and New Delhi that also finished in the top 10. Sharing commutes not only saves cost and fuel, but also reduces the stress of daily travel."]], "time": [["Last Updated: Feb 18, 2020, 09.15 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA / BENGALURU: Many top ", "corporates", " in the country are now proactively encouraging employees to carpool, ", "bikepool", ", and use ride-share apps to commute to work to help ease persistent traffic gridlocks across Indian cities every working day and reduce ", "air pollution", ".\n", "\n", "Companies with large workforces such as ", "Infosys", ", ", "Capgemini", ", ", "Cognizant", ", HCL, ", "Amazon", ", ", "Flipkart", ", Siemens, L&T, Biocon and HDFC Bank and several smaller companies are running awareness campaigns, setting up digital platforms to help employees plan commutes better, and even rewarding top carpoolers to keep employees engaged and motivated to reduce carbon emissions and traffic jams across cities.\n", "\n", "A recent report by Dutch location and navigation services provider TomTom had found Bengaluru to be the most traffic-congested city in the world. Three other Indian cities in the TomTom Traffic Index 2019, that ranked 416 cities across the world based on congestion – Mumbai, Pune and New Delhi – too, finished in the top 10.\n", "\n", "Sharing commutes not only saves cost and fuel, but also reduces the stress of daily travel, point out service providers in this segment whose business is booming.\n", "\n", "Car and bike pooling platform Quick Ride said almost 25 new companies sign up every week and 300,000 new users join the platform monthly; commute automation platform MoveInSync said it is growing 50% month-on-month; and, social ", "carpooling", " app sRide said it has 550 companies on its platform across 10 cities, a nearly four-fold jump from two years ago.\n", "\n", "\n", " \n", " \n", "“Some of the companies spend up to $3-4 million per year on employee transportation,” said Lakshna Jha, CEO of sRide. “By introducing carpooling, there is an alternative mode of transportation which helps to reduce cost. It also helps to form a stronger community among employees.” sRide recently onboarded WNS, Huawei and Snapdeal.\n", "\n", "Quick Ride cofounder KNM Rao said the carpooling app has 3.5 million registered users and a million active users every month. “Almost 90% of the usage is for corporate carpooling,” he said. Its recently added clients include Harman, Maersk, Verizon and L&T.\n", "\n", "MoveInSync cofounder Deepesh Agarwal said Adobe, Flipkart, Swiggy, DailyHunt and Udaan are among companies that have signed up for GetToWork, a shared cab service for tech parks across Bengaluru and some key commercial areas that the company rolled out three months ago. \n", "\n", "\n", "\n", "Consulting major Capgemini India has an umbrella campaign called #CAReToShare to encourage employees to carpool through promotional activities such as Carpool Carnivals, rewards for top carpoolers, and preferred parking programmes.\n", "\n", "Vijay Chandramohan, senior director-India corporate real estate services at Capgemini, said the number of its carpooling employees has shot up by 202% since the first quarter of 2017 to 82,427 in December 2019. The initiative helped the company reduce carbon emissions by 65% between January and December last year. “And we have saved over 1,537,719 trees and carpooled 3,346,0476 kilometres,” Chandramohan said.\n", "\n", "Richard Lobo, human resources head at Infosys, said the information technology services major is focusing on reducing carbon emissions across its operations worldwide and its entire system is designed around the concept of shared commutes: shared bus facilities, shared cabs, carpooling options. It offers parking benefits to ridesharing drivers. With more than 73,500 users taking more than 1.6 million rides, it converts to Rs 7.83 crore saved in fuel, Lobo said.\n", "\n", "To encourage its employees to carpool, Cognizant has set up kiosks and stalls, launched a brand ambassador programme, and offers incentives such as dedicated parking spaces for carpoolers and awards for top carpoolers, said Bijay Mukherjee, head of corporate workplace services for India at Cognizant. Many senior leaders of the company are also frequent carpoolers.\n", "\n", "\"Since 2018, our employees have collectively travelled more than 51 million kilometers, saved over 3 million liters of fuel, and helped reduce more than 11 million kilotons of carbon emissions (CO2), as a result of carpooling, \" added Mukherjee.\n", "\n", "Ecommerce marketplace Flipkart encourages its employees to carpool and use rideshare apps while technology solutions major Siemens India’s HR head Shilpa Kabra Maheshwari said the company runs buses for its employees and has also introduced the carpool system in some specific routes that connect to public transportation stations.\n", "\n"]], "tags": ["Carpooling", "Air Pollution", "corporates", "Amazon", "Cognizant", "bikepool", "Flipkart", "Infosys", "CapGemini"]},
{"heading": [["CPCB threatens to shut down 14 coal-fired power plants which failed to limit emissions"]], "sub_heading": [[]], "time": [["Last Updated: Feb 05, 2020, 10.39 PM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: Acting tough on non-compliant thermal power plants, the ", "Central Pollution Control", " Board (CPCB) has issued show cause notices to 14 coal-based power plants in six states asking them to respond why these plants should not be closed down and environmental compensation be imposed for their failure to reduce emissions.\n", "\n", "\n", "Four such plants are located in Haryana while three are in Punjab, two each in Uttar Pradesh, Telangana and Andhra Pradesh, and one in Tamil Nadu. Total installed capacity of these 14 thermal power plants is approximately 15,000 MW. Nine such polluting plants are located roughly within 300 km radius of Delhi.\n", "\n", "These plants will have to respond to the show cause notices by February 15. “Adequate action will be taken against them under the ", "Environment", " (Protection) Act, 1986 if they fail to provide valid reasons,” said an official.\n", "\n", "Action against them include outright closing down of the plants till they install Electrostatic Precipitators (ESP) to limit PM emission and Flue Gas Desulphurization (FGD) to meet new emission limits for SO2, and imposing environmental compensation (penalties). These plants have missed their respective deadlines to install/retrofit required equipment to limit emissions.\n", "\n", "The show-cause notices were sent to these plants by CPCB chairman, S P S Parihar, on January 31 —just a day ahead of the 2020-21 budget presentation where the finance minister ", "Nirmala Sitharaman", " on February 1 proposed to close down highly polluting old thermal power plants.\n", "\n", "“Strict action against these power plants for non-compliance will set a good precedent for other plants which have a deadline to reduce SO2 emissions (or emission of other pollutants) for this year and next three years. Other plants may expedite their actions fearing similar strict penalties and shut downs for inaction,” said Sunil Dahiya, analyst at Centre for Research on Energy and Clean Air (CREA).\n", "\n", "The CPCB in its periodic review in December last year found that some of these plants failed to meet their sulphur dioxide (SO2) emission standards while others failed to reduce emissions of both SO2 and particulate matter (PM).\n", "\n", "The thermal power stations/plants (TPS/P) in Haryana which received the CPCB’s notice on January 31 include Indira Gandhi TPS, Jhajjar; Deen Bandhu Chhotu Ram TPS, Yamunanagar; Panipat TPS, Panipat and Rajiv Gandhi Thermal Power Project in Hisar. Tamil Nadu’s lone such non-compliant plant is in Chennai (North Chennai TPS-II).\n", "\n", "Power plants in Punjab include Rajpura TPP, Patiala; Talwandi Sabo Power plant, Mansa and ", "Guru Hargobind Singh TPS", ", Bhatinda. In UP, National Capital TPS of NTPC at Dadri and Harduaganj TPS, Aligarh were sent notices. Such plants in Telangana include Kothagudem TPS, Khammam and Singareni TPP, Adilabad whereas the Andhra Pradesh plants include Damodaram Sanjeevaiah TPP, Nellore and ", "Vizag Hinduja", " TPP, Visakhapatnam.\n", "\n", "The environment ministry had in December 2015 notified new emission limits for SO2, oxides of nitrogen (NOx) and mercury for coal/lignite-based thermal power plants, expecting that the reduction in these emissions will help in improvement of ambient air quality.\n", "\n", "Initially, the deadline to meet the new emission standards through installations of required equipment was fixed as December 7, 2017. But later, it was extended to December 31, 2019 for SO2 and December, 2022 for NOx when the power plants flagged “technical challenges” in implementing the order by the initial deadline. Considering the impact of coal-fired power plants on ambient air quality in Delhi-NCR, the deadline for thermal power plants located within 300 km radius of Delhi was kept as of December 31, 2019. \n", "\n", "\n"]], "tags": ["vizag hinduja", "central pollution control", "ENVIRONMENT", "Environment Protection Act, 1986", "Nirmala Sitharaman", "guru hargobind singh tps"]},
{"heading": [["Air pollution linked with higher Covid-19 death rate: Study"]], "sub_heading": [["It revealed that regions with permanently high levels of pollution have significantly more deaths than other regions, according to the researchers at Martin Luther University Halle-Wittenberg (MLU) in Germany."]], "time": [["Last Updated: Apr 20, 2020, 03.51 PM IST"]], "publisher": [["PTI"]], "article": [["BERLIN: Higher levels of ", "nitrogen dioxide", " pollutants in the air may be associated with an increased number of deaths from ", "COVID-19", ", according to a study.\n", "\n", "The research, published in the journal Science of the Total Environment, combined satellite data on ", "air pollution", " and air currents with confirmed deaths related to COVID-19.\n", "\n", "It revealed that regions with permanently high levels of pollution have significantly more deaths than other regions, according to the researchers at Martin Luther University Halle-Wittenberg (MLU) in Germany.\n", "\n", "Nitrogen dioxide is an air pollutant that damages the human respiratory tract, the researchers said.\n", "\n", "For many years it has been known to cause many types of respiratory and cardiovascular diseases in humans, they said.\n", "\n", "\"Since the novel coronavirus also affects the respiratory tract, it is reasonable to assume that there might be a correlation between air pollution and the number of deaths from COVID-19,\" said Yaron Ogen from MLU.\n", "\n", "The researchers combined three sets of data, including the levels of regional nitrogen dioxide pollution measured by the ", "European Space Agency", "'s (ESA) Sentinel 5P satellite, which continuously monitors air pollution on the Earth.\n", "\n", "Based on this data, he produced a global overview for regions with high and prolonged amounts of nitrogen dioxide pollution.\n", "\n", "\"I looked at the values for January and February of this year, before the corona outbreaks in Europe began,\" explained Ogen.\n", "\n", "He combined this data with data from the US weather agency NOAA on vertical air flows. He explained that if air is in motion, the pollutants near the ground are also more disseminated.\n", "\n", "However, if the air tends to stay near the ground, this will also apply to the pollutants in the air, which are then more likely be inhaled by humans in greater amounts and thus lead to health problems, Ogen said.\n", "\n", "Using this data, the researcher was able to identify hotspots around the world with high levels of air pollution and simultaneously low levels of air movement.\n", "\n", "He then compared these with the data on deaths related to COVID-19, specifically analysing the data from Italy, France, Spain and Germany.\n", "\n", "He found that the regions with a high number of deaths also had particularly high levels of nitrogen dioxide and a particularly low amount of vertical air exchange.\n", "\n", "\"When we look at Northern Italy, the area around Madrid, and ", "Hubei", " Provence in China, for example, they all have something in common: they are surrounded by mountains. This makes it even more likely that the air in these regions is stable and pollution levels are higher,\" Ogen said.\n", "\n", "The advantage of the analysis, he noted, is that it is based on individual regions and does not only compare countries.\n", "\n", "\"Even though we can obtain a country's average value for air pollution, this figure could vary greatly from region to region and therefore not be a reliable indicator,\" said Ogen.\n", "\n", "The geoscientist suspects that this persistent air pollution in the affected regions could have led to overall poorer health in the people living there, making them particularly susceptible to the virus.\n", "\n", "\"However, my research on the topic is only an initial indication that there might be a correlation between the level of air pollution, air movement and the severity of the course of the corona outbreaks,\" said Ogen.\n", "\n"]], "tags": ["Nitrogen dioxide", "European Space Agency", "Hubei", "Air Pollution"]},
{"heading": [["Mumbai gets lion’s share of govt’s pollution fund"]], "sub_heading": [["Mumbai is set to get the highest grant of Rs 488 crore from the Centre’s Rs 4,400 crore fund which is earmarked exclusively for cities with more than one million population in states to improve air quality during 2020-21. Delhi may miss this assistance despite figuring among the most polluted cities in the country as the fund would only be meant for ‘million plus’ population cities in states."]], "time": [["Last Updated: Mar 12, 2020, 11.17 AM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: As the government works on a mechanism to assist big cities in battling air pollution, Mumbai is set to get the highest grant of Rs 488 crore from the Centre’s Rs 4,400 crore fund which is earmarked exclusively for cities with more than one million population in states to improve air quality during 2020-21.\n", "\n", "\n", "Delhi may miss this assistance despite figuring among the most polluted cities in the country as the fund would only be meant for ‘million plus’ population cities in states.\n", "\n", "The national capital, will, however continue to get support from the ", "National Clean Air Programme", " (pollution control scheme) of the environment ministry and other schemes of the agriculture ministry to deal with stubble-burning.\n", "\n", "Under the pollution control scheme, the environment ministry has, however, been allocated just Rs 460 crore for 122 ‘non-attainment’ cities across the country. Non-attainment cities are those which do not meet the national ambient air quality standards.\n", "\n", "At Rs 488 crore, share of Mumbai local body will be higher than the total money (Rs 460 crore) earmarked for the entire ", "NCAP", " of the environment ministry. Besides NCAP, the Centre has in its budget for 2020-21 allocated Rs 4,400 crore to the urban development ministry for taking up clean air measures in ‘million plus’ cities.\n", "\n", "The break-up of financial assistance for these cities is recommended by the 15th Finance Commission. Forty-two of 50 such cities in states will get assistance from the fund. Remaining eight cities are kept out of its ambit as air quality is not a major issue there.\n", " \n", " \n", " \n", "\n", "Noting the critical issue of air pollution in Delhi-NCR, the Commission recommended the Centre to constitute a committee, consisting of ministries of finance, environment and agriculture, state governments of Haryana, Punjab and Uttar Pradesh, to “devise, implement and monitor a time-bound action plan for pollution mitigation”.\n", "\n", "After Mumbai, the second highest amount from the urban development ministry’s fund will be allocated to Kolkata (Rs 385 crore), followed by Bengaluru (Rs 279 crore), Hyderabad (Rs 234 crore) and Patna (Rs 204 crore).\n", "\n", "Half of the earmarked assistance will, however, be given to these cities based on their performance in year-on-year improvement in air quality. “The environment ministry will soon publish benchmarks for this purpose,” said an official, adding the performance related grant will be based on improvement in average annual concentrations of both PM 10 and PM2.5 (equal weightage of 50%) as calculated in January 2021.\n", "\n", "The environment ministry had launched NCAP in January last year and set a mid-term (five-year) target to reduce air pollution by 20-30% by 2024, taking 2017 as base year.\n", "\n", "The first instalment to the cities from Rs 4,400 crore fund will be used for taking multiple air quality improvement measures, including capacity- building of local bodies. \n", "\n", "\n"]], "tags": ["India air pollution", "Mumbai pollution", "India air quality", "Ncap", "national clean air programme"]},
{"heading": [["Blue skies, reduced emissions only temporary, won't benefit environment in long run: Experts"]], "sub_heading": [["Environmentalists feel that carbon emissions may have reduced drastically but are likely to go back to the pre-corona levels in a few weeks' time, once the virus threat mitigates. "]], "time": [["Last Updated: Apr 09, 2020, 01.14 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Weeks of ", "lockdown", " in the country to fight ", "coronavirus", " may have reduced greenhouse gas ", "emissions", " enabling people to breathe cleaner air and feast on blue skies, but it is only a temporary phase and will not benefit the environment in the long run, experts have said.\n", "\n", "Recently, the Central ", "Pollution Control", " Board (CPCB) released a report on effect of 'Janata Curfew' on the air quality in which it found that the reduction in number of on-road vehicles, resulted in up to 51 per cent reduction in nitrogen oxide (NOx) levels and 32 per cent reduction in carbon dioxide (CO2) levels during March 22-23, 2020 as compared to March 21. \n", "\n", "Environmentalists feel that carbon emissions may have reduced drastically but are likely to go back to the pre-corona levels in a few weeks' time, once the virus threat mitigates. \n", "\n", "\"We are seeing the reduction of emissions which is a major contributor to climate change. This is happening because of the drastic drop in burning of fossil fuel with reduction in industrial activities and general traffic. Hence, people today are able to see blue skies and natural habitat in relatively cleaner air.\n", "\n", "\"However, this is temporary and it is not going to benefit the environment in the long run. From the current crisis, people all over the world are suffering and facing severe hardship, while the percentage of people who can afford to work from the safety of home is not huge,\" said Avinash Chanchal, Senior Climate and ", "Energy", " Campaigner, ", "Greenpeace India", ".\n", "\n", "Sharing a similar opinion, Suyash Gupta, Director General, ", "Indian Auto LPG Coalition", ", said many cities are breathing clean air after a long time but this shutdown cannot be expected to result in stabilization of carbon dioxide concentration.\n", "\n", "\"A collateral impact of the lockdown has been the improved air quality of some of the most polluted Indian cities with people being able to breathe clean air after a long time. However, this was not purported and is expected to be the only brief. Emissions are likely to be back to pre-corona levels in a few month's time, once the virus threat mitigates. \n", "\n", "\"Researchers have already stated that we must not expect the impact of this global shutdown to result in any stabilization in CO2 concentrations in the atmosphere. However, this phase has certainly raised awareness about the need for people to adopt more eco-friendly lifestyles including the usage of clean transport fuels once human activity resumes,\" Gupta said.\n", "\n", "Sharing his opinion, V Vinoj, Assistant Professor at ", "IIT Bhubaneshwar", ", also said carbon emissions are expected to drastically reduce during this lockdown but within a few days it will go back to what it used to be.\n", "\n", "\"Some preliminary studies around the world are already showing reduction in pollutant concentrations mainly as a consequence of negligible activities in the transportation sector during this time,\" Vinoj said.\n", "\n", "He added that there has already been a reduction in NOx, and PM pollutants, even over Indo Gangetic Plains.\n", "\n", "\"However, I am not expecting these reductions to be homogenous especially due to the varying nature of source over the Indian region. Though many cities are showing reduced pollution levels, it will be interesting whether these are also observed in Eastern Indian and coastal cities,\" he said, adding that it will go back to pre coronavirus days within a week.\n", "\n", "Another environmentalist Aarti Khosla, Director, Climate Trends, said this crisis should be used as an opportunity to reduce dependence on other countries.\n", "\n", "\"Right now as the economy is stopped in its track, decline in emissions is natural. But as the Prime Minister says, the crisis should be used as an opportunity to reduce dependence on other countries. One way to do this is a faster transition to electric mobility. It would ensure clean air, it would also ensure less dependence on oil imports,\" Khosla said.\n", "\n", "She added that the need of the hour remains ramping up healthcare and supporting the most vulnerable section of the society that have lost their livelihood. \n", "\n", "Raising concern about the outbreak of coronavirus, Prime Minister ", "Narendra Modi", " on March 22 imposed a Janata Curfew and on March 24 he imposed a 21-day lockdown in the country keeping only the essential services functional.\n", "\n", "Talking about tackling the crisis, Avinash Chanchal of Greenpeace India said COVID-19 outbreak should be taken as a lesson to mankind.\n", "\n", "\"We always believe in a just and a planned transition towards a sustainable society, tackling one crisis can't be done at the expense of another. We should not forget that we are living in a time of climate crisis. Due to rising emissions, we have seen the hottest summers, drought and other extreme weather events, air pollution continues to cost the lives of millions of people every year. \n", "\n", "\"Like COVID-19, climate crisis affects society's most vulnerable and marginalized people and to address the climate crisis we need to focus on systemic and behavioural changes. We can only use the COVID-19 outbreak as a lesson to mankind and once we pass the crisis, the government will need to focus on a coordinated and consistent action plan to tackle the climate crisis,\" Chanchal said.\n", "\n"]], "tags": ["pollution control", "greenpeace india", "central pollution control", "Narendra Modi", "IIT Bhubaneshwar", "lockdown", "coronavirus", "emissions", "Indian auto LPG coalition", "energy"]},
{"heading": [["China's smog-prone Hebei saw pollution fall 15% from Oct-March"]], "sub_heading": [["China's smog-prone northern province of Hebei met its air quality targets by a big margin over the winter after concerted efforts to tackle emissions, a local official said on Sunday, without mentioning coronavirus-related factory shutdowns."]], "time": [["Last Updated: Apr 26, 2020, 09.33 AM IST"]], "publisher": [["Reuters"]], "article": [["SHANGHAI: China's smog-prone northern province of Hebei met its air quality targets by a big margin over the winter after concerted efforts to tackle emissions, a local official said on Sunday, without mentioning coronavirus-related factory shutdowns.\n", "\n", "Average PM2.5 concentrations over the October-March period dropped 15% from a year earlier to 61 micrograms per cubic metre, while sulphur dioxide also fell by a third, said He Litao, vice-head of the provincial environmental bureau.\n", "\n", "Most experts have attributed the significant decline in air pollution throughout China in the first quarter to the ", "coronavirus", " outbreak and tough containment measures, which saw cities and entire provinces locked down and sharply reduced traffic and industrial activity throughout the country.\n", "\n", "With millions staying at home, concentrations of lung-damaging PM2.5 particles fell by nearly 15% in more than 300 Chinese cities in the first three months of 2020.\n", "\n", "Shanghai saw emissions fall by nearly 20% in the first quarter, while in Wuhan, where the pandemic originated, monthly averages dropped more than a third compared to last year.\n", "\n", "However, He of the Hebei environmental bureau attributed the local decline in pollution to the \"conscientious implementation\" of government decisions even in the face of unfavourable weather conditions.\n", "\n", "According to a winter action plan published last year, 10 cities in Hebei were expected to cut lung-damaging small particles known as PM2.5 by 1%-6% compared to the previous year.\n", "\n", "Despite the decline, average PM2.5 was still much higher than China's official standard of 35 micrograms, and the recommended World Health Organization level of 10 micrograms.\n", "\n", "\n"]], "tags": ["Hillary Clinton", "coronavirus", "The Wall Street Journal", "Donald Trump", "Vladimir Putin"]},
{"heading": [["NGT directs thermal power plants to take prompt steps for scientific disposal of fly ash"]], "sub_heading": [[]], "time": [["Last Updated: Feb 12, 2020, 09.48 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The National Green Tribunal on Wednesday asked thermal power plants to take prompt steps for scientific disposal of fly ash, warning that the failure to do so would entail a penalty.\n", "\n", "\n", "A bench of NGT Chairperson Justice ", "Adarsh Kumar Goel", " and Justice S P Wangdi said difficulties pointed out by the plants are of no relevance as the same are to be resolved by the administration and not by the victims of pollution whose rights are being affected.\n", "\n", "\"Environment cannot be violated against statutory norms. Violation of statutory notifications needs to be visited sternly in terms of enforcing the same, recovering compensation and prosecuting the violators. Whatever be the individual circumstances, it cannot be a ground to disobey law and to commit criminal offence under the Water Act, Air Act and EP Act,\" the bench said.\n", "\n", "The bench said there is no discretion available with this tribunal to dispense with the mandate of law and statutory provisions are binding on every thermal power plant without any exception.\n", "\n", "\"The thermal power plants may take prompt steps for scientific disposal of fly ash in ", "accordance", " with the statutory notification issued by the ", "Ministry of Environment", " and Forest under the provisions of Environment Protection Act requiring 100 per cent utilisation and disposal of fly ash,\" the bench said.\n", "\n", "The tribunal said the non-compliant plants will have to pay environmental compensation which would be determined from the cut-off date of December 31, 2017 as stipulated in the notification issued by the ", "Union Environment Ministry", ".\n", "\n", "\"", "Central Pollution Control", " Board may accordingly compute and levy environmental compensation in accordance with its formula with respect to individual plants in accordance with law and submit compliance report to the tribunal,\" the bench said.\n", "\n", "The tribunal also directed a committee comprising Central Pollution Control Board (CPCB) and IIT, Roorkee to assess the environmental damage with regard to the breach sites at ", "Vidhyanchal", " plant and Essar plant in Singrauli area and submit its recommendation within three months.\n", "\n", "\"CPCB shall be at liberty to engage any other technical expert for this purpose. The committee comprising of Collector, CPCB and Member Secretary of MP State Pollution Control Board may assess the damage with regard to the breach sites at Vidhyanchal and Essar in Singrauli area to the crop and agricultural productivity and ensure effective restoration/remedy of affected sites within three months,\" the bench said.\n", "\n", "It also said its order is subject to proceedings pending before the Supreme Court and where stay is operative, this order will not operate till stay continues.\n", "\n", "The NGT then posted matter for next hearing on July 8.\n", "\n", "The NGT was hearing pleas filed by ", "Shantanu Sharma", ", Anupam Raghav, Sandplast (India) Ltd and others seeking utilisation of the fly ash as per 1999, 2003 and 2009 notifications issued by the Environment Ministry.\n", "\n", "As per the notifications, fly ash can be used in \"construction activity such as in road laying, embankments or used as land fill to reclaim low lying areas including backfilling in abandoned mines or pitheads or for any such other use as permitted strictly in accordance with the provisions of notifications.\"\n", "\n"]], "tags": ["central pollution control", "Shantanu Sharma", "ministry of environment", "accordance", "Union environment ministry", "Vidhyanchal", "Adarsh Kumar Goel"]},
{"heading": [["Air pollution drops by 40-50% in big Indian cities like Delhi, Mumbai after lockdown: EU sat data"]], "sub_heading": [[]], "time": [["Last Updated: Apr 27, 2020, 06.18 AM IST"]], "publisher": [[", TNN"]], "article": [["The 32-day national lockdown has started showing its positive effect on air quality across the country as big cities like Delhi and ", "Mumbai", " see pollution levels drop by around 40-50%, according to data received from a European satellite system.\n", "\n", "New satellite maps, produced using data from the Copernicus Sentinel-5P satellite, show averaged nitrogen dioxide ", "concentrations", " over India from January 1 to March 24 and March 25 (the first day of the lockdown) to April 20 and compared them to the same time-frame as last year. “The significant reduction in the NO2 concentrations can be seen over major cities across India. Mumbai and Delhi saw drops of around 40-50% compared to the same time last year,” according to the ", "European Space Agency", " (ESA).\n", "\n", "Claus Zehner, ESA’s Copernicus Sentinel-5P mission manager, says, “Thanks to the Tropomi instrument on the Sentinel-5P satellite, we are able to observe such high reductions in concentrations in Europe, China and now India because of the national quarantine measures put in place. The significant reduction in the concentrations can be seen over major cities across India.”\n", "\n", "“What is interesting in these new maps are the high values of NO2 concentrations over northeast India. Our analysis shows that these clusters are directly linked with the locations of the ongoing coal-based power plants. The largest power station in India, the Vindhyachal Super Thermal Power Station, shows a reduction of only around 15% compared to the same time last year.”\n", "\n", "ESA’s director of earth observation programmes, Josef Aschbacher, says, “Another interesting feature we can see from these images is the maritime traffic across the Indian Ocean. We can clearly see a faint trail of NO2 emissions left in the atmosphere as commercial ship traffic appears almost the same as last year. The shipping lanes appear as a straight line because the ships follow more or less the exact same route.”\n", "\n", "Nitrogen dioxide is usually emitted into the atmosphere as a result from power plants, industrial facilities and vehicles – increasing the likelihood of developing respiratory problems. According to the World Health Organization (WHO), air pollution kills an estimated 70 lakh people worldwide each year. According to data from World Air Quality Report from IQAir, Indian cities make up six of the world’s 10 most-polluted urban areas. Air pollution in Delhi, considered the world’s most polluted city, is caused by fumes from vehicular traffic, the burning of fossil fuels and industrial activity.\n", "\n"]], "tags": ["mumbai", "copernicus sentinel", "concentrations", "sentinelp", "satellite television", "European Space Agency", "claus zehner"]},
{"heading": [["Four Indian airports receive international recognition for reducing emissions"]], "sub_heading": [[]], "time": [["Last Updated: Jan 09, 2020, 05.01 PM IST"]], "publisher": [["ANI"]], "article": [["NEW DELHI: The ", "Airports Authority of India", " (AAI) announced that four airports in the country have managed a transition from level 1 to level 2 with a reduction in the ", "carbon emissions", " by grading their systems as per the ", "Airports Council International", " (ACI).\n", "\n", "\n", "The airports had adopted the grading system in 2018 and successfully implemented the carbon emission plan.\n", "\n", "\"Four AAI airports - Netaji Subhas Chandra Bose International Airport, Kolkata; Biju Patnaik International Airport, Bhubaneswar; Lal Bahadur Shastri International Airport, Varanasi and Trivandrum International Airport have met all the necessary requirements to upgrade to level 2: 'reduction', by constituting Carbon Management Plan and reducing the carbon emissions at airports as per the Airport Carbon Accreditation (ACA) Program,\" said AAI in a press statement on Wednesday.\n", "\n", "As per the data provided for the CO2 emission of four years - 2015,16,17,18; these airports witnessed a decrease in emission despite an increase in air traffic.\n", "\n", "The grading system of ACI has four categories - mapping, reduction, optimization and neutrality.\n", "\n", "\"Carbon mapping occurs when the airport has a policy commitment to emissions reduction and development of a Carbon Footprint for the airport's scope-1 and scope-2 emissions, which are under its control. Carbon reduction occurs when the airport shows the reduction in carbon emissions as compared to the base year,\" added AAI.\n", "\n"]], "tags": ["Indian airports", "Airports Authority of India", "Airports Council International", "reducing emissions", "carbon emissions"]},
{"heading": [["Kaziranga loses another rhino, horn chopped off"]], "sub_heading": [["An adult rhino was killed by a group of suspected militants at Kaziranga National park on Sunday evening.The pachyderm's horn was chopped off before forest staff reached the spot."]], "time": [["Last Updated: Feb 25, 2014, 09.51 AM IST"]], "publisher": [["TNN"]], "article": [["JORHAT: An adult ", "rhino", " was killed by a group of suspected militants at ", "Kaziranga National park", " on Sunday evening. The ", "pachyderm", "'s horn was chopped off before forest staff reached the spot.", " ", " The incident took place near the Gorakati anti-poaching camp in the ", "Burapahar forest range", " bordering ", "Karbi Anglong", " district at 7.30 pm on Sunday. A group of militants, equipped with AK series rifles, took shelter in the Karbi hills and shot the rhino dead for its horn.", " ", " \"A strong group of militants were involved in killing the rhino. They used AK-47 rifles and fired at least 30 rounds during the attack. Our staff found empty cartridges from the spot,\" said park director M K Yadav. He added that on hearing gunshots, forest staff rushed to the spot and opened fire in retaliation, but in vain.", " ", " This was the seventh rhino killed in ", "Kaziranga", " so far this year.", " ", " On January 25, a female rhino was shot dead and its horn was chopped off by poachers in Kaziranga. Park authorities said the government had taken up some new strategies to check poaching and work on a few such projects were underway.", " ", " The government is planning to set up at least eight towers for round-the-clock surveillance at the park.", " "]], "tags": ["Kaziranga", "rhino", "Kaziranga National Park", "Karbi Anglong", "pachyderm", "Burapahar forest range"]},
{"heading": [["Less air pollution means thousands fewer die"]], "sub_heading": [["Measures to halt the spread of coronavirus have slowed the region's economies to a crawl, with coal-generated power falling by nearly 40 percent, and oil consumption by a third."]], "time": [["Last Updated: Apr 30, 2020, 08.40 AM IST"]], "publisher": [["AFP"]], "article": [["PARIS: European countries under ", "coronavirus", " lockdown have seen 11,000 fewer deaths in April compared to the same period last year due to a sharp drop in fossil fuel ", "pollution", ", according to research released Friday.\n", "\n", "\n", "Measures to halt the spread of coronavirus have slowed the region's economies to a crawl, with coal-generated power falling by nearly 40 percent, and oil consumption by a third.\n", "\n", "Globally, oil use has declined by about the same amount, with drops in coal consumption varying by region.\n", "\n", "An unintended boon of shuttered factories and empty roads has been more breathable air.\n", "\n", "Levels of ", "nitrogen dioxide", " (NO2) and small particle pollution known as PM2.5 -- both toxic by-products burning coal, oil and gas -- fell 37 and 10 percent, respectively, according to the findings.\n", "\n", "\"The impacts are the same or bigger in many other parts of the world,\" lead author Lauri Myllyvirta, senior analyst at the Centre for Research on Energy and Clean Air (CREA), told AFP.\n", "\n", "In China, for example, NO2 and PM2.5 levels declined by a 25 and 40 percent during the most stringent period of lockdown, with an even sharper fall in Hubei Province, where the global pandemic began.\n", "\n", "\"So we are looking at an even larger number of avoided deaths,\" Myllyvirta said.\n", "\n", "Air pollution shortens lives worldwide by nearly three years on average, and causes 8.8 million premature deaths annually, according to a study last month.\n", "\n", "The ", "World Health Organization", " (WHO) calculates 4.2 million deaths, but has underestimated the impact on cardiovascular disease, recent research has shown.\n", "\n", "Worst-hit is Asia, where average lifespan is cut 4.1 years in China, 3.9 years in India, and 3.8 years in Pakistan.\n", "\n", "In Europe, life expectancy is shortened by eight months.\n", "\n", "\"Our analysis highlights tremendous benefits for public health and quality of life that could be achieved by rapidly reducing fossil fuels in a sustained and sustainable way,\" Myllyvirta said.\n", "\n", "The happenstance evidence that less air pollution saves lives should guide governments deciding on how to reboot their economies, noted Maria Neira, the WHO's director for Environmental and Social Determinants of Health.\n", "\n", "\"When we eventually take off our face masks, we want to keep breathing clean air,\" she said, commenting on the findings.\n", "\n", "\"If we truly care about the health of our communities, countries and global commons, we must find ways of powering the planet with out relying on fossil fuels.\"\n", "\n", "Compared to other causes of premature death, air pollution worldwide kills 19 times more people each year than malaria, nine times more than HIV/AIDS, and three times more than alcohol.\n", "\n", "Another study comparing more than 3,000 US counties, meanwhile, found that PM 2.5 pollution is directly linked with higher COVID-19 death rates.\n", "\n", "One extra micron per cubic metre corresponded to a 15 percent jump in COVID-19 mortality, researchers at the Harvard University T.H. Chan School of Public Health reported earlier this month.\n", "\n", "The results \"suggest that long-term exposure to air pollution increases vulnerability to experiencing the most severe Covid-19 outcomes,\" they wrote.\n", "\n", "PM 2.5 particles penetrate deep into the lungs and enter the bloodstream, causing cardiovascular respiratory problems.\n", "\n", "In 2013, the WHO classified it as a cancer-causing agent.\n", "\n", "In India's Uttar Pradesh -- home to 200 million -- small particle pollution by itself slashes life expectancy by 8.5 years, while in China's ", "Hebei Province", " (population 74 million) the shortfall is nearly six years, according to the Air Quality Life Index, developed by researchers at the Energy Policy Institute of Chicago.\n", "\n", "All but two percent of China's cities exceeded WHO guidelines for PM2.5 levels, while 53 percent exceeded less stringent national safety limits.\n", "\n", "The UN says PM2.5 density should not top 25 microgrammes per cubic metre (25 mcg/m3) of air in any 24-hour period. China has set the bar at 35 mcg/m3.\n", "\n", "The new analysis from CREA matches weather conditions and changes in emissions to data on the damages to health linked to exposure to air pollution.\n", "\n", "\n"]], "tags": ["Nitrogen dioxide", "coronavirus", "pollution", "World Health Organization", "Hebei province"]},
{"heading": [["World's oceans were the warmest in 2019: Study"]], "sub_heading": [["The study, published in the journal Advances in Atmospheric Sciences, also found that the past ten years have been the warmest on record for global ocean temperatures, with the last five years holding the highest record."]], "time": [["Last Updated: Jan 14, 2020, 04.25 PM IST"]], "publisher": [["PTI"]], "article": [["BEIJING: The world's oceans were the warmest in 2019 than any other time in recorded human history, especially between the surface and a depth of 2,000 metres, according to a study.\n", "\n", "\n", "The study, published in the journal Advances in Atmospheric Sciences, also found that the past ten years have been the warmest on record for global ocean temperatures, with the last five years holding the highest record.\n", "\n", "According to the researchers, the 2019 ocean temperature is about 0.075 degrees Celsius above the 1981-2010 average.\n", "\n", "To reach this temperature, the ocean would have taken in 228 ", "Sextillion", " Joules of heat, they said.\n", "\n", "\"The amount of heat we have put in the world's oceans in the past 25 years equals to 3.6 billion ", "Hiroshima", " atom-bomb explosions,\" said Lijing Cheng, an associate professor at the Chinese Academy of Sciences (CAS).\n", "\n", "The international team of 14 scientists from 11 institutes across the world, call for action to reverse climate change.\n", "\n", "The researchers used a relatively new method of analysis to account for potentially sparse data and time discrepancies in instruments that were previously used to measure ocean warmth specially from the ocean surface to 2,000 metres deep.\n", "\n", "The newly available data allowed the researchers to examine warmth trends dating back to the 1950s.\n", "\n", "The study also includes ocean temperature changes recorded by the National Oceanic and Atmospheric Administration (NOAA) in the US.\n", "\n", "The two independent data sets indicate that the past five years have been the warmest on record for global ocean temperatures.\n", "\n", "The researchers also compared the 1987 to 2019 data recording period to the 1955 to 1986 period.\n", "\n", "They found that over the past six decades, the more recent warming was about 450 per cent that of the earlier warming, reflecting a major increase in the rate of global climate change.\n", "\n", "\"It is critical to understand how fast things are changing,\" said John Abraham, a professor at the University of St. Thomas in the US.\n", "\n", "\"The key to answering this question is in the oceans -- that's where the vast majority of heat ends up,\" Abraham said.\n", "\n", "The researchers noted 2019 broke the previous records set in prior years for ", "global warming", ", and the effects are already appearing in the form of more extreme weather, rising sea levels and harm to ocean animals.\n", "\n", "According to the researchers, humans can work to reverse their effect on the climate, but the ocean will take longer to respond than atmospheric and land environments. \n", "\n"]], "tags": ["global warming", "sextillion", "Hiroshima", "John Abraham (actor)", "world oceans"]},
{"heading": [["Poaching could increase under virus lockdowns"]], "sub_heading": [["Poaching of endangered species could rebound as authorities divert their attention to enforcing coronavirus lockdown measures, an international wildlife watchdog said Wednesday, reporting stockpiling of ivory and other animal products as borders remain shut."]], "time": [["Last Updated: Apr 29, 2020, 12.48 PM IST"]], "publisher": [["AFP"]], "article": [["PARIS: Poaching of endangered species could rebound as authorities divert their attention to enforcing ", "coronavirus", " lockdown measures, an international wildlife watchdog said Wednesday, reporting stockpiling of ivory and other animal products as borders remain shut.\n", "\n", "The ", "Wildlife Justice Commission", " (WJC) said that a ban on the sale of wild animals in China was causing backlogs in ", "smuggling", " networks of pangolin scales and ivory across ", "Southeast Asia", ".\n", "\n", "But it warned that criminal gangs were adapting to tighter border controls amid the pandemic.\n", "\n", "WJC operatives, often acting undercover, reported large stockpiles of ivory in ", "Cambodia", ", Vietnam and Laos following a string of recent seizures.\n", "\n", "In Vietnam alone, smugglers had access to more than 22 tonnes of pangolin scales, the WJC said.\n", "\n", "\"Brokers have made it clear that they intend on returning their operations to previous levels as soon as possible,\" Sarah Stoner, WJC's director of intelligence, told AFP.\n", "\n", "\"The stockpiling of huge quantities of wildlife products in many of the key countries concerned presents investigative opportunities for law enforcement.\"\n", "\n", "Nevertheless, Stoner said she expected high-value wildlife smuggling to rebound whenever COVID-19 restrictions are lifted.\n", "\n", "The pangolin, an endangered species, is one of the most trafficked animals on earth, fuelling a multi-billion-dollar trade for their scales, prized as medicine in many Asian countries.\n", "\n", "After COVID-19's emergence in China late last year and following several studies suggesting the novel coronavirus may have been passed on to humans by ", "pangolins", ", authorities in Beijing moved to ban the trade and sale of all wild animal products.\n", "\n", "While that has affected the illicit trade of the products, the WJC cautioned that authorities risked leaving endangered species more vulnerable to poachers as they enforce lockdowns.\n", "\n", "\"A major concern is that poaching incidents may increase during the lockdown period, as criminal networks exploit perceived opportunities of park closures, reduced patrols in protected areas, or the diversion of law enforcement resources to deal with COVID-19 issues,\" it said.\n", "\n", "Several major busts of illicit wild animal products have occurred across Asia and Africa since most of the world went into lockdown.\n", "\n", "These include the seizure of more than six tonnes of pangolin scales in Malaysia last month, and multiple busts of smaller shipments of ivory.\n", "\n", "But the WJC said that without sustained focus from governments to enforce stricter border controls that criminal networks would adapt and smuggling would soon rebound.\n", "\n", "\"It is important that additional resources be allocated to this problem and not merely diverting current resources to focus on the markets and leave organised crime a free hand,\" said Stoner.\n", "\n", "\n"]], "tags": ["pangolins", "coronavirus", "smuggling", "Southeast Asia", "cambodia", "wildlife justice commission"]},
{"heading": [["‘Clean Ganga’ model for other rivers: Shah"]], "sub_heading": [[]], "time": [["Last Updated: Mar 14, 2020, 07.16 AM IST"]], "publisher": [["TNN"]], "article": [["New Delhi: Home Minister Amit Shah on Friday said the dedicated programme to rejuvenate Ganga has been a success and the government would launch similar initiatives to clean other rivers in the country in coordination with the respective state governments.\n", "\n", "\n", "“The success of this mission was visible in the ‘Aradh Kumbh Mela’ at Prayagraj in January 2019, when crores of people from all corners of the country and from many parts of the world took a dip in the waters of the Ganga,” said Shah while speaking at a function to honour members of the ‘Ganga Aamantran Abhiyan’.\n", "\n", "Organised by the ", "National Mission for Clean Ganga", " (", "NMCG", "), the ‘Abhiyan’ was a month-long exploratory open-water rafting and kayaking expedition, covering 2,510 km from Devprayag in Uttarakhand to Ganga Sagar in West Bengal. It was done as part of an awareness programme to involve people in the massive task of river rejuvenation.\n", "\n", "Stressing on the need for a behavioural change in people, especially children, living along the banks of the river to ensure success of the ‘Namami Gange’ project, the home minister said, “We must not look at Ganga as only a river. It is the pivot of a thousand-year old civilisation, which is one of the oldest in the world. Ganga is the symbol of Indian civilisation and is revered in each household of the country.”\n", "\n", "Union ‘Jal Shakti’ minister, Gajendra Singh Shekhawat, dwelt on the “incessant” efforts undertaken by the government for rejuvenating Ganga under ‘Namami Gange’ in record time of five years.\n", "\n", "Citing visible improvement in quality of Ganga water, he said, “Today, Ganga stands among the top 10 clean rivers in the world, and the level of oxygen and dolphin population have steadily increased in the river.” \n", "\n", "\n"]], "tags": ["NMCG", "National Mission for Clean Ganga", "clean ganga model", "clean ganga model amit shah", "Ganga Abhiyan"]},
{"heading": [["Legislative framework needed to implement National Clean Air Programme: Tharoor"]], "sub_heading": [[]], "time": [["Last Updated: Nov 21, 2019, 07.41 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Congress member Shashi Tharoor on Thursday suggested that a legislative framework be adopted to implement the ", "National Clean Air Programme", " (NCAP), which proposes multiple measures to combat air pollution.\n", "\n", "\n", "Speaking in the Lok Sabha, Tharoor said political differences should be kept aside as there was a need to work together to address this \"toxicity\".\n", "\n", "\"A legislative approach needs to be adopted to implement the NCAP,\" he said.\n", "\n", "Citing various studies, the Thiruvananthapuram MP said pollution has adverse impact on the economy of the country.\n", "\n", "\"It is genuinely not too late. It is a national crisis. It is extremely important that we understand the urgency of this issue,\" he said during a discussion on 'Air Pollution and Climate Change'.\n", "\n", "Tharoor asserted that there is a need to work together in a collaborative spirit to deal with this perennial issue.\n", "\n", "Since 1929, ozone-related deaths have jumped by about 150 per cent, he said, adding that the country's GDP will be higher if we deal with this matter.\n", "\n", "\"Affect of pollution on our quality of life is incalculable...These are the worst months of the year,\" the MP said.\n", "\n", "Citing a medical study, Tharoor said air pollution leads to an irreversible lung damage in children.\n", "\n", "He claimed that many foreigners have left India because of the menace of air pollution and many hesitate to come to India due to this problem.\n", "\n", "Further, Tharoor cited the example of China and how the neighbouring country's stringent steps to deal with air pollution has yielded positive results there.\n", "\n", "China has also used a technology wherein it filters carbon particles from air to make diamonds by compressing that, he claimed.\n", "\n", "\"Can we do in Delhi, what others have done,\" he asked, adding that the government should specify steps it is taking to deal with the issue.\n", "\n", "Legal means need to be adopted to fix accountability and an ambitious action plan must be implemented, Tharoor said.\n", "\n", "He added that farmers should not be blamed for pollution and the government should provide incentives to them to find a solution.\n", "\n", "\"We must have a collaborative action plan for this...we need to take on board civil society also. It is important that we now work together in a collaborative spirit,\" Tharoor said.\n", "\n", "Participating in the discussion, Rajiv Pratap Rudy said air pollution is not limited to Delhi only. Stubble burning is just one of the hundred of factors responsible for pollution and hence, farmers should not be held responsible, he said.\n", "\n", "Sunita Duggal of the BJP said the US has walked out of the climate change agreement despite being the biggest polluter, therefore all members should write to US President Donald Trump to re-join.\n", "\n"]], "tags": ["tharoor pollution", "India pollution", "tharoor national clean air programme", "tharoor clean air", "national clean air programme"]},
{"heading": [["Climate change is now coming for your Oreos"]], "sub_heading": [["The latest victims of climate change could be Oreos, as drenched fields across the US make the wheat that’s a key ingredient a scarcer commodity. Winter-wheat plantings fell to their lowest levels in more than a century as the grain got harder to seed. Especially the soft red winter wheat, with sowings slumping 25%, a variety that forms the base for biscuits."]], "time": [["Last Updated: Feb 10, 2020, 08.48 AM IST"]], "publisher": [["Bloomberg"]], "article": [["NEW YORK: The latest victims of climate change could be ", "Oreos", ", as drenched fields across the US make the ", "wheat", " that’s a key ingredient a scarcer commodity.\n", "\n", "\n", "Winter-wheat plantings fell to their lowest levels in more than a century as the grain got harder to seed. That was especially true for soft red winter wheat, with sowings slumping 25%. And that might be bad news for snack fans — the variety is used in the flour that forms the base for ", "crackers", ", biscuits and beloved goodies including Mondelez International Inc.’s Oreos and ", "Kellogg", " Co.’s Cheez-Its.\n", "\n", "The warming atmosphere is making the spring planting season a lot wetter and a lot muddier in the ", "Midwest", ". That’s pressuring ", "farmers", " to abandon a strategy known as double-cropping — when the same fields get sown in the spring with soybeans and then in the fall with wheat. Forced to choose just one, growers are giving up on wheat.\n", "\n", "Changing weather patterns are wreaking havoc on traditional agriculture calendars all over the world. For America’s breadbasket, record rainfall in the spring of 2019 resulted in planting delays that pushed harvests deeper into autumn, when farmers would want to sow winter-wheat seeds.\n", "\n"]], "tags": ["Oreos", "Crackers", "Wheat", "farmers", "Kellogg", "Midwest"]},
{"heading": [["18.3°C: Antarctica registers hottest temperature ever"]], "sub_heading": [[]], "time": [["Last Updated: Feb 09, 2020, 06.22 AM IST"]], "publisher": [["Agencies"]], "article": [["WASHINGTON: The temperature in northern Antarctica hit 18.3°C, a likely heat record on the continent best known for snow, ice and penguins.\n", "\n", "\n", "The reading was taken on Thursday at an ", "Argentine", " research base, called Esperanza, and still needs to be verified by the ", "World Meteorological Organisation", " (WMO). “Everything we have seen thus far indicates a likely legitimate record,” ", "Randall Cerveny", ", who researches records for the organisation, said. He added that he is waiting for full data to confirm the reading.\n", "\n", "Scientists on the Esperanza said that wasn’t the only record broken this week. The nation’s Marambio site registered the highest temperature for the month of February since 1971. Thermometers there hit 14.1°C, above the previous February 2013 reading of 13.8°C.\n", "\n", "The reports are shocking, but not surprising, said Frida Bengtsson, who is leading a expedition to the Antarctic for the environmental group Greenpeace. “We’ve been in the Antarctic for the last month, documenting the dramatic changes,” she said. “In the last month, we’ve seen penguin colonies sharply declining under the impacts of climate change in this supposedly pristine environment.”\n", "\n", "Antarctica is among the fastest-warming regions on the planet, with the Antarctic Peninsula, warming particularly quickly, according to the WMO. Average temperatures on the continent have risen almost 3°C over the past 50 years. The previous record of 17.5°C was set in 2015.\n", "\n"]], "tags": ["World Meteorological Organisation", "Argentine", "World Meteorological Organization", "washington", "randall cerveny"]},
{"heading": [["Very few are listening: Writer Amitav Ghosh on climate crisis"]], "sub_heading": [[]], "time": [["Last Updated: Jan 16, 2020, 07.46 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Amid the ongoing climate crisis, cries of help coming from planet earth are loud and clear, but \"very few seems to be listening\", renowned author ", "Amitav Ghosh", " rued on Thursday.\n", "\n", "\n", "Ghosh, who delivered the fourth A K ", "Ramanujan", " lecture at Delhi University's ", "Ramjas College", ", said the \"great majority seems to prefer not to think about what lies ahead\".\n", "\n", "\"The most terrible aspect of this time is that very few seem to be listening. The great majority seems to prefer not to think about what lies ahead. It's almost like if we were on a train that is speeding towards the edge of a cliff, instead of slowing down or changing the course, we have decided to move even faster,\" Ghosh said.\n", "\n", "The 63-year-old author in 2016 penned \"The Great Derangement: Climate Change and the Unthinkable\" that addressed different aspects and concerns over climate change. His latest book of fiction \"Gun Island\" too talked about the slow violence that the world is experiencing.\n", "\n", "It is this climate crisis, that according to the writer, sets the present times apart from the 1970s, which seem to have \"striking resonances\", particularly in terms of political environments.\n", "\n", "He said like today, then too India had a leader, Indira Gandhi, who \"commanded undisputed power, which she had consolidated with a series of nationalist and populist moves\", and, like today, consequences followed in terms of \"widespread protests and unrest\".\n", "\n", "\"All of us who were students back then vividly remember the marches and demonstrations that disrupted the functioning of this university except it was Arun Jaitley and his followers who were on the streets,\" Ghosh, who was then a student of DU, said.\n", "\n", "However, these seeming similarities are \"deeply misleading\", he said.\n", "\n", "\"The change in the magnitude of human presence is itself is one of the most striking differences between the 1970s and today. In 1974, India had less than half of today's population, and Delhi had about a fifth of the number of inhabitants it has now,\" he said.\n", "\n", "Talking about the grave dangers that loom over humankind, he said, \"I could go on about the lack of preparedness for the super cyclones of the future, of the dead zones of Bengal, of the wild fires of the Nilgiris, of the disruption of monsoon, of the studies that predict the rising temperatures that could render most of South Asia uninhabitable in a few decades and so on\".\n", "\n", "The Jnanpith winning writer also spoke about the existing \"divisions around\" the new citizenship law.\n", "\n", "\"In a sense, these divisions are instances of homogenising reductive impulse ultimately running up against the contextualising pluralising dynamic that is so deeply rooted in India's soil.\n", "\n", "\"The truths of Assam and Tripura are simply not the same as those of Uttar Pradesh and Gujarat,\" the author said.\n", "\n", "The lecture was dedicated to historian Hari Sen, a professor at Ramjas and a friend of Ghosh from his college days who is approaching his retirement.\n", "\n", "The lecture has previously been delivered by late actor, director and writer Girish Karnad; politician and former diplomat Gopal Krishna Gandhi and Carnatic music vocalist and activist T M Krishna.\n", "\n"]], "tags": ["Ramanujan", "amitav ghosh", "onthe jnanpith", "University of Delhi", "ramjas college", "environmentshe"]},
{"heading": [["UN: Antarctic high temp records will take months to verify"]], "sub_heading": [["Record high temperatures reportedly measured in Antarctica will take months to verify, the UN weather agency said. Scientists measured a temperature of 18.3 degrees Celsius on Feb. 6 on a peninsula that juts out from Antarctica. The previous record there was 17.5 degrees celsius in March 2015."]], "time": [["Last Updated: Feb 16, 2020, 11.02 PM IST"]], "publisher": [["AP"]], "article": [["BERLIN: Record high temperatures reportedly measured in Antarctica will take months to verify, the UN weather agency said Sunday.\n", "\n", "\n", "A spokesman for the ", "World Meteorological Organization", " said the measurements made by researchers from ", "Argentina", " and ", "Brazil", " earlier this month have to undergo a formal process to ensure that they meet international standards.\n", "\n", "``A formal decision on whether or not this is a record is likely to be several months away,'' said Jonathan Fowler, the WMO spokesman.\n", "\n", "Scientists at an ", "Argentine", " research base measured a temperature of 18.3 degrees ", "Celsius", " (nearly 65 degrees Fahrenheit) Feb. 6 on a peninsula that juts out from Antarctica toward the southern tip of South America. The previous record there was 17.5 degrees celsius (63.5 degrees Fahrenheit) in March 2015.\n", "\n", "Last week, researchers from Brazil claimed to have measured temperatures of 20.75 degrees Celsius on an island off the peninsula _ beating the record for the entire Antarctic region of 19.8 Celsius in January 1982.\n", "\n", "Fowler said both of the new measurements would need to be transmitted to Prof. Randall Cerveny, a researcher at Arizona State University who examines reported temperature records for WMO.\n", "\n", "Cerveny then shares the data with a wider group of scientists who ``will carefully evaluate the available evidence (including comparisons to surrounding stations) and debate the merits and problems of the observation,'' said Fowler.\n", "\n", "The evaluation normally takes six to nine months, after which Cerveny would ``formally either accept or reject the potential extreme,'' giving official WMO approval to the new record, he said.\n", "\n", "Climate change is causing the Arctic and the Antarctic to warm faster than other parts of the planet.\n", "\n"]], "tags": ["brazil", "Argentina", "Celsius", "Argentine", "World Meteorological Organization", "berlin"]},
{"heading": [["Amazon boss Bezos launches $10 bn fund to combat climate change"]], "sub_heading": [["\"Climate change is the biggest threat to our planet. I want to work alongside others, both to amplify known ways and to explore new ways of fighting the devastating impact of climate change,' said Bezos who is worth $130 billion."]], "time": [["Last Updated: Feb 18, 2020, 11.09 AM IST"]], "publisher": [["AP"]], "article": [["NEW YORK: Amazon founder ", "Jeff Bezos", " said Monday that he plans to spend $10 billion of his own fortune to help fight ", "climate change", ".\n", "\n", "Bezos, the world's richest man, said in an Instagram post that he'll start giving grants this summer to scientists, activists and nonprofits working to protect the earth.\n", "\n", "\"I want to work alongside others both to amplify known ways and to explore new ways of fighting the devastating impact of climate change,'' Bezos said in the post.\n", "\n", "Amazon, the company Bezos runs, has an enormous carbon foodprint. Last year, Amazon officials said the company would work to have 100% of its energy use come from solar panels and other renewable energy by 2030.\n", "\n", "The online retailer relies on fossil fuels to power planes, trucks and vans in order to ship billions of items all around the world. Amazon workers in its Seattle headquarters have been vocal in criticizing some of the company's practices, pushing it to do more to combat climate change.\n", "\n", "Bezos said in the post Monday that he will call his new initiative the Bezos Earth Fund. An Amazon spokesman confirmed that Bezos will be using his own money for the fund.\n", "\n", "Despite being among the richest people in the world, Bezos only recently became active in donating money to causes as other billionaires like Bill Gates and ", "Warren Buffett", " have done. In 2018, Bezos started another fund, committing $2 billion of his own money to open preschools in low-income neighborhoods and give money to nonprofits that help homeless families.\n", "\n", "Bezos, who founded Amazon 25 years ago, has a stake in the company that is worth more than $100 billion.\n", "\n", "\n"]], "tags": ["Warren Buffett", "Helen Walton", "Jeff Bezos", "ngos", "Sam Walton", "climate change"]},
{"heading": [["By ignoring climate emergency, world leaders are forcing children to act: Greta Thunberg"]], "sub_heading": [["\"Our leaders behave like children so it falls to us to be the adults in the room. They are failing us but we will not back down,\" said Swedish teen activist Greta Thunberg on Friday addressing some 20,000 people at the Bristol Youth Strike 4 Climate (BY24C) event. She said the \"uncomfortable truth\" was being swept \"under the rug\" for \"children to clean up\"."]], "time": [["Last Updated: Feb 28, 2020, 08.29 PM IST"]], "publisher": [["PTI"]], "article": [["LONDON: ", "Swedish", " teen activist ", "Greta Thunberg", " on Friday accused world ", "leaders", " of ignoring the climate emergency and \"sweeping their mess under the rug\".\n", "\n", "\n", "\"Our leaders behave like children so it falls to us to be the adults in the room. They are failing us but we will not back down,\" the 17-year-old said as she addressed some 20,000 people at the Bristol Youth ", "Strike", " 4 Climate (BY24C) event.\n", "\n", "She said \"it should not be this way\", but the \"uncomfortable truth\" was being swept \"under the rug\" for \"children to clean up\".\n", "\n", "Thunberg warned world leaders she will \"not be silenced when the world is on fire\".\n", "\n", "She accused politicians of ignoring the climate emergency and \"sweeping their mess under the rug\", the BBC quoted her as saying.\n", "\n", "\"Our leaders behave like children so it falls to us to be the adults in the room. They are failing us but we will not back down,\" she told the crowds who were chanting \"Greta, Greta\".\n", "\n", "\"Activism works so I'm telling you to act,\" she said. \"We are being betrayed by those in power.\"\n", "\n", "\"There will be a time when we will look back and ask ourselves what we did right now. How do we want to be remembered,\" she said.\n", "\n", "\"People are already suffering and dying from the consequences of the climate emergency and it will get worse.\n", "\n", "\"This emergency is being completely ignored by the politicians, the media and those in power,\" Thunberg said.\n", "\n", "\"Basically, nothing is being done to halt this crisis despite all the beautiful words and promises from our elected officials,\" she was quoted as saying by Sky News.\n", "\n", "Thunberg has become a leading voice for action on climate change, inspiring millions of students to join protests around the world.\n", "\n", "Thunberg has been named Time magazine's Person of the Year for 2019.\n", "\n"]], "tags": ["activist", "Swedish", "bristol youth", "Strike", "leaders", "Greta Thunberg"]},
{"heading": [["Why virus may bring plastic back in favour"]], "sub_heading": [[]], "time": [["Last Updated: Mar 16, 2020, 01.52 PM IST"]], "publisher": [["Bloomberg"]], "article": [["NEW DELHI: It took one week after the first US case of Covid-19 with no overseas connection for ", "Starbucks", " Corp to ban customers from bringing in reusable coffee mugs.\n", "\n", "\n", "Judith Enck, a former regional administrator for the Environmental Protection Agency, was disappointed. Public health comes first, of course, but as the founder of the grassroots Beyond Plastics project, Enck had her doubts that returning to disposable cups would make anyone safer. Currency, for instance, is a notorious germ-carrier. “Will Starbucks now stop accepting cash?” she says.\n", "\n", "These are nervous times for activists working to wean the world off plastics. Until the novel ", "coronavirus", " started its spread across the globe, 2020 appeared to be a year when meaningful plastic-use restrictions would finally take hold. A growing list of consumer firms had set targets to reduce their reliance on plastic packaging. The virus plays right into the ", "industry", "’s strong suits: disposability and hygiene. A new report released by BloombergNEF last week found that, in the short run at least, the fears of plastics opponents might be valid. “Concerns around food hygiene due to Covid-19 could increase plastic packaging intensity, undoing some of the early progress made by firms,” it stated.\n", "\n", "As consumer taste started to shift against the $40 billion ", "plastics industry", ", manufacturers added an additional argument to their arsenal: that their ", "products", " are actually a boon to overall sustainability, despite being petroleum-based, nonbiodegradable, and difficult to recycle.Most of these claims are based on a handful of studies, the most significant of which was done for ACC by Franklin Associates in 2018. It looked at the life cycle of products like water bottles, shrink wrap, and retail shopping bags and concluded that if they were made of alternative materials — say glass or aluminum or textiles — they would require five times the amount energy to manufacture and use more water in the process.\n", "\n", "While BNEF said it was too early to know for sure that Covid-19 is affecting plastic demand overall, it did predict that any spike would likely be temporary, and that industry revenues would be flat or even up in the midst of a sharp economic downturn. “In the long term, we do not expect this increased demand to have a significant impact on either plastic demand or circular economy goals,” the report said, referring to a future in which all items are either reused or recycled. A study published in the Journal of Hospital Infection said the virus behind Covid-19 can survive for nine days on plastic surfaces at room temperature.\n", "\n", "The plastics industry is seizing the moment. In February, Plastics Industry Association head Tony Radoszewski issued a statement: “As new coronavirus cases are confirmed around the globe, the plastics industry stands ready to assist authorities and public health advocates in making sure our materials and products are on the frontline of combating the spread of coronavirus.”\n", "\n"]], "tags": ["plastics industry", "coronavirus", "Products", "starbucks", "covid", "Industry"]},
{"heading": [["Snowfall may be key to why some Himalayan glaciers aren’t melting"]], "sub_heading": [["Global warming is shrinking glaciers across the world, whether in the Alps or the Himalayas. Except in one spot: the Karokaram mountain range in the northwest Himalayas"]], "time": [["Last Updated: Feb 21, 2020, 04.30 AM IST"]], "publisher": [[", TNN"]], "article": [["Global warming", " is shrinking glaciers across the world, whether in the Alps or the Himalayas. Except in one spot: the Karokaram mountain range in the northwest Himalayas. Most of the glaciers in this region, which cuts across ", "Pakistan", ", India, and China, are stable. Some are even growing.\n", "\n", "\n", "Ever since this “anomaly” came to light in the early 2000s, scientists have been trying to figure out why. Recent research has been honing in on one factor: snowfall. Now, a new study confirms its importance. Modelling fluctuations in glaciers and snowfall over several decades, researchers from the Indian Institute of Education and Research (IISER) in Pune found that variability in snowfall accounts for 60% of changes in glacier mass since 1989.\n", "\n", "The findings show that snowfall is the controlling factor in glacier loss in the Himalayas, said Argha Banerjee, study co-author and professor at IISER Pune.\n", "\n", "“We knew that fluctuations in snowfall can affect glacier mass but now we know just how much by a factor of five,” said Banerjee. He added, “Now that we know snowfall controls glacier mass so strongly, we can also understand the ", "Karakoram", " anomaly better.”\n", "\n", "The model showed that although snowfall is reducing in most of the Himalayas due to global warming, it is relatively insensitive to local temperature changes in the Karakoram. (Snowfall affects glaciers both directly and indirectly: Accumulation of snow grows the glacier; more snow cover also means a larger white surface to reflect away sunlight, known as the albedo effect.)\n", "\n", "Why would snowfall be more stable in the Karakoram? Several theories abound. For one, the Karakoram seems to receive most of its snowfall during winter driven by a meteorological phenomenon called the Westerly Disturbance and not during the summer monsoon as in the rest of the region. Warm summer temperatures affect snowfall in the rest of the Himalayas more, a 2014 study notes, “as temperatures rise above freezing precisely when the majority of precipitation falls”.\n", "\n", "Another study found that a “vortex” of cold air gets trapped in the Karakoram mountains during the summer, countering warming. And another important 2018 study found that irrigation in China, Pakistan, and north India could be increasing snowfall. As irrigated land increases, more water evaporates from the ground, leading to more moisture in the atmosphere. This, in turn, means more cloud cover and snow in the hills.\n", "\n", "Understanding glacier response to climate change in the Himalayas—often called the third pole—is considered key to South Asia’s water security. The Himalayas are the source of the region’s main river systems, and the Karakoram region alone holds 13,700 glaciers.\n", "\n", "The latest findings highlight the importance of getting more data on snowfall, said Bannerjee. Glacier loss happens slowly over decades, making it hard to integrate into climate models. Snowfall trends may be easier to detect and incorporate into projections—if we can get good data, that is. “Snow is the biggest unknown factor in the Himalayas,” said Banerjee. “On glaciers, we have some information, though little compared to Europe, but on snow we have virtually nothing.”\n", "\n", "More data for glaciers is critical, agreed RAAJ Ramsankaran, an IIT Bombay scientist also working on glaciers. “For the first time, this study reveals that snowfall variation has a stronger role in mass balance variation in the Hindukush Himalayas,” said Ramsankaran.\n", "\n", "Many questions remain to be explored, added study co-author ", "Raghu Murtugudde", ", who is an earth scientist at the University of Maryland in the US. For one, understanding seasonality is important. “Summer snow is becoming more rain in some places, whereas warmer winters may be bringing more snow in some other places,” he said.\n", "\n", "Also, the transition from eastern to western Himalayas with the impact of the Pacific/El Niño and the monsoon giving over to westerly disturbances and the influence of the Atlantic, is not fully understood, he said.\n", "\n"]], "tags": ["Indian Institute of Technology Bombay", "global warming", "Raghu Murtugudde", "Karakoram", "Pakistan", "Himalayan"]},
{"heading": [["Coronavirus forces UN body to postpone its flagship climate meet COP26"]], "sub_heading": [["The COVID-19 spread has forced the UN body to postpone its flagship annual climate change conference which was scheduled to be held at Glasgow in United Kingdom (UK) in November. This crucial meet will now be held in 2021 -- the first year of the operationalisation of the the Paris Agreement."]], "time": [["Last Updated: Apr 02, 2020, 04.51 PM IST"]], "publisher": [[", TNN"]], "article": [["INEW DELHI: The COVID-19 spread has forced the UN body to postpone its flagship annual climate change conference which was scheduled to be held at Glasgow in United Kingdom (UK) in November. This crucial meet will now be held in 2021 -- the first year of the operationalisation of the the Paris Agreement. \n", "\n", "Though the postponement is welcomed by experts and civil societies across the globe, they insist that the postponing ", "COP26", " (26th session of the conference) does not mean postponing climate action which is a non-negotiable global priority. \n", "\n", "“Dates for a rescheduled conference in 2021, hosted in Glasgow by the UK in partnership with Italy, will be set out in due course following further discussion with parties (countries),” said the COP Bureau of the United Nations Framework Convention on Climate Change (UNFCCC). \n", "\n", "It said, “In light of the ongoing, worldwide effects of COVID-19, holding an ambitious, inclusive COP26 in November 2020 is no longer possible. Rescheduling will ensure all parties can focus on the issues to be discussed at this vital conference and allow more time for the necessary preparations to take place.”\n", "\n", "Under the Paris Agreement, which is to be operationalised from January 1 next year, countries including India are expected to take climate actions as per their respective commitments to keep the average global temperature rise within 2 degree Celsius by 2100 from the pre-industrial (1850-1900) level. \n", "\n", "The UK government had come under tremendous pressure to take a call on holding COP26 in a situation when the pandemic intensified in the country and others parts of the globe including Italy which is the partner country for this year’s UN climate change conference. Italy was to host a number of key preparatory events such as a Youth Event and the Pre-COP Summit in Milan from September 28 to October 2. \n", "\n", "Even the Scottish government announced this week that the SEC Arena - where COP26 was to take place - will be turned into a field hospital to cope with COVID-19 cases. \n", "\n", "“The world is currently facing an unprecedented global challenge and countries are rightly focusing their efforts on saving lives and fighting COVID-19. That is why we have decided to reschedule COP26,” said Alok Sharma, the COP26 President-Designate and the UK’s Secretary of State for Business, Energy and Industrial Strategy.\n", "\n", "Other UN climate meetings, scheduled to be held in June in Bonn, has also been postponed. It’ll now be held in October. Many countries were expected to announce their new commitments of climate action during COP26 in November. \n", "\n", "\"Whilst we have decided to postpone COP26, including the Pre-COP and ‘Youth for the Climate’ event, we remain fully committed to meeting the challenge of climate change...We will continue to work with our British partners to deliver a successful COP26,” said Italian Minister for the Environment, Land and Sea Protection, Sergio Costa. \n", "\n", "Experts and civil society members acknowledged the necessity to postpone the Bonn climate session, Pre-COP events and COP26. \n", "\n", "\n", "\n", "\n", "Coronavirus pandemic: Complete Coverage", "21-day lockdown: What will stay open and what won't", "How to quarantine yourself at home", "Trust the newspaper for your daily verified news", "\n", "“The postponement of the Bonn session to later this year and COP to next year does not mean a postponement of climate ambition. This does not let governments off the hook. We will continue to hold them accountable to deliver renewed climate ambition for the equitable and just transformation of societies. If there is anything that this Covid19 crisis has taught us, it is that now more than ever we need sustained international efforts to build a safe and resilient future,” said Tasneem Essop, executive director of a global NGO, Climate Action Network (CAN). \n", "\n", "Indian experts too reacted on the move. Director Genera of The Energy and Resource Institute (TERI), Ajay Mathur, said, “The momentum for climate action has accelerated considerably, and we will have to ensure that this momentum is sustained even as CoP26 is moved to 2021. However, this postponement was the right decision - it highlights the centrality of the individual citizens of the world, and of their safety, security, and wellbeing. \n", "\n", "“We need to keep this centrality in mind as we move to maintain and enhance momentum on climate action, while building a safer, healthier and more resilient global economy.”\n", "\n", "Harjeet Singh, ActionAid’s global lead on climate change, said, “Climate disasters won’t stop for the Covid-19 crisis. But we can’t address the climate emergency if distracted governments adopt half-measures in order to stick to a schedule. \n", "\n", "Current climate plans put the world on track for a catastrophic 3 or 4 degrees of warming. In these uncertain times, a postponement of COP26 gives governments more time to increase their climate pledges.”\n", "\n", "It is also expected in current circumstances that the Intergovernmental Panel on Climate Change (IPCC) - UN body for assessing the science related to climate change - may not be able to submit its sixth assessment report (AR6) on climate change on time. \n", "\n", "“It is anticipated that some or all of the original schedule for the finalization of the Sixth Assessment Report – the three Working Group reports and the Synthesis Report – including milestones and deadlines for activities for the preparation of these reports, could shift, in consultation with the National Focal Points, with further adjustments to the schedule taken as the situation evolves,” said the IPCC in a statement on Thursday. \n", "\n", "\n"]], "tags": ["climate meet cop26", "climate meet", "coronavirus", "massive devastation", "host uk and partner italy", "cop26"]},
{"heading": [["Last year was Europe’s hottest on record, even without El Nino: Scientists"]], "sub_heading": [["Europe's average annual temperature hit a record high last year, exceeding the previous hottest years on record, which were 2014, 2015 and 2018, the European Union's Copernicus Climate Change Service (C3S), said in its annual \"European State of the Climate\" report."]], "time": [["Last Updated: Apr 22, 2020, 02.43 PM IST"]], "publisher": [["Reuters"]], "article": [["Last year was the hottest on record in Europe, extending a run of exceptionally warm years driven by record levels of heat-trapping ", "greenhouse gases", " in the atmosphere, according to a new study released on ", "Earth Day", " on Wednesday.\n", "\n", "Europe's average annual temperature hit a record high last year, exceeding the previous hottest years on record, which were 2014, 2015 and 2018, the European Union's Copernicus Climate Change Service (C3S), said in its annual \"European State of the Climate\" report.\n", "\n", "Of Europe's 12 warmest years on record, 11 have occurred since 2000, the report found.\n", "\n", "\"This warming trend is now unequivocal anywhere on the planet. And as a consequence of that, the frequency of these record breaking events is going up,\" C3S director ", "Carlo Buontempo", " told Reuters.\n", "\n", "This year looks likely continue the warming trend. Copernicus data from Dec. 2019-Feb. 2020 showed that Europe experienced its warmest winter on record.\n", "\n", "The scientists", " said last year's record temperatures came even though there was no El Nino – a weather pattern that typically leads to higher temperatures.\n", "\n", "\"This made the record-breaking events even more extraordinary,\" Buontempo said.\n", "\n", "Rather, high pressure weather events helped trigger the scorching heatwaves seen last June and July, when countries including France, Germany, Belgium and the Netherlands recorded their highest ever temperatures.\n", "\n", "The scientists said these high pressure events are likely to become more severe, as the world warms.\n", "\n", "Concentrations of planet warming gases in the atmosphere, including carbon dioxide and methane, climbed in 2019 and are now at levels not seen on the Earth for millions of years, the scientists said.\n", "\n", "The 27-country EU plans to reduce its net greenhouse gas emissions to zero by 2050 in line with the 2015 Paris Agreement on climate change, a pathway that will require transformational change in many sectors of the economy.\n", "\n", "The Paris accord aims to cap global warming at \"well below\" 2 degree Celius and as close as possible to 1.5C above pre-industrial levels.\n", "\n", "Global average temperatures have already increased roughly 1.1C since pre-industrial times, the scientists said. \n", "\n"]], "tags": ["greenhouse gases", "Earth Day", "europe hottest", "carlo buontempo", "The Scientists"]},
{"heading": [["Guardians of Life: Joaquin Phoenix collaborates with Extinction Rebellion for a short film on climate change"]], "sub_heading": [[]], "time": [["Last Updated: Feb 08, 2020, 06.23 PM IST"]], "publisher": [["TIMESOFINDIA.COM"]], "article": [["NEW DELHI: At a time when news about wildfires, floods and droughts fill front pages across the world, a short-film '", "Guardians of Life", "' intends to act as an alarm call for the plight of the Amazon, its indigenous communities and for deforestation and biodiversity loss. The film by Extinction Rebellion will feature Oscar favourite actor ", "Joaquin Phoenix", " who is also known for his climate change activism.\n", "\n", "\n", "Extinction Rebellion, the global environmental movement has collaborated with Mobilize Earth and ", "Amazon Watch", ", an environmental NGO, for this short-film which is the first of twelve in a planned series. Each part in the series will tell a story about catastrophic issues facing the human species as we move into what most scientists, politicians and the public see as the make or break decade for the survival of life on the planet.\n", "\n", " \n", " \n", "The 2-minute short film, set in an Emergency Room, launches a new campaign to engage the public in different aspects of the Climate and Ecological Emergency. It will also be starring Rosario Dawson, Matthew Modine Oona Chaplin, Adria Arjona, Albert Hammond Jr & Q’orianka Kilcher.\n", "\n", "More stars are being lined up to take part as Hollywood begins to use its influence to address the climate and ecological emergency which is seen among the gravest crisis that humanity has ever faced.\n", "\n", "Phoenix's involvement comes as no surprise given his history of activism. He was recently arrested at a protest organised by actress Jane Fonda in Washington DC, where he spoke about the link between climate change and animal agriculture.\n", "\n", "Phoenix said, \"It’s really a call to action. I did it to raise awareness about the meat and dairy industry’s effect on climate change.\"\n", "\n", "Film’s Director, ", "Shaun Monson", " said he felt compelled to make the film as previous documentary-style Public Service Announcements (PSAs) had failed to move audiences to take action: “so instead of focusing on deforestation, ice melting and species extinction, we use a story as a metaphor. The Amazon has been called the lungs of the world, or the heart of the world, but instead of documentary footage, we proposed an ER setting with doctors and nurses trying to save an unseen patient with systemic heart failure. The twist is not only who one of the paramedics is, but what they were really fighting to save all along.”\n", "\n", "Film’s female lead, Q’orianka Kilcher said, “As an indigenous actress, I feel a strong responsibility to use my public platform to help amplify the voices who are seldom heard including all the indigenous defenders around the world who are the protectors of our Mother Earth, the Amazon Rainforest, and all the biodiversity and animals.”\n", "\n", "Gail Bradbrook, the co-founder of Extinction Rebellion, hopes that this is one of the first signs of Hollywood beginning to use its influence, to tell the truth about the gravity of the climate and ecological crisis.\n", "\n", "Leila Salazar-López of Amazon Watch believes the film is an example of art reflecting life: “An indigenous woman saving the Amazon is not a metaphor: it is a daily reality as the rainforest is razed and indigenous lands are invaded for profit.\"\n", "\n", "The next film in the 12-part series will deal with the topic of denial, asking why we as a species choose to ignore the warning signs rather than deciding to act now on the climate & ecological emergency.\n"]], "tags": ["leila salazar", "Guardians of Life", "Amazon Watch", "Joaquin Phoenix", "Shaun Monson"]},
{"heading": [["Global CO2 emissions to drop 4-7% in 2020, but will it matter?"]], "sub_heading": [["In early April, coronavirus lockdowns led to a 17 percent reduction worldwide in carbon pollution compared to the same period last year, according to the first peer-reviewed assessment of the pandemic's impact on CO2 emissions, published in Nature Climate Change."]], "time": [["Last Updated: May 20, 2020, 07.39 AM IST"]], "publisher": [["AFP"]], "article": [["PARIS: ", "Global CO2 emissions", " from fossil fuels are set to drop by up to seven percent in 2020 because of the ", "coronavirus", " pandemic, but even this dramatic decline -- the sharpest since WWII -- would barely dent longterm global warming, researchers reported Tuesday.\n", "\n", "\n", "In early April, coronavirus lockdowns led to a 17 percent reduction worldwide in ", "carbon pollution", " compared to the same period last year, according to the first peer-reviewed assessment of the pandemic's impact on CO2 emissions, published in ", "Nature Climate Change", ".\n", "\n", "Four countries or blocs -- China, the United States, the ", "European Union", " and India -- accounted for two-thirds of the downturn across the first four months of 2020, equivalent to more than one billion tonnes of CO2.\n", "\n", "Total emissions from industry and energy last year came to a record 37 billion tonnes.\n", "\n", "\"Population confinement has led to drastic changes in energy use and CO2 emissions,\" said lead author ", "Corinne Le Quere", ", a professor at the Tyndall Centre for Climate Change Research at the University of East Anglia.\n", "\n", "\"These extreme decreases are likely to be temporary, however, as they do not reflect structural changes in the economic, transport or energy systems.\"\n", "\n", "If the global economy recovers to pre-pandemic conditions by mid-June -- an unlikely scenario -- CO2 emissions in 2020 are projected to drop only four percent, Le Quere and her team calculated.\n", "\n", "But if lockdown restrictions persist throughout the year, the decline will be around seven percent.\n", "\n", "With nearly five million confirmed infections and 320,000 deaths, the COVID-19 pandemic has deflected attention from the climate crisis that dominated global concerns in 2019.\n", "\n", "But the climate threat remains, other experts warn.\n", "\n", "\"This will make barely a dent in the ongoing build-up of carbon dioxide in the atmosphere,\" said Richard Betts, head of climate impacts research at Britain's Met Office Hadley Centre.\n", "\n", "\"We need to stop putting it there altogether, not just put it there more slowly,\" he said.\n", "\n", "\"It's like we're filling a bath and have turned down the tap slightly -- but not turned it off. The water is still rising, just not as fast.\"\n", "\n", "Earth's average surface temperature has so far risen by one degree Celsius above pre-industrial levels -- enough to amplify deadly droughts, heatwaves and superstorms engorged by rising seas.\n", "\n", "Under the 2015 Paris climate treaty, nearly 200 nations pledged to cap global warming at \"well below\" 2C.\n", "\n", "But the UN's Intergovernmental Panel on Climate Change (IPCC) subsequently determined that 1.5C is a far safer temperature guardrail.\n", "\n", "The pandemic has underscored just how difficult it will be to hit that more ambitious target.\n", "\n", "Emissions must fall 7.6 percent -- in line with the worst-case lockdown scenario for 2020 -- every year this decade to ensure the 1.5C cap, unless other means are found to remove carbon from the atmosphere, scientists calculate.\n", "\n", "\"The pandemic has shown us that major structural changes in the transport and energy systems are required,\" noted Mark Maslin, a professor of climatology at University College London.\n", "\n", "Some experts have suggested the pandemic could speed up that transition.\n", "\n", "\"Fossil fuels seem to be getting hit harder relative to renewables,\" Glen Peters, research director of the Center for International Climate Research in Oslo, told AFP.\n", "\n", "\"If this (continues) we may come out of COVID with emissions going down, since renewables have been able to take more relative space, pushing out some of the most polluting fossil fuels, especially coal.\"\n", "\n", "But the multi-trillion dollar rescue packages -- especially in the United States and China -- hastily assembled to stave off another Great Depression send mixed signals when it comes to building a green global economy.\n", "\n", "\"There is a high risk that short-sightedness will lead governments to lose track of the bigger picture and put money into highly polluting sectors that have no place in a zero-carbon society,\" said Joeri Rogelj, a researcher at Grantham Institute and Imperial College London.\n", "\n", "Different sectors of the economy have been hit unevenly by measures taken to halt the pandemic, the study revealed.\n", "\n", "On April 7 -- the day global CO2 pollution dropped the most -- emissions from land transport accounted for more than 40 percent of the decrease, while industry, electricity generation, and aviation accounted for 25, 19 and 10 percent, respectively.\n", "\n", "Calculating global emissions of CO2 and methane -- another potent greenhouse gas -- usually takes months or longer, but methods used in the study could help guide decision-making, the authors said.\n", "\n", "\"If we can see the effect of a policy in the space of months as opposed to years then we can refine policies more quickly,\" said Peters.\n", "\n", "\n"]], "tags": ["Corinne Le Quere", "Global CO2 Emissions", "coronavirus", "european union", "Nature Climate Change", "carbon pollution"]},
{"heading": [["Extinction Watch: Eating a songbird into extinction"]], "sub_heading": [["The species is known as the “rice bird” in China, where it is hunted for food — a practice that has been illegal since 1997, but continues on the black market to this day.  This practice on migratory passerines in Asia has pushed not only the Yellow-breasted Bunting to the edge of extinction; but led to all migratory bunting species in eastern Asia declining."]], "time": [["Last Updated: May 04, 2020, 10.58 PM IST"]], "publisher": [["ET Bureau"]], "article": [["It used to be one of the most abundant songbirds with a breeding range of over 15 million km² stretching from ", "Scandinavia", " to the Pacific coast in ", "Siberia", " but has suffered a 95% decline in ", "population", " at its migration and wintering sites.\n", "\n", "The ", "species", " is known as the “rice bird” in ", "China", ", where it is hunted for food — a practice that has been illegal since 1997, but continues on the black market to this day.\n", "\n", "This practice on migratory passerines in ", "Asia", " has pushed not only the Yellow-breasted Bunting to the edge of extinction; but led to all migratory bunting species in eastern Asia declining.\n", "\n", "Until 2004, the International Union for the Conservation of ", "Nature", " considered the yellow-breasted bunting to be a species of least concern. Since 2004, it has been gradually upgraded to a status of Critically Endangered due to rapid drops in population sizes.\n", "\n", "The main reason for its decline: the species migrates in huge flocks, which are hunted in massive numbers. The species gathers in large numbers at night to roost, making the ", "birds", " easy to trap in high numbers.\n", "\n", "Birds are flushed then caught in mist-nets, to be sold for consumption as “sparrows\" or “rice birds”. Even though the actions have been restricted to a small area in southern China, it has become more widespread and popular due to increasing wealth, and hunters now travel long distances to find sufficient birds. Shifts in rice paddy irrigation practices have reduced the quality and quantity of wintering habitats, including the loss of water stubble, and the loss of reed-beds has reduced available roost sites.\n", "\n"]], "tags": ["songbird", "Scandinavia", "China", "Nature", "species", "Asia", "birds", "siberia", "population"]},
{"heading": [["Extinction Watch: Which species may vanish & why"]], "sub_heading": [["This incredibly metallic blue tarantula is found within a 39-square mile reserve forest in Andhra Pradesh. Its behaviour parallels that of many arboreal spiders. In the wild, it lives in holes of tall trees where it makes asymmetric funnel webs. Spiders of this genus may live communally when territory, i.e. the number of holes per tree, is limited. "]], "time": [["Last Updated: Apr 30, 2020, 11.14 PM IST"]], "publisher": [["Agencies"]], "article": [["Peacock Tarantula", " -- Scientific classification: Poecilotheria metallica \n", "\n", "This incredibly metallic blue tarantula is found within a 39-square mile reserve forest in ", "Andhra Pradesh", ". Its behaviour parallels that of many arboreal spiders. In the wild, it lives in holes of tall trees where it makes asymmetric funnel webs. ", "Spiders", " of this genus may live communally when territory, i.e. the number of holes per tree, is limited. \n", "\n", "The ", "species", " is skittish and will flee when light shines upon it, as it is a photosensitive species. It’s also called the Peacock Parachute spider because of its habit to jump when disturbed either to a neighbouring tree or, more often, just parachute down like a leaf to the ground. Females can live up to 12 years. As with all tarantulas, males have a much shorter lifespan, living only a fourth to a third as long as females.\n", "\n", "\n", "The primary prey consists of various fl ying insects. Under provocation, however, members of the species may bite. P. metallica’s bite is considered medically signifi cant, with venom that may cause intense pain, judging from the experience of keepers bitten by other spiders in the genus. The spider was originally discovered in central southern India, in the railway yard at town called Gooty and commonly known as the Gooty Tarantula. It was rediscovered after 102 years, in 2001 in the forest between Nandyal and Giddalur. \n", "\n", "P. metallica is classified as Critically Endangered by the ", "International Union for Conservation of Nature", " (IUCN) due to its occurrence in a single, small area in which habitat is rapidly degrading due to logging and fi rewood harvesting. Another threat identifi ed by IUCN assessors is specimen collection for the pet trade.\n", "\n", "\n", "en.wikipedia.org", "\n", "\n"]], "tags": ["en.wikipedia.org", "species", "times evoke", "Andhra Pradesh", "Extinction watch", "peacock tarantula", "Spiders", "International Union for Conservation of Nature"]},
{"heading": [["How do koalas drink? Not the way you might think"]], "sub_heading": [["A new study describes koala drinking behavior in the wild for the first time, finding that they lick water running down the smooth surface of tree trunks during rainfall - a phenomenon called \"stemflow\" - and do not rely merely on the water content of the leaves that make up their diet."]], "time": [["Last Updated: May 05, 2020, 08.49 AM IST"]], "publisher": [["Reuters"]], "article": [["WASHINGTON: Scientists have solved a lingering mystery about ", "koala", " behavior - how these tree-dwelling marsupials native to Australia consume enough water to live.\n", "\n", "A new study describes ", "koala drinking", " behavior in the wild for the first time, finding that they lick water running down the smooth surface of tree trunks during rainfall - a phenomenon called \"stemflow\" - and do not rely merely on the water content of the leaves that make up their diet.\n", "\n", "The findings, which the researchers said may be useful in koala conservation efforts, were based on 46 observations of ", "koalas", " in the wild from 2006 to 2019, mostly at ", "You Yangs Regional Park", " in Victoria state.\n", "\n", "\"I think the main message is that behavioral observations in the wild are very important to establish what is normal and what is unusual, and to truly understand what animals need. If we watch them carefully, they will tell us,\" said University of Sydney ethologist Valentina Mella, lead author of the research published this week in the journal ", "Ethology", ".\n", "\n", "Koalas, which are not bears despite a common misconception, spend most of their lives high up in eucalyptus trees. They rely on a diet of eucalyptus leaves, normally consuming around 1.1 to 1.8 pounds (500 to 800 grams) daily.\n", "\n", "The word Koala is thought to have meant \"no drink\" in one of the Australian Aboriginal languages. The question of their water consumption had long been puzzling.\n", "\n", "\"Koalas have been alleged to never drink free water in the wild, or to drink only occasionally. Drinking behavior has often been considered unusual and attributed to disease or to severe heat stress,\" Mella said.\n", "\n", "\"Koalas were thought to gain the majority of the water that they require from the moisture content in the leaves that they feed on and to drink water unintentionally in the wild by eating wet leaves after rain, or when dew is present on the leaf surface,\" Mella added.\n", "\n", "They sleep about 20 hours a day to conserve energy because their diet requires a lot of energy to digest.\n", "\n", "\"Koalas are nocturnal animals, so they are only active at night, and they are arboreal, which means that they live in trees and rely on them for food, shelter and, as we just discovered, also for drinking,\" Mella said.\n", "\n", "\"Koalas actually spend 98% of their lives in trees and the only time they are on the ground is when they are trying to find another tree with a more generous food supply or a mate.\" \n", "\n", "\n"]], "tags": ["koalas", "koala drinking", "koala", "You Yangs Regional Park", "Ethology"]},
{"heading": [["Extinction Watch: Just two in the wild"]], "sub_heading": [["It’s a flowering tree known for its sprays of long white, bell-shaped flowers. The tree gets its common name: Bois Dentelle or “Lace Wood” from the delicate patterns of the flowers."]], "time": [["Last Updated: May 12, 2020, 12.19 AM IST"]], "publisher": [["ET Bureau"]], "article": [["There is just one ", "Pennantia Baylisiana", " tree growing in the wild. And there are only two Bois ", "Dentelle", " or ", "Elaeocarpus", " Bojeri trees growing in Mauritius earning the ", "species", " a place on ‘The World’s 100 Most Threatened Species’ list. It is listed as critically endangered by ", "IUCN", ". It is a photoautotroph, meaning it can transform light to chemical energy.\n", "\n", "It’s a flowering tree known for its sprays of long white, bell-shaped flowers. The tree gets its common name: ", "Bois", " Dentelle or “Lace Wood” from the delicate patterns of the flowers.\n", "\n", "The two Bois Dentelle trees are found high in the cloud forest of the island of Mauritius on a hill called the Piton Grand Bassin. The tree has come so close to extinction, not because it is commercially viable, but because it isn’t. The tree’s environment is being overrun by more commercially attractive alien species such as Guava and a small evergreen shrub Litsea monopetala. \n", "\n", "The last two of these trees would also have disappeared forever, taking with them the secrets locked in their genetics, if it hadn’t been for intervention. The ", "government", " and NGOs are working together to save this species from extinction. Some of their offspring are being taken care of by the government of Mauritius in the hope of restoring the population.\n", "\n"]], "tags": ["Pennantia baylisiana", "Phototroph", "Government", "Elaeocarpus", "species", "dentelle", "iucn", "bois"]},
{"heading": [["Extinction Watch: This Lemur is marked for death"]], "sub_heading": [["The Aye-aye is endangered and on the IUCN red list due to hunting and habitat destruction caused largely by humans setting fi res, illegal logging, making charcoal, as well as agriculture and livestock expansion."]], "time": [["Last Updated: May 08, 2020, 12.30 AM IST"]], "publisher": [["ET Bureau"]], "article": [["Native to ", "Madagascar", ", this ", "lemur", " is the world’s largest nocturnal primate and has an unusual method of fi nding food: it taps on trees to fi nd grubs, then gnaws holes in the wood using its incisors to create a small hole in which it inserts its narrow middle fi nger to pull the grubs out.\n", "\n", "Like the woodpecker, it is capable of penetrating wood to extract the invertebrates within.\n", "\n", "The ", "Aye-aye", " is endangered and on the IUCN red list due to hunting and habitat destruction caused largely by humans setting fi res, illegal logging, making charcoal, as well as agriculture and livestock expansion.\n", "\n", "In Madagascar, each region close to the Aye-aye’s habitat has their own beliefs of this marvelous animal. One area believes that if their middle fi nger points at someone, they are marked for death.\n", "\n", "If one village sees the Aye-aye, they kill it and move the body to the closest village and then it gets passed along to each village until it reaches the sea. They believe that the appearance of the animal will bring death to one of the members of their village and prevent the village from existing into future generations. The genus Daubentonia was named after the ", "French", " naturalist Louis-Jean-Marie Daubenton by his student, Étienne Geoffroy Saint-Hilaire, in 1795.\n", "\n", "French naturalist Pierre Sonnerat was the fi rst to use the vernacular name “aye-aye” in 1782 when he described and illustrated the lemur, though it was also called the “long-fi ngered lemur”.\n", "\n"]], "tags": ["Lemur", "marie daubenton", "Extinction watch", "Madagascar", "Louis", "french"]},
{"heading": [["Canada zoo to send pandas home after bamboo shortage"]], "sub_heading": [["A Canadian zoo is shipping two pandas home to China after the coronavirus pandemic left it struggling to source the massive bamboo stockpiles needed to feed the giant creatures."]], "time": [["Last Updated: May 13, 2020, 02.33 PM IST"]], "publisher": [["AFP"]], "article": [["OTTAWA: A Canadian zoo is shipping two pandas home to China after the coronavirus ", "pandemic", " left it struggling to source the massive bamboo stockpiles needed to feed the giant creatures.\n", "\n", "Er Shun and her mate Da Mao have lived in the country since 2013 as part of a 10-year loan agreement with a breeding facility in Chengdu.\n", "\n", "The arrival of the cute and furry animals was a huge spectacle that was broadcast live on all major Canadian television networks.\n", "\n", "Er Shun later mothered two twin cubs -- the first pandas born on Canadian soil.\n", "\n", "But ", "Calgary Zoo", " said it was cutting short the pair's stay because the ", "Covid-19", " outbreak had disrupted transport links and made it harder to supply the 40 kilograms (90 pounds) of bamboo a typical adult panda eats each day.\n", "\n", "Staff had worked to find alternative bamboo providers but there were concerns that supplies could be disrupted without warning and leave the animals hungry, the zoo said in a statement.\n", "\n", "\"Knowing a second wave of COVID-19 is likely... the Calgary Zoo feels it's critical to move the beloved giant pandas back to China where there are abundant local sources of bamboo,\" the statement said.\n", "\n", "The zoo is currently closed due to the pandemic and said it would not be able to allow the public to bid farewell to the animals.\n", "\n", "Er Shun and Da Mao's cubs have already been relocated to China, according to national broadcaster CBC.\n", "\n", "\n"]], "tags": ["calgary zoo", "Canada zoo", "Bamboo shortage", "coronavirus", "pandemic"]},
{"heading": [["Turtles emerge from nest at Goa beach, CM posts video"]], "sub_heading": [["The state forest department has reserved certain areas at Morjim and Mandrem in North Goa district and Agonda and Galjibag in South Goa district as turtle nesting sites, in a bid to protect the sea animal from any human intervention."]], "time": [["Last Updated: May 13, 2020, 03.30 PM IST"]], "publisher": [["PTI"]], "article": [["PANAJI: Goa Chief Minister ", "Pramod Sawant", " on Wednesday posted a video clip of Olive Ridley turtle ", "hatchlings", " running on the state's Morjim beach after emerging from their nest.\n", "\n", "\n", "The state forest department has reserved certain areas at Morjim and Mandrem in North Goa district and Agonda and Galjibag in South Goa district as turtle nesting sites, in a bid to protect the sea animal from any human intervention.\n", "\n", "Sawant posted a video on Twitter of the Olive Ridley turtle hatchlings seen on the beach after sunset.\n", "\n", "\n", "1589306433000", "\n", "\n", "\"Amazing wonders of nature! Olive Ridley turtle hatchings emerging out form the last nest at Morjim. Along with Morjim, Mandrem, Agonda and Galgibag are important beaches in Goa which attracts turtle for nesting, he tweeted.\n", "\n", "Last week, Sawant tweeted about a ", "black panther", " spotted at ", "Netravali Wildlife Sanctuary", " in South Goa.\n", "\n"]], "tags": ["black panther", "Olive Ridley Sea turtle", "Netravali wildlife sanctuary", "Pramod Sawant", "hatchlings"]},
{"heading": [["China offers farmers cash to give up wildlife trade"]], "sub_heading": [["Farmers in China are being offered cash to quit breeding exotic animals as pressure grows to crack down on the illegal wildlife trade that has been blamed for the coronavirus outbreak."]], "time": [["Last Updated: May 19, 2020, 01.39 PM IST"]], "publisher": [["AFP"]], "article": [["BEIJING: Farmers in China are being offered cash to quit breeding exotic animals as pressure grows to crack down on the ", "illegal wildlife trade", " that has been blamed for the ", "coronavirus", " outbreak.\n", "\n", "Authorities have for the first time pledged to buy out breeders in an attempt to curb the practice, animal rights activists say.\n", "\n", "China has in recent months banned the sale of wild animals for food, citing the risk of diseases spreading to humans, but the trade remains legal for other purposes including research and ", "traditional medicine", ".\n", "\n", "The deadly coronavirus -- first reported in the central Chinese city of Wuhan -- is widely believed to have passed from bats to people before spreading worldwide.\n", "\n", "Two central provinces have outlined details of a buyout programme to help farmers transition to alternative livelihoods.\n", "\n", "Hunan on Friday set out a compensation scheme to persuade breeders to rear other livestock or produce tea and herbal medicines.\n", "\n", "Authorities are offering to pay 120 yuan ($16) per kilogram of cobra, king rattlesnake or rat snake, while a kilogram of bamboo rat will fetch 75 yuan.\n", "\n", "A civet cat -- the animal believed to have carried ", "Severe Acute Respiratory Syndrome", " (SARS) to humans in another coronavirus outbreak nearly two decades ago -- is worth 600 yuan.\n", "\n", "Neighbouring Jiangxi province has also released documents on plans to help farmers dispose of animals and financial aid.\n", "\n", "The state-run Jiangxi Daily newspaper reported last week that the province has more than 2,300 licensed breeders, mostly rearing wild animals for food.\n", "\n", "Their animals are worth about 1.6 billion yuan ($225 million), the report said.\n", "\n", "Both Jiangxi and Hunan border ", "Hubei", ", the province where the coronavirus first emerged in December.\n", "\n", "Animal rights group ", "Humane Society International", " (HSI) said Hunan and Jiangxi are \"major wildlife breeding provinces\", with Jiangxi seeing a rapid expansion of the trade over the last decade.\n", "\n", "Revenues from breeding reached 10 billion yuan in 2018, it said.\n", "\n", "HSI China policy specialist Peter Li told AFP that similar plans should be rolled out across the country.\n", "\n", "But he cautioned that Hunan's proposals leave room for farmers to continue breeding exotic creatures as long as the animals are not sent to food markets.\n", "\n", "The province's plan also does not include many wild animals bred for fur, traditional Chinese medicine or entertainment.\n", "\n", "Li said Chinese authorities are nevertheless moving in the right direction.\n", "\n", "\"In the past 20 years, a lot of people have been telling the Chinese government to buy out certain wildlife breeding operations, for example bear farming,\" he said.\n", "\n", "\"This is the first time that the Chinese government actually decided to do it, which opens a precedent... (for when) other production needs to be phased out.\"\n", "\n", "\n"]], "tags": ["illegal wildlife trade", "humane society international", "Traditional medicine", "coronavirus", "Hubei", "Severe Acute Respiratory Syndrome"]},
{"heading": [["Extinction Watch: Shiver me timbers"]], "sub_heading": [["The clanwilliam cedar is found throughout the Western Cape Province of South Africa, especially in the Cederberg Mountains. Young trees have conical crowns, and old trees have massive gnarled trunks and spreading branches. The bark is reddish grey, thin and fibrous, flaking in scale-like plates."]], "time": [["Last Updated: May 18, 2020, 11.28 PM IST"]], "publisher": [["ET Bureau"]], "article": [["The ", "IUCN", " has labelled this ", "tree", " as critically endangered because of its valuable rot-resistant timber. An extremely tall and majestic tree that can grow up to 82 feet in height, a tree will live for 1,000 years if left in peace.\n", "\n", "The clanwilliam cedar is found throughout the ", "Western Cape", " Province of South Africa, especially in the ", "Cederberg", " Mountains. Young trees have conical crowns, and old trees have massive gnarled trunks and spreading branches. The bark is reddish grey, thin and fibrous, flaking in scale-like plates.\n", "\n", "Besides being used for timber, the tree is also prone to being in areas that are prone to wildfires. Many of these fi res destroy the already existing trees and ruin those that have yet to even fully grow. In the 20th century, logging of this tree was banned but the trees have not been able to make a strong recovery due to fires.\n", "\n", "A ", "Cedar Reserve", " has been created to provide land that will allow the trees to thrive. The reserve also collects and plants seeds to encourage new growth. \n", "\n", "The genus ", "Widdringtonia", " was named after Edward Widdrington, a ", "Royal Navy", " captain and a conifer botanist. The wood is resinous and fragrant, and exceedingly durable. It works well, takes a fi ne polish and is borer-proof. It was also popular for shipbuilding, and makes splendid furniture. It was once sold by the wagonload for fence poles. A clear, hard gum yielded by the cones and branches was once used medicinally in the treatment of gout, rheumatism and oedematous swellings.\n", "\n"]], "tags": ["cedar reserve", "Widdringtonia wallichii", "Royal Navy", "Western Cape", "iucn", "Tree", "Cederberg", "Widdringtonia"]},
{"heading": [["Extinction Watch: Solitary in nature, very few in the wild"]], "sub_heading": [["This is a solitary species that is most often seen alone or in pairs, and rarely in parties of 4-5, which perhaps are family groups. It feeds characteristically by standing in fast flowing rivers. "]], "time": [["Last Updated: May 22, 2020, 12.01 AM IST"]], "publisher": [["ET Bureau"]], "article": [["\n", "\n", "The ", "White-bellied Heron", " is a very large brownish grey heron. It is the second-largest ", "heron", " in the world, with adults standing at well over a metre tall. \n", "\n", "Much of this height is due to their long neck. This species is part of the bird family ", "Arideidae", ", which includes herons, bitterns and egrets, and this family diverged from all other bird families 51.6 million years ago in the Paleogene Period! \n", "\n", "It has been listed as ", "Critically Endangered", " on the ", "IUCN Red List", " since 2007, because the global population is estimated at less than 250 mature individuals and it is threatened by disturbance and habitat degradation The white-bellied heron is found in the wetlands of ", "tropical", " and subtropical forests in the foothills of the eastern ", "Himalayas", " of India and Myanmar. \n", "\n", "This is a solitary species that is most often seen alone or in pairs, and rarely in parties of 4-5, which perhaps are family groups. It feeds characteristically by standing in fast flowing rivers. \n", "\n", "It also uses slow moving streams and grassy marshes. A white-bellied heron was spotted and rescued in southwest China’s Yunnan Province, in November 2019. Researchers installed a satellite tracking recorder on the its back and put on an ankle ring to monitor it and develop rescue measures.\n", "\n", "Refer: \n", "\n", "\n"]], "tags": ["Heron", "tropical", "himalayas", "wetland", "iucn", "IUCN Red List", "critically endangered", "arideidae"]},
{"heading": [["Rare snow leopards spotted near Kazakh city amid lockdown"]], "sub_heading": [[]], "time": [["Last Updated: May 25, 2020, 03.24 PM IST"]], "publisher": [["AFP"]], "article": [["ALMATY: ", "Several snow leopards", ", including a mother and her cub, have been spotted near the Kazakh city of Almaty wandering through a usually popular hiking destination that is now mostly off limits due to the ", "coronavirus", " lockdown.\n", "\n", "There are only around 150 snow leopards left in ", "Kazakhstan", ", out of a global population of less than 10,000 across Central and South Asia. Classified as vulnerable by the IUCN Red List of Threatened Species, the big cats are rarely seen in the wild, let alone within city limits.\n", "\n", "However, in the past few weeks at least three animals - a lone male and a female with a cub - were caught on film by a motion sensor-equipped ", "camera trap", " installed near the Big Almaty Lake by an NGO set up to protect the species.\n", "\n", "Zoologist Alexey Grachyov, who works with the ", "Snow Leopard", " Foundation, said that in the mountains near Almaty there are only around 20 of the animals left, making the sighting extremely rare.\n", "\n", "The snow leopard has grey or white fur with black spots and a bushy tail, and its population is distributed across a wide area including mountainous regions of Russia, Mongolia, China, Nepal, Pakistan and Afghanistan.\n", "\n", "A common misconception is that snow leopards live only at high altitudes, when in reality they live closer to humans than most people realise, Grachyov said.\n", "\n", "\"This is a unique population that has adapted to human presence. Every snow leopard probably sees humans, cars, sees the city every day, sees it encroach on its habitat.\"\n", "\n", "The foundation's long-term plan is to rebuild the snow leopard population by breeding and releasing them into the wild. \n", "\n"]], "tags": ["Snow Leopard", "coronavirus", "kazakhstan", "camera trap", "several snow leopards"]},
{"heading": [["Extinction Watch: Saving the Macaw, one headdress at a time"]], "sub_heading": [["​​Macaws are monogamous, remaining bonded for life. The species is listed on the IUCN Red List as critically endangered. Recent population and range estimates suggest that only about 350–400 individuals remain in the wild. This species is one of the rarest in the world. "]], "time": [["Last Updated: May 26, 2020, 12.17 AM IST"]], "publisher": [["ET Bureau"]], "article": [["\n", "\n", "The species is also known as the Caninde ", "macaw", " or Wagler’s macaw and is a macaw endemic to a small area of north-central ", "Bolivia", ", known as Los Llanos de Moxos. \n", "\n", "It is a large parrot and plumage on its upper parts and long tail is turquoise. Its under parts are bright yellow. Until 2010, it was hunted by natives to make feathered “Moxeño” headdresses for “machetero” ritual dances. \n", "\n", "The dancer dedicate their movements and attire to the colours of nature. Their headdresses are made of macaw tail feathers from four different species, including the Blue-throated Macaw.\n", "\n", " An educational campaign that began in 2010 promoted the use of artificial feathers which has made a big difference in saving the macaws. \n", "\n", "“Each ", "headdress", " is made of an average of 30 central tail feathers; that means that one headdress of artificial feathers saves at least 15 macaws,” explained Gustavo Sánchez Avila, Armonía’s Conservation Programme coordinator for the Bluethroated Macaw in Trinidad. \n", "\n", "Still, the species is listed on the IUCN ", "Red List", " as critically ", "endangered", ". Recent population and range estimates suggest that only about 350–400 individuals remain in the wild. This species is one of the rarest in the world. \n", "\n", "Macaws are monogamous, remaining bonded for life. While feeding, these birds drop seeds and play an important role in forest regeneration. \n", "\n", "\n", "\n", "\n"]], "tags": ["macaw", "iucn", "Bolivia", "Red List", "endangered", "headdress"]},
{"heading": [["15% cut in funds for tiger reserves across country"]], "sub_heading": [[]], "time": [["Last Updated: May 22, 2020, 03.52 AM IST"]], "publisher": [[", TNN"]], "article": [["DEHRADUN: In what might come as a double whammy for tiger reserves across the country this year, the ", "National Tiger Conservation Authority", " (", "NTCA", ") has decided to slash funds by 15% for each state, officials in the know said. \n", "\n", "\n", "Already, the prime tiger tourism season from March to June 15 has fallen flat due to the lockdown. Park officials are worried that conservation efforts would suffer amid alert issued by the Wildlife Crime Control Bureau (WCCB). \n", "\n", "In Uttarakhand, Corbett Tiger Reserve (CTR) earns about Rs 10.5 crore per annum and Rajaji Tiger Reserve (RTR) earns around Rs 54 lakh a year from tourism-related activities. Earnings have taken a dip because of the lockdown for the otherwise self-sustaining tiger reserves.\n", "\n", "Uttarakhand was sanctioned around Rs 25 crore in the previous year by the NTCA, according to officials. \n", "\n", "Directors of Corbett Tiger Reserve and Rajaji Tiger Reserve feel reduced funds will adversely affect infrastructure-related works in the reserves. \n", "\n", "With the monsoon season round the corner, important road construction work will suffer. Internal road connectivity inside reserves is essential during the rainy season for effective patrolling to check poaching and other anti-forest activities.\n", "\n", "A source in the forest department said NTCA itself didn't get its full share of funds and, hence, it has no other option but to further cut funds for the states. Incidentally, budget of NTCA has been reducing since the past four years. For 2016-17, its budget was Rs 348.74 crore; for 2017-18, it was Rs 345 crore; for 2018-19, it was Rs 323.44 crore. \n", "\n", "In 2019-20, it was just Rs 280.66 crore. For 20-21, it has already indicated that the fund would be curtailed further. In 2019-20, NTCA had approved Rs 17 crore for CTR.\n", "\n", "\n"]], "tags": ["NTCA", "tiger reserve fund cut", "india tiger reserve", "National Tiger Conservation Authority", "Tiger Reserve Fund"]},
{"heading": [["Extinction Watch: The true giants of the African bush"]], "sub_heading": [["Baobab trees are the true giants of the African bush. Their distinctive silhouettes loom over the acacia scrubland, with Medusa-like branches spreading chaotically above a bulbous body."]], "time": [["Last Updated: May 28, 2020, 11.57 PM IST"]], "publisher": [["ET Bureau"]], "article": [["A symbol of life on the ", "African plains", ", the ", "giant baobab", " belongs to the genus Adansonia, a group of trees consisting of nine different species.\n", "\n", "Of the nine species, six are native to ", "Madagascar", ", two are native to ", "mainland Africa", " and the Arabian Peninsula, and one is native to Australia. \n", "\n", "Baobab trees are the true giants of the African bush. Their distinctive silhouettes loom over the ", "acacia", " scrubland, with Medusa-like branches spreading chaotically above a bulbous body.\n", "\n", "It was introduced in ancient times to south Asia and during the colonial era to the Caribbean. The lifespan of the baobab is very long. There are many specimens over 1,000 years old. One in South Africa was dated at around 6,000 years old.\n", "\n", "Widely known as the Tree of Life, a single tree can hold up to 1,189 gallons of the precious liquid, while the hollow center of an old baobab also provides valuable shelter. ", "Bushmen", " used to rely on the trees as a source of water when the rains failed.\n", "\n", "The tree’s fruits are large pods known as ‘monkey bread’ or ‘cream of tartar fruit’ and are rich in vitamin C. It has a somewhat acidic fl avour, described as ‘somewhere between grapefruit, pear and vanilla’.\n", "\n", "The tree played a role in Antoine De Saint-Exupéry’s fictional children’s book, The Little Prince. There, baobabs are described as ", "dangerous plants", " which must be weeded out from the good plants, less they overcome a small planet and even break it to pieces.\n", "\n"]], "tags": ["giant baobab", "Bushmen", "mainland africa", "dangerous plants", "african plains", "Madagascar", "Acacia"]},
{"heading": [["Breeding centre for black tiger shrimps inaugurated in Andamans"]], "sub_heading": [["In a move to bolster shrimp production in the country, a breeding and domestication facility of black tiger shrimps was opened in South Andamans on Friday."]], "time": [["Last Updated: Mar 01, 2014, 04.21 AM IST"]], "publisher": [[", TNN"]], "article": [["PORT BLAIR: In a move to bolster shrimp production in the country, a breeding and domestication facility of ", "black tiger", " shrimps was opened in ", "South Andamans", " on Friday. ", " The centre was inaugurated by Union minister of commerce and industry Anand Sharma. Black tiger shrimps, a species indigenous to the country, had dominated the aquaculture industry for several years due to its faster growth and thereby providing large catch and high market price. But in 1995, a virus attack, which affected the crustaceans, resulted in huge loss to farmers and the industry. The project began as a pilot study in 2006 to create a species free from all the known pathogens that could affect shrimps. ", " \"The project (the Nucleus Breeding Centre of the Domestication of tiger shrimp) is an effort to preserve and promote our native black tiger shrimps. This effort will add to about one-fourth of the total fisheries export of about $4 billion per year,\" said Sharma at the facility in Kodighat, about 25km from Port Blair. The minister also launched a multi-species hatchery in Andamans and a multiplication centre for tiger shrimps in Kanyakumari through satellite link. ", " The centre will provide selectively-bred families of pathogen free shrimps for multiplication to the centre in Kanyakumari district, which would later be sold to hatcheries for production. Farmed aquaculture make up about 65% of export, the minister said. \"The project is the fifth programme to domesticate the tiger shrimps in the world. It began 2008-09 after the pilot study was a success. The market is now dominated by the American white tiger shrimp, which was promoted by a similar effort in US. But once our products reach the market, the tables will turn,\" said marine products export development authority chairperson Leena Nair. ", " The minister said the project was opened in Andaman because of its rich biodiversity and availability of wild shrimps in the seas surrounding the place. T K A Nair, advisor to the PM, was felicitated at the event for efforts to promote aquaculture in the country in the ‘80s. "]], "tags": ["Black Tiger", "South Andamans"]},
{"heading": [["Extinction Watch: Steller Sea Lions are known for disntinctive vocal airings"]], "sub_heading": [["Historically, Steller sea lions were plentiful throughout the coastal North Pacific Ocean. But their numbers started declining as they were hunted for their meat, hides, oil, and other products. Today sea lions are an important subsistence resource for Alaska Natives. "]], "time": [["Last Updated: Jun 01, 2020, 11.54 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Named after Georg Wilhelm Steller, the German naturalist on the Bering expedition who fi rst wrote about the ", "species", " in 1742, the Steller (or northern) ", "sea lion", " is the largest member of the family Otariidae, the “eared seals,” which includes all sea lions and fur seals. They share parts of their range with a smaller related species, ", "California", " sea lions.\n", "\n", "There are two distinct population segments, the eastern distinct population segment (DPS) is listed as threatened and the western DPS which is listed as endangered.\n", "\n", "Historically, ", "Steller sea", " lions were plentiful throughout the coastal North ", "Pacific Ocean", ". But their numbers started declining as they were hunted for their meat, hides, oil, and other products. Today sea lions are an important subsistence resource for ", "Alaska Natives", ". Predatory by nature they consume a wide range of prey, foraging and feeding primarily at night on over a hundred species of fish depending on the abundance and distribution of ", "prey", " species.\n", "\n", "Like most otariids, Steller sea lions are vocal in air. Mature male sea lions have a range of vocalisations as part of their territorial behaviours, including belches, growls, snorts, and hisses that serve as warnings to others.\n", "\n", "Steller sea lions are sometimes killed intentionally by fishermen, as they are seen as competitors and a threat to fi sh stocks. Killing sea lions is strictly prohibited in the US and Russia, but in Japan a fixed number are still removed annually, ostensibly to protect their fisheries. In Canada, ", "commercial hunting", " is prohibited, but limited hunting permits are occasionally granted.\n", "\n"]], "tags": ["sea lion", "Prey", "steller sea", "species", "alaska natives", "Pacific Ocean", "eared seals", "commercial hunting", "California"]},
{"heading": [["Migratory birds bring delight, but drop in numbers worrying"]], "sub_heading": [["Bird lovers in Marathwada are having a good time spotting several feathered friends at the water bodies in Marathwada, though there has been a drop in the Greater Flamingo numbers this year."]], "time": [["Last Updated: Mar 03, 2014, 07.26 AM IST"]], "publisher": [["TNN"]], "article": [["AURANGABAD: Bird lovers in Marathwada are having a good time spotting several feathered friends at the water bodies in Marathwada, though there has been a drop in the Greater Flamingo numbers this year.", " ", " The ", "Jayakwadi reservoir", ", ", "Tembapuri project", ", Dheku dam, Sukhana dam, Songthana medium project, Majalgaon dam, Ghanewadi project and ", "Vishnupuri project", " draw hundreds of migratory birds every year from across the globe.", " ", " Along with flamingos, other birds like the Grey-headed Canery Fly, Black Red Start, Rose Flinch, Comb Duck and Sterling have been spotted by nature enthusiasts.", " ", " \"The number of these migratory birds has reduced in the last few years. However, the visible presence of these birds despite the shrinking lake brings cheers to bird lovers. Rapid urbanization and encroachments into the lakes has led to severe degradation of the habitat,\" said bird lover Pankaj Shakkarwar.", " ", " The Salim Ali Lake, which used to witness about 20-25 birds about 20 years back, is now home to only 4-5 flamingos.", " ", " \"Marathwada, which was home to thousands of Greater Flamingos about five years back, is now attracting only about 500 of them. These pink feathered beauties are migratory birds that come from Siberia to Marathwada via the Rann of Kutch in Gujarat. But from the last few years, due to poor monsoon and shrinking lakes, the number of the flamingoes have reduced to almost half,\" said ornithologist Kishor Pathak.", " ", " Pathak said, \"Marathwada is home to one type of flamingos from a total of 6 recognized around the world - the Greater Flamingo. This species can be seen at various sites in Marathwada such as Jayakwadi reservoir, Tembapuri project, Dheku dam, Sukhana dam, Songthana medium project, Majalgaon dam, Ghanewadi project and Vishnupuri project during the migratory season.\"", " ", " \"Flamingos don't like urbanization and so they will soon stop coming here because of the developmental projects compromising on nature. Flamingos mostly thrive in mud flats which work to their advantage. It also keeps predators at bay. They generally roam in large groups and their most captivating moments are their synchronized flight,\" said Pathak.", " ", " Another bird lover Milind Girdhari said that there are larger concerns, \"Many farmers indulge in illegal extraction of water from lakes and reservoirs. They directly install motor pumps in the vicinity and add to the air pollution.\"", " ", " ", " ", " While on one side the population of the migratory flamingos is depleting but on other hand the region has a reason to cheer since it is been observed by the city ornothologists that about 30-40 Flamingos have made their homes in the region from last two years.", " ", " Pathak said that few have been spotted at Jayakwadi reservoir and some at Sukhana dam. \"Typically, the Flamingos used to (and still do) migrate to the Rann of Kutch in Gujrat every year for breeding and feeding. But since a few years, they have started to patronise a few spots in Marathwada as well", " ", " \"However, the visible presence of these birds despite the shrinking lake has brought cheers to bird lovers. It would add to the beauty of the site if they start breeding at these places,\" Girdhari.", " "]], "tags": ["Jayakwadi reservoir", "Vishnupuri project", "Tembapuri project"]},
{"heading": [["Centre forms National Board for Wildlife, flouts norms"]], "sub_heading": [["The Narendra Modi government has approved the National Board for Wildlife (NBWL), which according to experts has flouted the norms laid down in the Wildlife Protection Act."]], "time": [["Last Updated: Jul 26, 2014, 05.14 AM IST"]], "publisher": [[", TNN"]], "article": [["KOLKATA: The Narendra Modi government has approved the ", "National Board for Wildlife", " (", "NBWL", "), which according to experts has flouted the norms laid down in the Wildlife Protection Act. ", " While the Centre has inducted three members on the board—H S Singh, a retired forest officer of Gujarat cadre, ", "GEER", " foundation, run by the Gujarat government and Raman Sukumar, an elephant expert from Bangalore—the Wildlife Protection (Amendment) Act 2002 clearly states in its Section 5(A) that it must have five persons representing non-governmental organizations to be nominated by the Centre and ten individuals to be nominated by the central government from among eminent conservationists, ecologists and environmentalists. ", " But, the new board only has two individual members and there is no representation from the NGOs, since the Gujarat Ecological Education and Research (GEER) foundation is being run by the Gujarat government. ", " A former member of the standing committee of NBWL, who didn't want to be named, said that earlier there were transparency and checks and balances while clearing any development projects in and around the forest areas. \"But, this move will surely jeopardize the process of protecting forests in the country,\" he said. ", " It may be noted that several projects including, mining in Central Indian tiger habitat, dams in north-east and Uttarakhand and highway projects are waiting for clearances from the board. The tenure of the previous board lapsed in September, 2013. ", " The board, a statutory body under the Wildlife Protection Act, 1972, is supposed to oversee implementation of the wildlife policy. Though the notification issued on July 22 is yet to be out on public domain, TOI possesses a copy of it. While the prime minister is the chairperson of the board, the Union environment minister is the vice-chairperson of the board. The environment minister is also the chairperson of the standing committee of the NBWL. "]], "tags": ["National Board for Wildlife", "GEER", "NBWL"]},
{"heading": [["Two tigers travel miles to relocate"]], "sub_heading": [["The region’s tigers migrate great distances overcoming obstacles like canals and dangers like roads, rail lines, and open wells, mentions a latest report of the Wildlife Conservation Trust."]], "time": [["Last Updated: Sep 04, 2014, 06.10 AM IST"]], "publisher": [[", TNN"]], "article": [[" \t", " ", " \tThe report cited two instances wherein a tiger – christened as Prince – that was photographed as a cub in May 2010 was camera trapped in west Pench on March 26, 2014 during estimation exercise. This means it travelled about 80km to shift to a new habitat. Similarly Bajirao – a tiger from Kalmeshwar travelled about 20 km – to relocate to Bor. ", " \tThese two instances underscore the need for preserving corridors to maintain genetic connectivity of increasingly fragmented tiger population. ", " "]], "tags": []},
{"heading": [["HudHud birds perish in killer cyclone 'HudHud'"]], "sub_heading": [["In the killer cyclone 'HudHud' that devastated Visakhapatnam, the irony is that a large number of 'HudHud' birds have also perished. For ornithologists, bird watchers and wildlife lovers, this has become a cause of concern."]], "time": [["Last Updated: Oct 16, 2014, 03.33 PM IST"]], "publisher": [[", TNN"]], "article": [["HudHud", " ", " ", "Andhra Pradesh", " ", " ", " ", " ", " ", "WWF", " ", " ", " "]], "tags": ["WWF", "Andhra Pradesh", "Hudhud", "HudHud birds"]},
{"heading": [["Dolphin chokes to death on plastic off Gujarat coast"]], "sub_heading": [["The pollution in the sea is taking a heavy toll on the marine life along the coast.Latest in the series of tragedies is death of the 14-foot-long dolphin that choked to death after swallowing plastic."]], "time": [["Last Updated: Mar 05, 2014, 02.52 AM IST"]], "publisher": [[", TNN"]], "article": [["AHMEDABAD: The pollution in the sea is taking a heavy toll on the marine life along the coast. Latest in the series of tragedies is death of the 14-foot-long dolphin that choked to death after swallowing plastic.", " ", " Prakruti Nature Club's Jignesh Gohil, who was present in the rescue attempt, said, \"During the postmortem we found that the dolphin, which was about 20 years old, had died because of chocking. In autopsy, we found four thick plastic bags.", " ", " The dolphin was 14.4 feet in size and was about one ton in weight. It was found dead along the Sutrapada coast. Senior officials said this was the first incident where plastic bags were recovered from the stomach of a dolphin. In the past there have been incidents where dolphins or dugongs were found dead on the ", "Gujarat coast", ", but in no plastic was found inside the bodies.", " ", " The official said that the presence of plastic in the stomach was an indication of the increasing level of pollution along the coast. Recently a dolphin in the ", "Narmada estuary", " was spotted which according to the fishermen was nothing new. The fishermen in south Gujarat and Saurashtra and mostly in Kutch have reported the presence of this aquatic mammal.", " ", " The population of this large marine mammal is touted to be rising in Gujarat, but there is no specialized force to guide them to freedom in such exigencies, a forest department official said.", " ", " Dolphins in Gujarat are frequently spotted in Gulf of Kutch, off Jamanagar coast, and their numbers is growing, he added. It is estimated that Gujarat is home to around 50 to 100 dolphins, though no official census has been conducted so far.", " "]], "tags": ["Gujarat coast", "Narmada estuary", "Dolphin chokes to death"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["Sarita petitioner", "13 death", "Maharashtra", "tigress Avni", "cold blood", "archaic", "wildlife laws"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["near extint", "world sparrow", "Bird", "Sparrow", "bird lover", "toi"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["Whales", "science", "mammals", "evolution", "biology"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["Karnataka govt", "man eating tiger", "Tiger", "Flouts several norms", "bandipur"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["mumbai", "mumbai city", "Navi Mumbai", "Falmingo birds", "lockdown", "Flamimgo"]},
{"heading": [["“Concept of compensatory afforestation is seriously flawed”"]], "sub_heading": [[]], "time": [["Last Updated: Jul 04, 2018, 04.17 PM IST"]], "publisher": [[", TNN"]], "article": [["Linnean Medal", "Charles Darwin", "Linnean Society of London", "Kamlajit Bawa", "Ashoka", "ATREE", "\n", "\n", " \n", "\n", "\n", "\n", "Certainly, biodiversity knowledge about India is much better today. Furthermore we have far better conceptual, analytical, and digital tools now. However, the foundations of information—that is, the cataloguing of species and ecosystems—have weakened in recent decades. Starting in the 1980s, investments in biodiversity science in Indian universities began to decline and shift towards molecular and cell biology and biotechnology. As a result, there are proportionately fewer centers of biodiversity research in the country.\n", "\n", "\n", "\n", "\n", "\n", "We have moved away from a strictly protectionist approach to participatory approaches at least on paper. A major shift occurred in 1970s with the initiation of ", "joint forest management", " that was intended to provide incentives to local communities for protecting natural forests. Another was the enactment of the Forest Right’s Act of 2006 that gave millions of forest dwellers rights to the land they cultivated and a role in management. However, implementation has been plagued with problems. In many cases “joint management” and “forest rights” are enshrined on paper rather than in practice.\n", "\n", "\n", "\n", "\n", "Growing human populations and infrastructure development are the major drivers of land use change. It is not only forest loss but also forest degradation that is worrisome. We have forests that are “empty”, that is without animals, or forests that consist of the “living dead”, as there is no regeneration in the understory. Our focus on forests also distracts us from the loss of biodiversity in other natural habitats such as grasslands, deserts, marshes, mangroves, rivers and other water bodies, and marine habitats. Climate change will only exacerbate this situation.\n", "\n", "We have this notion that we can destroy forests at one place and then recreate these forests somewhere else, as exemplified by the government’s compensatory afforestation program. Regardless of the poor record of afforestation in India, the concept is seriously flawed. Natural forests or other ecosystems are products of thousands, if not millions, of years of evolution, shaped by the biophysical features of specific places. One can restore degraded ecosystems at a particular place but not [c]reate such ecosystems de novo at another place.\n", "\n", "We also do not recognize that most of our natural ecosystems now occur as “islands”, small and large. Although the concept that “islands” lose species even without disturbance is more than 50 years old, it is not fully appreciated by forest managers. Smaller “islands”—less than 1000 sq-km—will lose species at a higher rate than larger “islands.” Many of our conservation areas are really very small “islands,” and unless intensively managed, will lose species due to natural cycles of immigration and local extinctions.\n", "\n", "\n", "\n", "There is no question that if we cannot protect flagship species such as tigers, elephants and lions, we perhaps cannot conserve other species. The preoccupation with flagship species is that other components of biodiversity and habitats where such species do not occur—which is the majority of natural habitats—have been ignored and overlooked. We do not seem to appreciate that a functioning ecosystem is more than simply a place where large animals exist. \n", "\n", "\n", "\n", "\n", "First and foremost, we need to improve governance of natural resources. Second, we have to reconsider our pathways to development, which sadly do not take into account the value of our ecosystems in sustaining our well-being in the long run. Third, we need to generate sufficient knowledge about the richness of life in India … and use the knowledge to guide our policies. We must remain optimistic that we will change our course and turn the corner. We need to save biodiversity to save ourselves.\n", "\n"]], "tags": ["Charles Darwin", "ATREE", "Ashoka", "Joint Forest Management", "Linnean Society of London", "kamlajit bawa", "linnean medal"]},
{"heading": [["Parliament panel asks govt to revisit tree cutting policies"]], "sub_heading": [[]], "time": [["Last Updated: Aug 08, 2018, 07.42 AM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: Emphasising strict and time-bound action to deal with the growing menace of ", "air pollution", " in Delhi, a ", "parliamentary panel", " on Tuesday asked the government to further step up its efforts to deal with the crisis and suggested revisiting policies where it allows cutting down of trees for development works in the capital. Insisting that “worst situations demand stringent solutions”, it also asked the Centre to take strict measures to phase out the “polluting vehicles at the earliest”.\n", "\n", "In the backdrop of recent protests of Delhiites over the move to cut down trees due to redevelopment of several government housing colonies, the panel recommended that the project proponents of these development projects should be requested to submit revised proposals with minimal requirement of tree felling.\n", "\n", " \n", " \n", "The parliamentary standing committee on environment and forests said efforts should be directed at minimum felling of trees at the planning stage itself whenever any development or re-development project comes up in future.\n", "\n", "The committee’s report has referred to several other instances where the government has allowed felling of trees for redevelopment of Pragati Maidan Complex and for Integrated Transit Corridor Development Plan along Mathura Road among others.\n", "\n", "The report, tabled in the both Houses of Parliament on Tuesday, also took note of vehicular emission, landfill sites, construction activities, crop residue burning, road dust and fire crackers and asked the government for coordinated action.\n", "\n", "Referring to the issue of municipal waste, the report said, “The Committee is unhappy to note the existing capacity of the government of NCT of Delhi to treat the municipal solid waste scientifically is just about 54% of the total requirement, leaving a gap of 46% to be bridged.”\n", "\n", "Stating that the apathy of the civic bodies entrusted with the task of management of municipal solid waste is totally unwarranted, it said, “The laissez-faire of the civic bodies of Delhi also gets reflected in the fact that the height of Ghazipur landfill site has reached as high as 65 metres which is just 8 metres less than the height of the national monument Qutub Minar.”\n", "\n", "On the issue of burning of crop residue which severely impacts air quality in the capital during post-harvest period in October-November, the Committee expressed its strong reservations towards the failure of the state governments in Haryana, Punjab and Uttar Pradesh in implementing the statutory ban on stubble burning in letter and spirit.\n", "\n", "“The Committee is of the opinion that weak enforcement of the statutory ban (on crop burning) by these state governments coupled with laxity towards the sensitivity and gravity of the matter has also adversely affected the ongoing efforts to tackle the issue of air pollution in Delhi and NCR,” said the report.\n", "\n", "On the issue of vehicular pollution, the committee recommended that the ministry of environment in consultation with ministry of road, transport and highways along with the ministry of heavy industries and public enterprises should “chalk out a mechanism for phasing out of the polluting vehicles at the earliest.”\n", " \n", "\n", "\n"]], "tags": ["delhi tree felling", "Parliamentary panel", "Air Pollution", "Delhi tree cutting", "Delhi pollution"]},
{"heading": [["Most landslides in Manipur caused by anthropogenic factors: Environment ministry"]], "sub_heading": [[]], "time": [["Last Updated: Aug 12, 2018, 12.40 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Every year, during ", "monsoon", ", landslides claim a number of lives and cause huge damage to property across the country, especially in the hilly region, and this time it was no different.\n", "\n", "Recently, landslides in rain-battered Kerala left a trail of destruction, while in Manipur, a massive landslip killed nine people last month. The northeastern state has witnessed six major landslides since May.\n", "\n", "The hill state of Himanchal Pradesh was also hit and in Uttarakhand, a number of pilgrims during the Kailash Mansarovar and the Kanwar yatras were left stranded due to landslides.\n", "\n", "Specifically for Manipur, the environment ministry has indicated that most landslides in the state were \"anthropogenically\" induced and were caused due to a host of reasons, including modification of slopes for construction and widening of roads.\n", "\n", "Experts stressed that there was an urgent need to clearly classify high-landslide prone regions and to update the reviews every decade.\n", "\n", "Manipur witnessed six massive landslides in 2018, three in 2017, one in 2015 and four in 2010, according to the data provided by the ministry for the state.\n", "\n", "Triggered by heavy rains, a massive landslide claimed nine lives in Manipur's ", "Tamenglong district", " on July 11.\n", "\n", "\"Landslides in environmentally sensitive hilly areas of Manipur occur frequently during monsoon in the state.\n", "\n", "\"Studies have indicated that landslides in Manipur are mostly anthropogenically induced, caused as a result of modification of slopes for construction, widening of road, quarrying for the construction materials, fragile ", "lithology", ", complex geological structures and heavy rainfall,\" minister of state for environment Mahesh Sharma said in the Rajya Sabha on August 6.\n", "\n", "The weathered sedimentary (shale) rocks of Disang formation and thick loose overburden deposits on valley dipping slopes are most vulnerable for landslides in Manipur, he said in a written reply.\n", "\n", "The six massive landslides in Manipur this year occurred in Tamenglong in July, on NH-102 in East Imphal, NH 37 in Noney district, NH-102A in Ukhrul district and NH-37 in Noney district in June and on NH-37 near Makru bridge in Tamenglong district in May, according to the ministry's data.\n", "\n", "Experts also stressed on the need to understand that ", "deforestation", ", blasting, tunnelling and encroachments on drainage systems among others increase the potential for landslides.\n", "\n", "In his reply, Sharma had also said that the government promotes and supports research studies relating to landslides with remote sensing and ", "Geographic Information System", " (GIS)-based mapping for proper management of landslide-sensitive zones.\n", "\n", "He pointed out that GSI was actively engaged in carrying out landslide inventory mapping, national landslide susceptibility mapping (NLSM) on a 1:50,000 scale and 1:5,000 scale, and site specific study of a landslide, including monitoring, to minimize environmental degradation.\n", "\n", "\"These landslide studies are carried out as per the laid-down framework of Standard Operating Procedures (SOPs) for Landslide Disaster Management Plan of the GSI,\" he said.\n", "\n", "In addition, the National Disaster Management Authority (NDMA) under the home ministry has conceptualised an umbrella pilot scheme- Landslide Risk Mitigation Scheme(LRMS)- to demonstrate benefits of landslide mitigation measures under a centre-sponsored scheme for providing financial support to states, including Manipur, for disaster preparedness and mitigation, the minister said.\n", "\n", "Talking to PTI, an expert in this field pointed out that there is a need to realise that the entire Himalayan region and some hilly areas in the Western Ghats and elsewhere are inherently landslide prone.\n", "\n", "\"We need to clearly classify such highly landslide regions and also update the reviews, say every decade or so. Secondly, we should understand what increases the landslide potential.\n", "\n", "\"Deforestation, blasting, tunnelling, encroachments on drainage systems, including rivers and streams, on the hill slides, etc definitely increase the landslide potential,\" Himanshu Thakkar of the South Asia Network on Dams, Rivers and People (SANDRP), said.\n", "\n", "The impact should be assessed whenever any major interventions, in terms of roads, dams, hydropower projects, tunnels, blasting, deforestation, mining, are made in the landslide prone areas, he said.\n", "\n", "Such impact assessments would then have management plans to deal with such increased potential for landslides, he said, adding, \"it can then include some cases where you abandon the proposed project.\"\n", "\n", "\"Or in others, like in case of Uttarakhand, where the state disaster mitigation and management centre recommended in 2012 (before the June 2013 Uttarakhand floods) that no blasting should be allowed in Uttarakhand for any development activity.\n", "\n", "\"Lastly, we also need to understand that landslides are also associated with other disasters like floods, flash floods, earthquakes, among others,\" he said.\n", "\n", "The assessment then should include the possibility of multiple disasters associated with landslips, Thakkar added.\n", "\n"]], "tags": ["Tamenglong district", "monsoon", "Lithology", "Geographic Information System", "Deforestation"]},
{"heading": [["IIT Kharagpur to set up Re-Water Research Center"]], "sub_heading": [[]], "time": [["Last Updated: Aug 18, 2018, 02.50 PM IST"]], "publisher": [["PTI"]], "article": [["KOLKATA: The ", "IIT Kharagpur", " will set up a ", "Re-Water Research Center", ", seed-funded by two alumni members to replenish and ", "rejuvenate water resources", ", a statement issued by the institute said today.\n", "\n", "The move is to tackle the challenge of resolving two burning issues faced by urban India ", "sewage disposal", " and ", "access to clean potable water", ", it said on the 68th Foundation Day of the premier institution.\n", "\n", "\"The scarcity of water for drinking and domestic use is becoming acute and will only worsen in the coming years. On the other hand, urban areas are witnessing massive sewage problems. The idea of linking these two crises and coming up with one viable solution is challenging,\" one of the alumni members Aneesh Reddy said.\n", "\n", "The 'Aditya Choubey Center for Re-Water Research' would be networking with government bodies to take up this technology and the process and meet the water challenge in various cities, Reddy said.\n", "\n", "The institute is setting up an on-campus plant which will convert 1.35 million litre of sewage water from the hostels to 1.2 million litre of potable water, on a daily basis.\n", "\n", "The pilot plant is expected to be ready by March 2019.\n", "\n", "\"We will conduct quality assurance tests demonstrating the suitability of the technology for treatment of sewage and the suitability of the treated water for consumption and infuse confidence among all agencies and the public at large related to water supply, treatment,\" faculty at the Department of Civil Engineering Prof M M Ghangrekar, who will be heading this project, said.\n", "\n", "The researchers would also be developing an operationally viable technology so that the plant can be profitably commercialised.\n", "\n", "\"The project is being developed to attract potential entrepreneurs and government agencies to take up sewage treatment at a large scale and with a business model for banks to gain confidence in funding such businesses,\" said another alumni Anant Choubey.\n", "\n", "Director, IIT KGP, Prof P P Chakrabarti said that similar models of water sustainability have been adopted in foreign countries.\n", "\n", "\"We are looking forward to participatory models in villages to implement this technology. We would also engage international water experts and professionals from the industry as researchers and advisors in this center. Aneesh and Anant will be advisers as well,\" Chakrabarti said. \n", "\n", "\n"]], "tags": ["access to clean potable water", "sewage disposal", "IIT Kharagpur", "rejuvenate water resources"]},
{"heading": [["Developed countries seem to be shedding their responsibilities in pre-2020 period and delaying climate action, says India ahead of crucial UN climate talks"]], "sub_heading": [[]], "time": [["Last Updated: Nov 20, 2018, 10.11 PM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: With countries gearing up to take part in one of the most complex UN climate conferences post-Paris deal, India on Tuesday made its view against historical polluters (rich nations) quite clear and reminded them of their responsibilities towards taking quick climate actions. \n", "\n", "\n", "“The developed countries seem to be shedding their responsibilities in pre-2020 period and delaying climate action, which is neither in accordance with the agreed principles of the UNFCCC nor the latest scientific findings (of the IPCC) on climate change,” said India’s environment minister Harsh Vardhan.\n", "\n", "He also made a case for developed countries to fulfil their pre-2020 commitments even in the post-2020 period.\n", "\n", "The IPCC had last month made a strong pitch for countries to make efforts to align their ", "Paris Agreement", " pledges (emission cuts, adaptation measures and support mechanism) with the 1.5-degree Celsius goal, unlike the existing target to limit the global average temperature rise within 2-degree Celsius by 2100.\n", "\n", "The scientific findings of the IPCC had clearly shown how half a degree of warming makes a big difference, adversely impacting global population and overall ecosystem through intense heat waves, ", "sea level rise", ", melting of Arctic, erratic rainfall, reduction of farm yield and extinction of living species.\n", "\n", "In the backdrop of such findings and the developed countries unfulfilled promises of their pre-2020 actions, the minister said, “This would not only put additional mitigation burden on developing countries in the post-2020 period but will also increase the overall costs and present greater economic challenges for us to make a transition to a low carbon growth pathway.”\n", "\n", "Harsh Vardhan was addressing a ministerial meet of BASIC nations - ", "Brazil", ", ", "South Africa", ", India and China - here. The meeting assumes significance in view of the upcoming UN climate conference (COP24) at ", "Katowice", ", Poland from December 2 to 14 as a joint stand of these key four players along with other developing countries will play an important role in framing rules and guidelines for implementation of the Paris Agreement.\n", "\n", "Under ", "Kyoto Protocol", " of the UN Convention, only rich nations (historical polluters due to their early industrialisation) are expected to cut their emissions and take other climate actions by 2020. But under the Paris Agreement (which is meant for post-2020 actions), the responsibility to cut emissions falls on all countries as per their voluntarily set targets\n", "\n", "Appealing to all developing countries to prioritise pre-2020 agenda at upcoming COP24 as it would help build trust among nations and strengthen their faith in the multilateral process, Vardhan said, “Developed countries should be encouraged to fulfil their pre-2020 commitments even in the post 2020 period and this will form a strong foundation for post 2020 action.”\n", "\n", "Other BASIC partners too sought actions from rich nations, underlining in their joint statement that the enhanced pre-2020 actions (of developed countries) are the foundation for post-2020 actions (under the 2015 Paris Agreement where all countries are expected to act). \n", "\n", "They underlined that the implementation gaps in pre-2020 actions should not put an additional burden on developing countries in the post-2020 period and urged rich nations to “close the pre-2020 implementation gaps by 2023 which can be a useful input for the first global stock-take”.\n", "\n", "Referring to the developed countries’ lacklustre approach towards their commitments on climate finance (to support developing countries), Vardhan said, “Developed countries are far from realising their climate finance commitment of mobilising $100 billion per year by 2020. They should not only make urgent efforts to honour this commitment but also progressively and substantially scale up their financial support in the post-2020 period.”\n", "\n", "Stating that the finance is one of the critical enablers of climate actions in developing countries along with technology development and transfer and capacity-building support, the minister said, “Any regression or slow progress on these will hamper the progress of developing countries towards achieving higher ambition in their actions.\n", "\n", "“We find that there is a considerable difference in what is communicated as climate finance by different countries. ", "Public finance", " in the form of grants and concessional finance is required for climate actions.”\n", "\n", "\n"]], "tags": ["brazil", "Carbon dioxide equivalent", "Paris agreement", "public finance", "Katowice", "Kyoto Protocol", "south africa", "sea level rise"]},
{"heading": [["Climate meet: India and its BASIC partners strongly oppose rich nations’ attempt to backslide on Paris Agreement"]], "sub_heading": [[]], "time": [["Last Updated: Dec 13, 2018, 07.55 AM IST"]], "publisher": [[", TNN"]], "article": [["KATOWICE: Amid rich nations' attempt to dilute line between developed and developing countries while framing rule-book for implementing the Paris Agreement, India along with its BASIC partners – ", "Brazil", ", South Africa and China – on Wednesday strongly opposed to any such move and made it clear that there should not be any backsliding on the global deal which was reached in French capital exactly three years ago on this day.\n", "\n", " \n", "Breaking silence on the issue, all the four countries jointly expressed that they were willing to show \"certain flexibility\" to arrive at positive outcome of the ongoing UN climate change conference (COP24), but it won’t happen at the cost of the Paris Agreement. The negotiations at COP24 are meant for framing a rule-book for implementation of the Paris Agreement post-2020.\n", "\n", "“We are in a complete agreement that there should be no backsliding on the Paris Agreement,” said Derek Hanekom, South African minister and head of the country’s delegation, while referring to what the group stand for here at COP24.\n", "\n", "Hours later while making India’s country statement, additional secretary in environment ministry and head of delegation, A K Mehta, clearly spelt out what they want and what were their red lines which must not be breached at any cost.\n", "\n", "“We all agree that the Paris Agreement is non-negotiable. Therefore, the delicate balance reached between developed and developing countries must be retained, and the principles such as equity and Common but Differentiated Responsibility and Respective Capabilities (CBDR-RC) must be given its due,” said Mehta while delivering the country’s statement on behalf of India’s environment minister Harsh Vardhan.\n", "\n", "He said, “The outcome at ", "Katowice", " should be inclusive, consensus based and an integrated package including all the components of Paris Agreement Work Programme to reflect the global consensus reached three years ago on this very day while adopting Paris Agreement. Most importantly, we must stand with the poor, marginalized and vulnerable communities who would be most impacted by climate change to show that we are.”\n", "\n", "During the joint BASIC press conference, the South African minister referred to instances where certain comments from rich nations’ negotiators were made, raising an alarm bell on how the developed countries were trying to dilute the CBDR. \n", "\n", "Though none of the delegation leaders took name of any country during the press conference, the reference was obviously towards the US-led rich block. It is learnt that the attempts to dilute differentiation – the point which keeps developed and developing countries separately in terms of their responsibility towards climate actions and financial commitments – are being made by the US, Japan and ", "Australia", " with EU being a silent supporter of the rich block on this front in the negotiation room.\n", "\n", "Negotiators in many developing countries believe that such an attempt of the rich block may not be good for the outcome of the COP24 if the developed countries continue to push for dilution in the CBDR.\n", "\n", "Besides, the existing disagreements among developed and developing countries on key issues, primarily finance and reporting on countries' climate action and support, have also emerged as stumbling block. The BASIC nations are, however, hopeful as they believe that some of these concerns would be addressed in the draft text of the COP24 outcome (on rule-book of the Paris Agreement).\n", "\n", "The Chinese head of delegation, Xie Zhenhua said that they (BASIC countries) would like to show flexibility to arrive at positive outcome of the COP24. He said some progress had been made on contentious issue of finance, but they would be able to take a call on their joint stand after assessing the draft text.\n", "\n", "Slow progress of negotiation amid certain contentious issues was flagged by even the UN secretary-general Antonio Guterres here on Wednesday.\n", "\n", "Raising his concerns, he said, \"Failing here in Katowice would send a disastrous message to those who stand ready to shift to a green economy. So, I urge you to find common ground that will allow us to show the world that we are listening, that we care.” \n", "\n", "Expecting political will from leaders to make COP24 a success, Guterres while speaking at closing of the high-level segment of the Talanoa Dialogue said, “The Katowice package needs to deliver the Paris Agreement Work Program (rule-book), progress on finance and a strong and solid basis for the revision of National Determined Contributions (NDCs) under the Talanoa Dialogue.”\n", "\n", "Talanoa Dialogue, conceived by Fijian presidency of the COP23 last year at Bonn, is aimed to help countries take stock of their current climate actions, and decide how to raise their ambition for the next set of national climate pledges in 2020 to further cut down global emissions. \n", "\n", "The contentious Article of the Paris Agreement on climate finance (Article 9) deals with issue of extending financial support by rich nations to developing countries for assisting them in both their mitigation (emission cut) and adaptation actions. This has, however, become the most controversial element of rule-book discussions as the rich nations have been consistently opposing an ex-ante review of their financial commitments. Besides, there is not even a consensus on what ‘finance’ (public, private or aid) should mean.\n", "\n", "Enhanced transparency framework (ETF) for action and support (Article 13) is the other key matter of disagreement. Under this, all countries are required to report on their climate actions and also on the support they get. It has become a major red line for developing countries as their rich counterparts do not willing to provide flexibility (less stringent reporting requirements).\n", "\n", "Developing countries need enough flexibility as all of them do not have capacity to measure their emission, climate actions and even climate change impacts.While the US and ", "European Union", " (28 nations) have pushed for selective flexibility meant only for least developed countries and island states, India and China are demanding flexibility for all developing countries.\n", "\n", "This concern was also discussed in the BASIC ministerial meeting here on Wednesday where all the four countries expressed the need to have flexibility in reporting exercise, arguing varying capability of developing countries on this front.\n", "\n"]], "tags": ["brazil", "Katowice", "economy of china", "european union", "Economy of Japan", "australia"]},
{"heading": [["India on track to meet all its climate action targets, says Union minister Harsh Vardhan"]], "sub_heading": [[]], "time": [["Last Updated: Feb 12, 2019, 08.40 PM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: “India is well on track to achieve its pre-2020 climate goal and the country will also meet its target of installing 175GW of ", "renewable energy", " by 2022,” said Union environment minister Harsh Vardhan on Tuesday while releasing his ministry’s brief overview on various initiatives taken towards combating and adapting to climate change. \n", "\n", "\n", "Compiled as a coffee table book (India - Spearheading Climate Solutions), the ministry’s overview of its climate actions features the government’s flagship schemes - ‘UJALA’ for LED lights distribution and ‘UJJWALA’ for distributing clean cooking stoves to women below poverty line - and the country’s leadership role in setting up International Solar Alliance (ISA).\n", "\n", "Besides flagging the country’s current renewable energy push and several other measures under various missions, the minister also referred to India’s second Biennial Update Report (BUR-II) on national ", "greenhouse gas", " (GHG) inventory while expressing his confidence on achieving climate targets by India.\n", "\n", "The BUR-II, submitted to the UN body on climate change in December last year, shows that the country has already reduced its emission intensity by 21% between 2005-2014 and it would certainly meet both its Copenhagen and Paris commitments to reduce emission intensity of its GDP (emission per unit of GDP) by 2020 and 2030, respectively.\n", "\n", "Though India’s total GHG emissions have increased from 2.136 billion tonnes of CO2 equivalent of the GHG in 2010 to 2.607 billion tonnes of CO2 equivalent of GHG in 2014, the growth trajectory shown in the BUR-II clearly put the country on track to meet its global climate pledges.\n", "\n", "Under its Copenhagen commitments, India made a voluntary pledge in 2010 to reduce the emission intensity of its GDP by 20-25% from 2005 levels by 2020 (excluding emissions from agriculture). Later in 2015, the country submitted its Nationally Determined Contributions (NDC) under the ", "Paris Agreement", ", committing to reduce emission intensity of its GDP by 33-35% from 2005 levels by 2030.\n", "\n", "India under its Paris pledges also committed to achieve 40% cumulative electric power installed capacity from non-fossil fuel based energy resources by 2030. The BUR-II shows that the country’s share of non-fossil fuel electricity generation had already reached 35.5% in June, 2018. \n", "\n", "It noted that the share of non-fossil sources increased by over 5% in merely last three years (from 30.5% in March, 2015 to 35.5% in June last year) - a clear signal of India’s pace towards solar, wind and ", "biofuel", ".\n", "\n"]], "tags": ["renewable energy", "Paris agreement", "biofuel", "sunshine countries", "greenhouse gas"]},
{"heading": [["BASIC nations urge developed countries to fulfill their climate finance commitments"]], "sub_heading": [[]], "time": [["Last Updated: Aug 17, 2019, 10.06 PM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: With issue of finance being considered a major sticking point in negotiations ahead of future climate summit, the BASIC nations - ", "Brazil", ", South Africa, India and China - on Saturday jointly urged developed countries to fulfill their climate finance commitments of mobilizing $100 billion annually by 2020 for developing countries on a grant basis and in a transparent manner.\n", "\n", "\n", "“This support should be new and additional, and over and above their 0.7% of Gross National Product (GNP) commitment with respect to ", "Official Development Assistance", " (ODA),” said a joint statement of the BASIC nations after their ministerial meeting on climate change at Sao Paulo, Brazil.\n", "\n", "Under the ", "Green Climate Fund", " (GCF) mechanism, the developed countries are expected to jointly mobilize $100 billion per year by 2020, from a variety of sources, to address the mitigation and adaptation needs of developing countries.\n", "\n", "Keeping in view low contributions to the GCF by developed countries, the BASIC nations noted with concern the “insufficiency and inadequacy” of the support provided by developed countries to date and urged them to quickly make adequate provision of finance to facilitate effective implementation of Kyoto Protocol and ", "Paris Agreement", ".\n", "\n", "“Brazil, South Africa, India and China put together has one-third of world’s geographical area and nearly 40% of the world’s population and when we unitedly speak in one voice this shows our determination and the BASIC group could play an important part in making Paris Agreement accepted by all the countries in its true letter and spirit,” said Union environment minister Prakash Javadekar who represented India at the meeting.\n", "\n", "He noted that the joint statement has highlighted all the issues which are relevant today and the world must take note of what BASIC is saying ahead of the UNSG’s climate action summit in New York next month and the Conference of Parties (CoP25) in Chile in December.\n", "\n", "The BASIC ministers in their joint statement also highlighted the significant gaps in pre-2020 climate efforts of developed countries not only in mitigation, but also in adaptation and support to developing countries.\n", "\n", "Urging developed countries to undertake ambitious actions to reduce emissions and fulfill their finance commitments, including in the pre-2020 period, in light of their historical responsibilities, the ministers underlined that the “implementation gaps” (on the part of rich nations) should not present a burden to developing countries in the post-2020 period.\n", "\n", "The ministers also urged developed countries to provide “adequate and predictable means of implementation” to developing countries to enable them to achieve their climate goals.\n", "\n", "“In this respect, developed countries are called upon to enhance support to developing countries for actions related to project or programme development and implementation, including on adaptation, mitigation and transparency. This must be done through adequate provision of finance, technology transfer, and capacity building to facilitate the effective implementation of the Convention (UNFCCC), its Kyoto Protocol and its Paris Agreement,” said the joint statement.\n", "\n"]], "tags": ["SÃ£o Paulo", "official development assistance", "brazil", "Paris agreement", "economy of china", "Green Climate Fund"]},
{"heading": [["Jeff Bezos commits $10 billion to fight climate change"]], "sub_heading": [["Amazon founder Jeff Bezos said Monday that he plans to spend $10 billion of his own fortune to help fight climate change. Bezos, the world's richest person, said in an Instagram post that he'll start giving grants this summer to scientists, activists and nonprofits working to protect Earth. Bezos said that he will call his new initiative the Bezos Earth Fund."]], "time": [["Last Updated: Feb 18, 2020, 09.51 AM IST"]], "publisher": [["AP"]], "article": [["NEW YORK: ", "Amazon", " founder ", "Jeff Bezos", " said Monday that he plans to spend $10 billion of his own fortune to help fight ", "climate change", ".\n", "\n", "\n", "Bezos, the world's richest person, said in an Instagram post that he'll start giving grants this summer to scientists, activists and nonprofits working to protect Earth.\n", "\n", "\"I want to work alongside others both to amplify known ways and to explore new ways of fighting the devastating impact of climate change,\" Bezos said in the post.\n", "\n", "Amazon, the company Bezos runs, has an enormous carbon footprint. Last year, Amazon officials said the company would work to have 100% of its energy use come from solar panels and other renewable energy by 2030.\n", "\n", "The online retailer relies on fossil fuels to power planes, trucks and vans in order to ship billions of items all around the world. Amazon workers in its Seattle headquarters have been vocal in criticizing some of the company's practices, pushing it to do more to combat climate change.\n", "\n", "Bezos said in the post Monday that he will call his new initiative the Bezos Earth Fund. An Amazon spokesman confirmed that Bezos will be using his own money for the fund.\n", "\n", "Despite being among the richest people in the world, Bezos only recently became active in donating money to causes as other billionaires like ", "Bill Gates", " and Warren Buffett have done. In 2018, Bezos started another fund, committing $2 billion of his own money to open preschools in low-income neighborhoods and give money to nonprofits that help homeless families.\n", "\n", "Bezos, who founded Amazon 25 years ago, has a stake in the company that is worth more than $100 billion.\n", "\n"]], "tags": ["Amazon", "global warming", "Bill Gates", "Jeff Bezos", "climate change"]},
{"heading": [["Global warming will lead to river ice cover decline: Study"]], "sub_heading": [["The annual river ice cover will decline by about six days for every one degree Celsius increase in global temperatures, posing economic and environmental consequences, according to a study. The research, published in the journal Nature, is the first to look at the future of river ice on a global scale."]], "time": [["Last Updated: Jan 02, 2020, 01.04 PM IST"]], "publisher": [["PTI"]], "article": [["WASHINGTON: The annual river ice cover will decline by about six days for every one degree Celsius increase in global temperatures, posing economic and environmental consequences, according to a study.\n", "\n", "\n", "The research, published in the journal Nature, is the first to look at the future of river ice on a global scale.\n", "\n", "\"We used more than 400,000 satellite images taken over 34 years to measure which rivers seasonally freeze over worldwide, which is about 56 per cent of all large rivers,\" said Xiao Yang, a postdoctoral scholar at the ", "University of North Carolina at Chapel Hill", " (UNC-Chapel) in the US.\n", "\n", "\"We detected widespread declines in monthly river ice coverage. And the predicted trend of future ice loss is likely to lead to economic challenges for people and industries along these rivers, and shifting seasonal patterns in ", "greenhouse gas", " emissions from the ice-affected rivers,\" Yang said in a statement.\n", "\n", "The team also looked at changes to river ice cover in the past, and modelled predicted changes for the future.\n", "\n", "Comparing river ice cover from 2008-2018 and 1984-1994, the team found a monthly global decline ranging from 0.3 to 4.3 percentage points.\n", "\n", "The greatest declines were found in the ", "Tibetan Plateau", ", eastern Europe, and Alaska.\n", "\n", "\"The observed decline in river ice is likely to continue with predicted ", "global warming", ",\" the researchers found.\n", "\n", "For the future, the team compared expected river ice cover through 2009-2029 and 2080-2100.\n", "\n", "Findings showed monthly declines in the ", "Northern Hemisphere", " ranging from 9-15 per cent in the winter months, and 12-68 per cent during the spring and fall.\n", "\n", "The ", "Rocky Mountains", ", northeastern US, eastern Europe, and Tibetan Plateau are expected to take the heaviest impact, the researchers said.\n", "\n", "\"Ultimately, what this study shows is the power of combining massive amounts of satellite imagery with climate models to help better project how our planet will change,\" said UNC-Chapel Hill Associate Professor Tamlin Pavelsky. \n", "\n"]], "tags": ["global warming", "northern hemisphere", "Tibetan plateau", "Rocky Mountains", "University of North Carolina at Chapel Hill", "greenhouse gas"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["modi at unccd cop14", "Plastic waste", "rio convention", "climate change issues", "Conference of Parties", "PM Modi"]},
{"heading": [["Godrej stresses on technological innovations to meet global food challenges and save environment"]], "sub_heading": [[]], "time": [["Last Updated: Nov 20, 2019, 03.10 PM IST"]], "publisher": [[", TNN"]], "article": [["SINGAPORE: 'Innovations will find the way, innovations will save the day,' ", "Nadir Godrej", ", chairman, ", "Godrej Agrovet", ", while delivering his speech poetically in his signature style at the second 'The Asia-Pacific Agri-food innovation week' in the city during the inaugural session of the three-day summit beginning on Wednesday stressed on finding new means and methods to face the global food challenges and related environmental issues.\n", " \n", "The summit has been organized by UK-based Rethink Events and global investment company Temasek, headquartered at ", "Singapore", ", to provide platforms to brainstorm on technological innovations and investments in Asia's agri-food chain between November 20-22. Around 800 delegates and over 130 speakers from 42 countries will meet to share their technological findings and exchange concepts.\n", " \n", "Deputy prime minister of Singapore Heng Swee Keat, also the finance minister, will remain present at the summit too. Temasek, PwC and Rabobank will present 'The Asia ", "Food challenge", " report' in the presence of the Dy PM.\n", "\n", "Godrej, also Managing director of the Godrej groups, stole the show with his poetic expressions on the issues of food challenges. \"Indeed there is so much charm, in reducing waste on the farm,\" he said as his verses flowed. The senior Indian industrialist stressed on collaborating rather than competing to find solutions to various problems related to food challenges, various positive nuances of agri-food as a environmen saviour and also need to develop food technologies. \"We are not much away from the day when there would be 'cultured meat', 'cultured milk' and 'single cell ", "protein", "',\" he said. \n", "\n", "Godrej was preceded by Senior minister of state for trade and industry, Koh Poh Koon who highlighted that indoor vertical farming and insect farming will be two among several new techniques nurtured at the upcoming 'Food innovations park'. He assured of assistance from Singapore government especially economic support. \n", "\n", "John Vaske, head of the Temasek ", "international", "'s agri-business, said during the opening key address, said Asia is urbanising faster than any other region and there would be huge opportunity to generate new solutions to secure Asia’s food security. \"How can we increase yields, reduce the environmental impact, and feed the population sustainably?\" said Vaske underlining the theme of the summit. He also said that some of these solutions will be high tech, such as, alternative proteins, vertical farms and gene editing.\n", "\n", "Vaske also stressed that urban consumers also have increasingly complex food requirements who are no longer satisfied with food for just bodily sustenance, they are demanding. \"There is a demand for more healthy, nutritious, safe and sustainable food. Recognising this, we have invested in alternative protein startups, Impossible Foods and Perfect Day, as well as high tech indoor farming companies, Sustenir and Bowery,\" he said. \n", "\n", "Vaske, while addressing, also said that there is also more upstream opportunities in the supply chains for food production. \"Technology can be used to improve the quality of crops. For example, our portfolio company VoloAgri breeds better vegetable seeds using plant ", "genetics", ", while Pivot Bio, is using microbes to self-fertilize crops instead of using nitrogen fertilizers,\" he said.\n", "\n"]], "tags": ["singapore", "food challenge", "Genetics", "protein", "Godrej group", "Godrej Agrovet", "Nadir Godrej", "international"]},
{"heading": [["Western Rajasthan produces surplus power, thanks to wind and\nsolar energy"]], "sub_heading": [[]], "time": [["Last Updated: Dec 31, 2019, 10.50 AM IST"]], "publisher": [["PTI"]], "article": [["JAISALMER: Winds of change in alternative power generation are sweeping across western ", "Rajasthan", " with wind and solar energy producing surplus electricity for the tenth successive year considerably reducing greenhouse gas emissions.\n", "\n", "In Jaisalmer region, the total installed ", "wind power", " capacity is 3933.52 MW and solar energy production is 113 MW, a senior official said.\n", "\n", "\"On an average, the windmills generate 25 to 30 per cent of the total installed capacity,\" the official said.\n", "\n", "The combined production of solar and wind mill energy is much higher than the average energy requirement varying between 130 MW and 140 MW in ", "Jaisalmer district", ", he said.\n", "\n", "This reduces the dependence on thermal power plants or gas turbines which causes air pollution, the official said.\n", "\n", "While wind power generation started in 2001-02, solar energy got a boost five years back in western Rajasthan.\n", "\n", "\"Since the last ten years, there has been no power shortage in this region with production being higher than the requirement,\" the official said.\n", "\n", "The Union government has set a national target of installing one lakh MW grid connected ", "solar power", " capacity in the country by 2022, according to the Ministry of New and Renewable Energy.\n", "\n", "A total grid connected solar power generation capacity of 31,696 MW has been set up in the country till October 31, while projects of 17,998 MW capacity are at various stages of installation, it said.\n", "\n", "To boost alternative power generation in the desert region, the Jodhpur-based ", "Central Arid Zone Research Institute", " (CAZRI) has designed and developed a concept of integrating solar energy-based electricity generation and crop production from a single land unit, referred to as agri-voltaic system, principal scientist Dr Priyabrata Santra said.\n", "\n", "\"We have also developed a unique rain water harvesting system for cleaning solar panels set up between rows of plantations in agricultural fields,\" Santra told a visiting group of journalists here.\n", "\n", "With water being scarce in the desert region, this will go a long way in providing supplemental irrigation to the land on which both solar energy is generated and crops are grown, the CAZRI scientist said.\n", "\n", "He said that rainwater harvesting system from top surface of photovoltaic-module (solar power panel) has been designed and developed with an estimated annual rainwater harvest of 1.5 lakh litres from 105 kW system, which is enough to provide supplemental irrigation of about 37.5 mm in one acre land.\n", "\n", "\"This system ensures optimum use of land since the rows of solar panels and crops run parallel to each other, thus using the ground between each other,\" Santra said.\n", "\n", "People are also being encouraged to set up solar panels on the roof of their houses, a senior official of Jaisalmer circle of ", "Jodhpur", " Power Distribution Corporation Ltd said.\n", "\n", "The houseowners can use the power generated from the panels and pool the surplus into the grid, the official said.\n", "\n", "He said that maximum wind energy is generated in Jaisalmer and also in Bikaner and Barmer of western Rajasthan, with six private companies involved in the business.\n", "\n", "\n"]], "tags": ["wind power", "Solar power", "Jaisalmer district", "jodhpur", "Windmill", "energy independence", "Central Arid Zone Research Institute", "rajasthan"]},
{"heading": [["Tiger reserves to mark World Wildlife Day today"]], "sub_heading": [["World Wildlife Day will be celebrated with several programmes about fauna and flora in Pench, Melghat and Tadoba tiger reserves on March 3."]], "time": [["Last Updated: Mar 03, 2014, 03.23 AM IST"]], "publisher": [["TNN"]], "article": [["NAGPUR: ", "World Wildlife Day", " will be celebrated with several programmes about fauna and flora in Pench, Melghat and Tadoba ", "tiger reserves", " on March 3.", " ", " Satpuda Foundation has organized several village-level awareness programmes at Pench, Melghat and Tadoba. \"The day reminds us of the urgent need to stop wildlife crime, which has serious economic, environmental and social impacts,\" said Kishor Rithe, member of state board for wildlife.", " ", " On December 20, 2013, 68th session of the UN General Assembly had decided to proclaim March 3, the day of adoption of the Convention on International Trade in Endangered Species of ", "Wild Fauna and Flora", " (CITES), as World Wildlife Day, to celebrate and raise awareness of the world's wild fauna and flora.", " ", " In its resolution, the General Assembly reaffirmed intrinsic value of wildlife and its various contributions, including ecological, genetic, social, economic, scientific, educational, cultural, recreational and aesthetic, to sustainable development and human well-being, and recognized the important role of CITES in ensuring that international trade does not threaten the species' survival.", " ", " CITES, with 179 member states, remains one of the world's most powerful tools for biodiversity conservation through the regulation of trade in wild fauna and flora. Thousands of species are internationally traded and used by people in their daily lives for food, housing, health care, ecotourism, cosmetics or fashion.", " ", " CITES regulates international trade in over 35,000 species of plants and animals, including their products and derivatives, ensuring their survival in the wild with benefits for the livelihoods of local people and the global environment. The ", "CITES permit system", " seeks to ensure that international trade in listed species is sustainable, legal and traceable. CITES was signed in Washington on March 3, 1973.", " "]], "tags": ["Tiger reserves", "Wild Fauna and Flora", "World Wildlife Day", "CITES permit system"]},
{"heading": [["Kanpur Zoo set to soon welcome new animals"]], "sub_heading": [["Soon the visitors to the Allen Forest (Kanpur zoo) will get a chance to see fox and clouded leopard."]], "time": [["Last Updated: Sep 20, 2015, 02.45 PM IST"]], "publisher": [["TNN"]], "article": [[" \tKANPUR: Soon the visitors to the Allen Forest (Kanpur zoo) will get a chance to see fox and clouded leopard. This will be for the first time that the zoo will house a fox and a different specie of a leopard. Also, visitors will be able to see chinakaras (a type of deer) and stump-tailed macaque (a kind of a monkey). These animals will come to Kanpur zoo under the animal exchange programme with other zoos in the country. ", " \tWhile a pair of fox and two pairs of chinkaras will come from Rewari zoo in Haryana, Assam zoo will give stump-tailed macaque and leopard, one pair each. The Kanpur zoo will give one Himalayan black bear, a pair of hyena and one pair of blackbuck (a type of deer) in exchange. ", " \tTalking to TOI, Kanpur zoo director Deepak Kumar said that this animal exchange with Rewari and Assam zoos has been finalised and the acceptance from principal chief conservator of forest (PCCF) Rupak De has been received. He said both the zoos have also agreed to give us our demanded animals. Kanpur zoo will soon house a fox and clouded leopard for the first time. ", " \tHe said that now the acceptance for exchange is to be sought from Central Zoo Authority (CZA) for which application has been moved. ", " \tOn being asked when will these animals will reach Kanpur zoo, Kumar said that it may take 15-30 days for the acceptance from CZA and the transfer of animals to take place. ", " \tThe clouded leopard is a cat which has been classified as Vulnerable in 2008 by the International Union for Conservation of Nature (IUCN). Its total population size is suspected to be fewer than 10,000 mature individuals, with a decreasing population trend, and no single population numbering more than 1,000 adults. ", " "]], "tags": []},
{"heading": [["Survey to map Himalayan springs soon"]], "sub_heading": [["As a part of the government’s plan to revive natural sources of water in the hilly region, drones would be deployed to map all the springs in the Himalayan region. Destinations such as Shimla, Mussorie, Nainital and even Gangtok often face acute water crisis."]], "time": [["Last Updated: Jan 29, 2020, 07.15 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: In a first of its kind survey, India will soon map all the springs in the Himalayan region of the country to form a national registry.\n", "\n", "This is part of the government’s plan to revive natural sources of water in the hilly region. Drones would be deployed to assess the number of springs and their existing capacity.\n", "\n", "“Springs are the lifeline of people living in the Himalayan regions. However, largescale development in the region has led to drying up of many springs which in turn has led to water scarcity,” a senior official told ET.\n", "\n", "\n", " \n", "\n", "A pilot project will be undertaken in Tehri Gharwal under the Namami Gange initiative of the Jal Shakti ministry, the official said. Destinations such as ", "Shimla", ", Mussorie, Nainital and even Gangtok often face acute water crisis. Besides, there are apprehensions that the process of drying of springs, if left unattended, could lead to largescale migration from the region.\n", "\n", "The plan is to use the ", "LiDAR", " technology with drones to assess the exact number of springs and their existing capacity based on which a concrete policy roadmap will be laid out.\n", "\n", "LiDAR, or light detection and ranging, is a surveying method that measures distance to a target by illuminating the target with laser light and measuring the reflected light with a sensor. Differences in laser return times and wavelengths will be used to make digital 3-D representations of the springs.\n", "\n", "According to the official, the government has sought the cost and time estimate from the Survey of India for pan-India mapping following which a national register for springs will be compiled and updated at regular intervals.\n", "\n", "A ", "NITI Aayog", " report on sustainable development of the ", "Himalayas", " said nearly 30% of springs are drying and 50% have reported reduced discharge.\n", "\n", "\n"]], "tags": ["Himalayan springs", "Niti Aayog", "drying rivers", "himalayas", "shimla", "Mussourie", "LiDAR", "drone"]},
{"heading": [["UN chief: Virus could push millions of Africans into poverty"]], "sub_heading": [["UN Secretary-General Antonio Guterres warned that the coronavirus threatens Africa's progress and could push millions into extreme poverty. He said in a video message launching a policy report on “The Impact of COVID-19 in Africa” that countries on the continent have responded swiftly to the crisis, and as of now reported cases are lower than feared with more than 2,500 deaths."]], "time": [["Last Updated: May 20, 2020, 01.24 PM IST"]], "publisher": [["AP"]], "article": [["UNITED NATIONS: ", "UN", " Secretary-General Antonio Guterres warned Wednesday that the ", "coronavirus", " pandemic threatens Africa's progress and could push millions into extreme poverty.\n", "\n", "\n", "The UN chief said in a video message launching a policy report on “The Impact of Covid-19 in Africa” that countries on the continent have responded swiftly to the crisis, and as of now reported cases are lower than feared with more than 2,500 deaths.\n", "\n", "The virus is present in all African countries with most recording fewer than 1,000 cases, the 28-page UN report said.\n", "\n", "The relatively low numbers of Covid-19 cases confirmed thus far “have raised hopes that African countries may be spared the worst of the pandemic,” the report said.\n", "\n", "\"Caution is warranted, however, as these are early days in the life cycle of a disease that is still not fully understood and where we have seen repeated patterns of first slow, then exponential growth in the number of cases.\"\n", "\n", "The UN said the low numbers could be linked to minimal testing and reporting, pointing to a World Health Organisation warning that the pandemic \"could kill between 83,000 and 190,000 people in 47 African countries in the first year, mostly depending on governments' responses\".\n", "\n", "And WHO also warned that \"the socioeconomic impacts could 'smolder' for several years\", the report said.\n", "\n", "Guterres said, \"much hangs in the balance\".\n", "\n", "He called for international action to strengthen Africa's health systems, maintain food supplies, avoid a financial crisis, support education, protect jobs, keep households and businesses afloat, and cushion the continent against lost income and export earnings.\n", "\n", "To help address the devastating economic and social consequences of the pandemic, Guterres said Africa needs more than $200 billion and “an across-the-board debt standstill for African countries” unable to service their debt, “followed by targeted debt relief and a comprehensive approach to structural issues in the international debt architecture to prevent defaults.”\n", "\n", "In recent years, Guterres said economic growth in Africa has been strong, the digital revolution has taken hold and agreement has been reached on a free trade area.\n", "\n", "But he said “already, demand for Africa's commodities, tourism and remittances are declining” and the opening of the trade zone has been pushed back.\n", "\n", "The secretary-general said the pandemic “will aggravate long-standing inequalities and heighten hunger, malnutrition and vulnerability to disease.”\n", "\n", "The UN urged that agriculture be declared a critical sector that should not be interrupted by Covid-19 related measures.\n", "\n", "Guterres commended what countries and the African Union have done to tackle the pandemic, saying most have deepened regional coordination, deployed health workers, and enforced quarantines, lockdowns and border closures.\n", "\n", "“They are also drawing on the experience of HIV/AIDS and Ebola to debunk rumors and overcome mistrust of government, security forces and health workers,” Guterres said.\n", "\n", "He said the United Nations has delivered millions of test kits, respirators and other supplies, reaching almost the entire continent.\n", "\n", "While dealing with the pandemic, the UN report said “maintaining peace and security in Africa remains paramount.” Guterres has appealed for global cease-fires to tackle Covid-19 and he said it is \"essential for African countries to sustain their efforts to silence the guns and address violent extremism\".\n", "\n"]], "tags": ["covid", "coronavirus", "un", "World Health Organization"]},
{"heading": [["Punjab: With Beas pollution down, rare Indus river dolphins venturing out"]], "sub_heading": [["With reduced human activities and improvement of water quality of the Beas during Covid-19 lockdown, Indus river dolphins — one of the world’s rarest mammals — are being sighted more regularly at Beas Conservation Reserve and have also started venturing out to other areas, as far as about 50km away from its hotspots in the Beas."]], "time": [["Last Updated: May 06, 2020, 05.12 PM IST"]], "publisher": [[", TNN"]], "article": [["CHANDIGARH: With reduced human activities and improvement of water quality of the Beas during Covid-19 lockdown, ", "Indus river dolphins", " — one of the world’s rarest mammals — are being sighted more regularly at Beas Conservation Reserve and have also started venturing out to other areas, as far as about 50km away from its hotspots in the Beas.\n", "\n", "\n", "Two of the four freshwater dolphin species in the world are found in India. These are the Ganges and Indus river dolphins. Beas Conservation Reserve in Punjab is home to the only population of Indus river dolphins in the country.\n", "\n", "\n", "\n", "There has been marked improvement in the water quality of the Beas over the last one month. Last week, Punjab Pollution Control Board (PPCB) conducted a survey of water quality and said that the river no longer fell in the polluted category.\n", "\n", "Field observations by the wildlife department and ‘dolphin mitras’-- a network of riparian communities trained to monitor river health by WWF-India -- reveal that the Indus river dolphins were being sighted more often at the hotspots in Gharka and Karmowala villages falling in Tarn Taran district and occasionally in Harike Wildlife Sanctuary.\n", "\n", "The teams spotted one to four dolphins per sighting. However, no calves were seen along with the adults or sub-adult dolphins. Dolphin sightings are most common between 12pm and 3pm at the hotspots.\n", "\n", "Terming the frequent spotting of dolphins as a heartening sign, Dr Kuldip Kumar, principal chief conservator of forests, wildlife and chief wildlife warden of Punjab said that in addition to Beas Conservation Reserve, dolphins are also venturing into the Harike Wildlife Sanctuary. “Wildlife department teams have also reported sightings of sympatric species like gharial, turtles and smooth-coated otters along with Indus river dolphins,” said Dr Kumar.\n", "\n", "Buoyed by the sightings, the wildlife department has planned to conduct a detailed species assessment after lifting of Covid-19 restrictions. To ensure the safety of wildlife and to prevent illegal activities in the protected area, the department is conducting active patrolling.\n", "\n", "Dr Gitanjali Kanwar, coordinator, WWF-India, said, “Dolphin mitras living on the banks of the Beas are acting as ears and eyes for us to understand the ground reality amidst the ongoing Covid-19 situation. WWF-India and wildlife department trained and formed a network of friends of Beas in 30 villages around Beas Conservation Reserve starting from 2018.”\n", "\n", "\n"]], "tags": ["Indus dolphins", "Chandigarh nwes", "beas pollution down", "Indus river dolphins", "dolphins in Indus river", "chandigarh", "chandigarh news today", "Indus dolphins venturing out"]},
{"heading": [["Pollution in China's smog-prone Hebei falls by a quarter in April"]], "sub_heading": [[]], "time": [["Last Updated: May 13, 2020, 09.01 AM IST"]], "publisher": [["Reuters"]], "article": [["SHANGHAI: Air ", "pollution", " fell by more than a quarter last month in China's most smog-prone province of Hebei, the environment ministry said, aided by crackdowns on dust pollution and straw burning as well as tougher policies on use of diesel and fireworks.\n", "\n", "Concentrations of hazardous floating particles known as PM2.5 fell 26.7% from the same month last year to an average of 33 ", "micrograms", " per ", "cubic metre", ", for the best April on record, the ministry added in a statement issued late on Tuesday.\n", "\n", "The northern province also met China's interim air quality standard of 35 micrograms per cubic metre.\n", "\n", "Hebei, which turns out about a quarter of China's total steel output, has benefited as well from an industrial slowdown caused by the coronavirus pandemic.\n", "\n", "For the first four months, Hebei's concentrations of PM2.5 fell 15.7% to 59 micrograms per cubic metre, although that still exceeds a ", "World Health Organization", " recommendation of no more than 10 micrograms.\n", "\n", "The province said its priority over the summer would be to control ground ozone pollution, primarily from vehicle exhaust fumes and sunlight. \n", "\n"]], "tags": ["micrograms", "Air Pollution", "Cubic metre", "pollution", "World Health Organization"]},
{"heading": [["On World Environment Day, President, PM stress on 'living in harmony with nature'"]], "sub_heading": [[]], "time": [["Last Updated: Jun 05, 2019, 09.12 AM IST"]], "publisher": [["Agencies"]], "article": [["NEW DELHI: On the occasion of ", "World Environment Day", ", President Ram Nath Kovind on Wednesday reaffirmed the commitment to a cleaner and sustainable planet, adding that ", "living in harmony", " with nature is a part of the Indian ethos.\n", "\n", "\n", "\"On World Environment Day, we reaffirm our commitment to a cleaner and sustainable planet. Living in harmony with nature is a part of the Indian ethos. India is committed to addressing climate change and bequeathing a greener, eco-friendly habitat to our children,\" President Kovind wrote on his Twitter handle.\n", "\n", "Living in harmony with nature will lead to a better future, Prime Minister Narendra Modi said Wednesday on the World Environment Day.\n", "\n", "\"Our planet and environment is something we all cherish greatly. Today on #WorldEnvironmentDay, we reiterate our commitment to ensure a cleaner planet,\" the prime minister tweeted.\n", "\n", "Living in harmony with nature will lead to a better future, he said and posted a short video.\n", "\n", "In the video, he said planting saplings is not enough and people have to take care of it till it becomes a tree. \n", "\n"]], "tags": ["kovind world environment day", "modi world environment day", "india world environment day", "World Environment Day", "living in harmony"]},
{"heading": [["India's forest cover increased by 1% in the last 5 years: Javadekar"]], "sub_heading": [[]], "time": [["Last Updated: Jun 07, 2019, 07.10 PM IST"]], "publisher": [["ANI"]], "article": [["MUMBAI: India's forest cover has increased by one per cent in the last five years and similar progress will be made through people's participation, Union Minister for the environment, forest and climate change, Prakash Javadekar has said.\n", "\n", "\n", "Speaking to media during his maiden visit to Mumbai's National Museum of Indian Cinema (NMIC) on ", "World Environment Day", " on Thursday, he asked people to plant and help grow at least 10 trees as part of their contribution to protecting the environment.\n", "\n", "Javadekar was on his first official visit to Mumbai after taking charge as minister in the second Modi government. The minister planted three saplings at Gulshan Mahal, the historic building in Films Division that houses a part of NMIC, as part of the celebration of World Environment Day yesterday.\n", "\n", "Film personalities Anupam Kher, Jackie Shroff, Shyam Benegal, Kiran Shantaram, Varsha Usgaonkar and others were present on the occasion. The Minister expressed his heartfelt gratitude to all artists for coming together and joining the movement.\n", "\n", "Javadekar also unveiled a people's campaign ", "#SelfiewithSapling", " on Environment Day eve, urging everyone to plant a sapling and to post the selfie with the sapling on social media.\n", "\n", "Javadekar interacted with around 100 film personalities, including Shyam Benegal, Subhash Ghai, Ramesh Sippy, Ketan Mehta, Jabbar Patel, Kiran Shantaram, Shilpa Shetty, among others present.\n", "\n", "The minister also planted saplings in the premises of Environment Ministry in New Delhi along with the Minister of State in the Environment Ministry Babul Supriyo, renowned cricketer Kapil Dev, Bollywood actors Jackie Shroff and Shri Randeep Hooda and noted singer Malini Awasthi. \n", "\n"]], "tags": ["india forest cover javadekar", "India forest cover", "javadekar world environment day", "World Environment Day", "#selfiewithsapling"]},
{"heading": [["Are you a Green Warrior? Show your passion towards saving our planet at Earth Care Awards"]], "sub_heading": [[]], "time": [["Last Updated: Jun 11, 2019, 11.04 AM IST"]], "publisher": [["SPOTLIGHT"]], "article": [["We all have been \n", " about the threat that’s hanging over our heads. If not all, then, most of us have! Climate Change is real and we need to hit the brakes and review the matter. What former US President Barack Obama said shows the urgency of the situation. During one of his speeches, Obama said, “\n", "” And we cannot agree with him more. We need to pull our socks and address the gravity of the situation here. While many have turned a blind eye to the situation, there are some who have embraced the urgency and acted accordingly. \n", "\n", "\n", "And the ones who put our planet Earth first are all set to be awarded at the 9th edition of the JSW-The Times of India Earth Care Awards (ECA). The event will recognize and felicitate \n", " that have kept climate change mitigation high up on their agenda. \n", "\n", "\n", "Awardees will be the ones who have willingly initiated & devised a plan to reduce carbon intensity in their daily operations. So, if your organization has incorporated such steps to save the planet and our Mother Nature, then do drop in your applications. Get more information about the initiative and the awards \n", "here", "The last date for submitting applications is\n", "\n", "\n", " \n", " \n", "\n", "Partners in this initiative are KPMG (Knowledge Partner), Indian Chamber of Commerce (Outreach Partner) and TERI (Technical and Learning Partner).\n", "\n", "\n", "\n", "\n", "\n", "The Earth Care Awards started in 2008. The past few years have seen notable entries from countries which need to address and tackle common challenges of poverty, depleting natural resources, climate migration and conflict over access to natural resources. \n", "\n", "The awards span across five categories: 1) Leadership in urban climate action, 2) Community-based mitigation and adaptation for water resources, agriculture and forestry, other land use, animal husbandry and climate risk-proofing, 3) Innovation in climate action, 4) GHG mitigation in large enterprises 5) Leadership of women-led enterprises in climate action.\n", "\n", "Some of the earlier awardees include the IFFCO, Kalol unit, Gujarat, Godrej and Boyce Mfg and civil society initiatives such as the Barefoot College. The jury members include some of the eminent names from various industries: Chandra Bhushan, deputy director general, CSE; Scientist RA Mashelkar, FRS, president, Global Research Alliance; Kartikeya V Sarabhai, founder director, CEE; Rajendra Shende, chairperson, TERRE; Dr Ajay Mathur, director general of TERI; Dr Suhas Wani, director, ICRISAT Development Centre; Aneeta Benninger, executive director, CDSA; Rajat Gupta, director, McKinsey and Company; Ravi Singh, secretary general & CEO of WWF-India; Dr Rakesh Kr Singh, director of NEERI and Seema Arora, deputy director general, CII. \n", "\n", "\n", "\n", "\n", "\n", "About two years ago, India had submitted its first Biennial Update Report (BUR). The report carried the details of carbon emission inventory for the year 2010. A follow-up report was also shared for the year 2014. The reports (BUR-I and BUR-II) highlight the Indian energy sector’s contribution towards the total Greenhouse Gas (GHG) emissions, which happens to be 71% of total emission in 2010 and 73% in 2014. Such findings, compel India to work towards reducing emissions. And many organizations have done their bit to contribute to this need. \n", "\n", "\n", "\n", "\n"]], "tags": ["GreenWarioirr", "Earthh Kare Awardsss", "Aarth care Awwards", "Earth Kace Awerds", "Obamamama"]},
{"heading": [["Fix the leak: Why water is a company matter"]], "sub_heading": [[]], "time": [["Last Updated: Jun 12, 2019, 10.10 AM IST"]], "publisher": [["TNN"]], "article": [["Water Positive Campaign", "\n", "\n", "\n", "On May 27, Uday Kotak tweeted: “4.3 lakh plastic bottles saved per annum. Glass water jars and disposable paper cups in meeting rooms at Kotak Mahindra Bank Mumbai offices. Working to make it national”, along with a photo of the glass jars and paper cups.\n", "\n", "\n", "The measure shared by an industry leader shows businesses acknowledging, however slowly, and demonstrating, that company practices and tiny tweaks in office drills can significantly impact the environment and help conserve natural resources.\n", "\n", "Not just plastic, large companies are engaging with how they approach ‘water’, the most precious and threatened resource. From indiscriminate sourcing, to polluting groundwater and rivers, corporate houses have had a free run in use of water for operations without limit, and often have flouted pollution norms, with little regard for checks and balances.\n", "\n", "Large MNCs have faced community unrest at factory sites over random sourcing, and polluting, of groundwater, adversely impacting the neighbourhood of their factory sites, and been taken to court.\n", "\n", "\n", "\n", " \n", "\n", "\n", " \n", "\n", "While reducing individual ‘water footprint’ has been the focus for conservation efforts, community actions and NGOled projects have made the leap to the corporate world, where collectives are engaging with companies to review water practices: in offices, supply chain and in their operations.\n", "\n", "As the water crisis deepened, the ‘water risk’ to businesses sharply spiked, leading to corporate houses seeking solutions to make operations more water-friendly and business operations less risky. Australia made water a tradable commodity in the hope that it will be managed more efficiently.\n", "\n", "Charity CDP was founded 15 years ago as a system for investors, corporate houses, cities, states and regions to manage their environmental impacts. CDP said in its 2018 report that despite knowing the severity of water stress, just nine of 37 Indian companies asked to disclose to CDP their commitments to measure the environmental impact of their businesses did so.\n", "\n", "Some years ago, the nonprofit Alliance for Water Stewardship devised a measure to gauge a company’s commitment to conservative water use from supply chain to end customer. The standard measured a company’s commitment to “use of water that is socially equitable, sustainable and economically beneficial... that involves site and catchmentbased actions”.\n", "\n", "The AWS Standard, its website says, was developed through a four-year global consultation for a framework that could be implemented at any site, across the sector, in any catchment globally. It is the only framework for water users that is compliant with guidelines for standards system laid down by ISEAL, the global alliance for credible standard systems. This is among the initiatives made the world over towards what is called water positivity: where rampant abuse of water is replaced by an attitudinal shift of taking ‘care’ of water.\n", "\n", "TOI’s Make India Water Positive campaign is a stand against wastage and mismanagement of water. This year it aims to bring a behavioural change among people to make a responsible choice of the brands they will endorse, based on their water-resilience.\n", "\n", "Just a clutch of companies is exploring water-efficient businesses. Ashish Bhardwaj of AWS India said that Diageo, Mars and ITC have adopted the AWS Standard in India 2014. A Coimbatore paper and pulp unit which has adopted the standard awaits an audit, he said. First, a baseline study at the site included the factory’s impact on the region’s water resources such as check dams, village ponds etc. It measured the gap between practice and ideal water use. It was, therafter, for the company to adopt practices and devise ways to improve operations.\n", "\n", "TOI’s Water Positive campaign is designed to motivate companies to commit to waterpositivity and announce their status as a socially responsible brand. The campaign has invited brands to pledge to water positivity on global standards. \n", "\n"]], "tags": ["water positive campaign", "Plastic water bottle", "toi water positive", "water conservation", "toi water campaign"]},
{"heading": [["Panambur beach mulls night safari"]], "sub_heading": [["A beach sleepover party organised in Panambur, Karnataka has become the next big tourism idea. Its clean and sandy shores have proved to be a big USP and attracts a lot of visitors. Stifling humidity, chill and mosquito bites are a few of the problems faced during the night beach safari."]], "time": [["Last Updated: Feb 23, 2016, 04.34 PM IST"]], "publisher": [["TNN"]], "article": [["MANGALURU: A ", "beach sleepover", " party organized last weekend to celebrate the academic success of two CA students at Panambur has the potential to become the next big tourism idea. ", "Panambur beach", " has the highest average daily footfalls in Karnataka. The beach, managed by Panambur Beach Tourism Development Project (PBTDP), doesn't need additional marketing, for its clean and sandy shores have proved to be its USP.\n", "\n", "A brainchild of Giridhar Kamath, the sleepover was primarily intended to celebrate the success of his daughter Malavika and friend Latha clearing the CA exams. In fact, while in college, Giridhar used to frequent the beach with friends and indulge in star-gazing. Those memories came back when he with his friends from the Youth Hostels Association of India, Team Mangalore and other like minded people, pulled out all stops to organize this maiden sleepover.\n", "\n", "A group of around 200 family friends landed at the beach around 8pm on Saturday fo games, music, group acting spot interviews, poetry session, impromptu talent display and a campfire. A cool sea breeze added to the fun and frolic of the gathering from al age-groups. Of these, around 40 stayed back for the sleep over, pitching tents or just using bedsheets as they indulged in star-gazing on a full moon night. \n", "\n", "Chill and mosquitoes can be a problem though.\n", "\n", "Yatish Baikampady, CEO, PBTDP, who played an integral part in organizing this sleepover, told TOI that it could well spell the revival of a night beach safari that the authorities toyed with two years ago. “The only hitch is the constantly changing direction of sea breeze could leave those coming for the sleepover open to stifling humidity, chill and mosquito bites,“ he said.\n", "\n", "“We took turns sleeping in the tents or out in the open using bed sheets. Stray dogs and mosquitoes ensured we had a sleepless night,“ said Gayathri Bhat, a medical professional. Nonetheless, this impromptu idea will spur PBTDP to come up with a fullfledged night beach safari during winter and spring, he added.\n", "\n"]], "tags": ["Panambur beach", "night safari", "Beach Party", "Beach sleepover"]},
{"heading": [["Time to test waters in the boardroom?"]], "sub_heading": [[]], "time": [["Last Updated: Jun 15, 2019, 10.12 AM IST"]], "publisher": [["TNN"]], "article": [["It’s the first drop in an ocean yet to be filled. But some of the world’s major companies have finally brought into their boardrooms corporate sustainability targets, including ones related to water, which means tying water issues to executive performance.\n", "\n", "\n", "Among notable measures is one by German chemicals company Symrise AG, which now ties 10% of its C-suite bonuses to achieving corporate sustainability targets. Another is of UK consumer goods company, Reckitt Benckiser, which has committed to raising a third of its net revenue from ‘more sustainable’ products by 2020.\n", "\n", "In its latest report, nonprofit CDP, which runs a global disclosure system to measure corporate environmental impacts, talks of a new index from European stock exchange Euronext, with Goldman Sachs, that has become the first globally to base its selection on how companies perform on water security and climate. CDP notes that when businesses ensure water management and incentivise key executives, water practices of companies will be impacted greatly.\n", "\n", "Among Indian companies alert to water issues, CDP says Tata Steel has a comprehensive water-risk assessment in place.\n", "\n", "That said, it’s a very long, and dry, road ahead. Not even a third (31%) of global companies serious about their waterresilience have incentives in place for C-suite executives on water-related issues. Further, despite more companies setting targets to reduce withdrawals, they are all using more water year-on-year. Between 2015 and 2018, there has been an almost 50% increase in the number of companies reporting higher water withdrawals, CDP said. Such spikes are most pronounced in Asia and Latin America, and in the food, beverage and agricultural sectors, besides manufacturing and mining. As for India, a WWFIndia and WWF-UK study cites a 2018 Niti Aayog report that India’s current ", "water crisis", " is its ‘worst-ever’. It says by 2020, 21 cities are expected to run out of groundwater. By 2030, the country’s water demand is projected to be twice the supply. The report estimates water scarcity may result in a 6% loss to India’s GDP.\n", "\n", "The first impact of responsible water use is often reported in a rise in cost of operations, but companies are also realising the risk they face if they do not wake up to the water crisis.\n", "\n", "Globally, the retail sector has emerged as the least concerned about water, with next to no monitoring of its supply chain of food, beverage, farm products, apparel and gadgets, which are all water-guzzlers.\n", "\n", "The other sector lagging is energy. The International Energy Agency has said global water consumption for power generation and fuel production is expected to more than double from 66 bcm in 2010 to 135 bcm by 2035. Coal alone accounts for 50% of this. Add to that the risk of pollution of both surface and groundwater. If business leaders ignore water management at this juncture, they may soon be staring at dry assets. \n", "\n"]], "tags": ["water sustainability", "companies water practices", "water crisis", "India water crisis", "corporate water practices"]},
{"heading": [["Involving tribal communities can boost India's wildlife conservation: IIT prof"]], "sub_heading": [[]], "time": [["Last Updated: Jun 17, 2019, 12.52 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: India's wildlife conservation initiatives need the involvement of local tribal communities- rather than the token activism of urban dwellers- to ensure that humans and animals coexist peacefully, according to an IIT expert.\n", "\n", "\n", "Ambika Aiyadurai, assistant professor of Social Sciences, Indian Institute of Technology (IIT) Gandhinagar, said that it is high time that wildlife conservation projects in the country are revaluated.\n", "\n", "\"We borrowed the idea of national park, thinking it will protect wildlife. But there are lot of issues about people in national parks,\" Aiyadurai, who has been closely studying how wildlife conservation affects local populations, told PTI.\n", "\n", "According to Aiyadurai, forests in India have never been \"pristine spaces\" and have always had local tribes interacting with them. Wildlife and human populations have peacefully and sustainably coexisted.\n", "\n", "However, the modern idea of conservation removes local people and puts a fence around forests- at the same time letting in tourists or even allowing mining, Aiyadurai said.\n", "\n", "The middle class in India engages in what is described as 'bourgeois environmentalism'.\n", "\n", "\"We take part in school projects and paint posters. To participate in environmental movements for urban dwellers is symbol of status,\" Aiyadurai said.\n", "\n", "\"There are studies which show connection between middle class and environmental consciousness; the higher we go in our economic comfort, we tend to appreciate nature more.\n", "\n", "\"On the other hand, if you look closely at people who live near tiger habitats or reserves, they think about how to take care of their farms and how to protect cattle,\" she told PTI.\n", "\n", "A study on sloth bear conservation in Madhya Pradesh showed that many women were victims of sloth bear attacks, since they have to use toilets early in the morning before other family members wake up.\n", "\n", "\"So, people who live close to nature, their relationship with the environment is difficult. It's pragmatic and their concern is survival,\" said Aiyadurai.\n", "\n", "People who live in the city take part in conservation drives without knowing the ground realities.\n", "\n", "They are given a very nice picture of nature in a sanitised way and not nature as something to engage with.\n", "\n", "\"If you live in a village, you need to go to forest for fuelwood. But if you look at national parks, collecting fuelwood is illegal. According to forest laws, the forest dwellers would be criminals who commit crimes every day, entering or collecting something becomes illegal.\n", "\n", "During a study on Sariska tiger reserve, Aiyadurai looked at poaching records. Her team found a tribal woman collecting a porcupine quill being recorded as crime.\n", "\n", "\"She collected it for some ritual. Some of the crimes are too petty to be booked under Wildlife Protection Act. Since some activities are illegal, people have to suffer huge costs and urban people like us are not paying any costs,\" she said.\n", "\n", "The notion behind these protected places is that they are pristine and undisturbed. However, people are always coming there, and local communities live there.\n", "\n", "\"This is what I call a primitive way of looking at conservation -- asking people to move because the place is for wild animals. It's an inhuman way of conservation,\" the researcher said.\n", "\n", "\"Poor people in India are depending on forests -- for water, fuelwood, and even homes,\" Aiyadurai said.\n", "\n", "Rather than isolating these communities, Aiyadurai advocates engaging people in such a way that their cultural values are infused with scientific management.\n", "\n", "\"Urban people's participation in conservation is often mere tokenism. Most of the conservation is carried out by trained wildlife biologists from elite backgrounds -- so most of their work is trial and error,\" she said. \n", "\n"]], "tags": ["india tribals forest", "india tribals", "India forest cover", "india forest conservation", "india tribals conservation"]},
{"heading": [["316 out of 651 protected areas under final ESZ notification: Environment ministry"]], "sub_heading": [[]], "time": [["Last Updated: Jun 30, 2019, 04.53 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Over 30 per cent of India's protected area has been covered under the final ", "ecologically sensitive zone", " (", "ESZ", ") notification, the Environment Ministry informed the Lok Sabha.\n", "\n", "\n", "Replying to a query raised in the Lower House of Parliament on Friday, minister of state for environment Babul Supriyo said, \"As on June 25, 2019, final ESZ notifications covering 316 ", "protected areas", " (PAs) and draft ESZ notification covering 199 protected areas have been published by the ministry.\"\n", "\n", "According to the ministry, out of the 651 Protected Areas in India, 316 have been covered under the final ESZ notification which provides for prohibition of mining, stone quarrying and crushing units located within one kilometre of such protected areas.\n", "\n", "In the absence of the notification, an area of 10 km around the PAs is considered 'default ESZ' according to the directions of the Supreme Court, it said.\n", "\n", "Out of the 316 areas covered in ESZ final notification, 100 PAs are in Andaman and Nicobar Islands followed by 29 in Maharashtra and 23 protected areas in Madhya Pradesh and Tamil Nadu.\n", "\n", "The ESZ notifications are issued under the Environment (Protection) Act, 1986 and Environment (Protection) Rules 1986.\n", "\n"]], "tags": ["Protected areas", "india esz", "India environment", "ecologically sensitive zone", "ESZ"]},
{"heading": [["Water conservation fee likely on residential complexes, industry"]], "sub_heading": [["Union environment ministry has endorsed suggestions on levying 'water conservation fee' on industries and infrastructure projects, including residential and commercial complexes, and brought agriculture sector for the first time into ambit of regulations for groundwater use in the country. The ministry submitted the report on the NGT's direction."]], "time": [["Last Updated: Jul 25, 2019, 07.42 AM IST"]], "publisher": [[", TNN"]], "article": [["NEW DELHI: Amid growing concerns over excessive exploitation of groundwater, the Union environment ministry has endorsed suggestions on levying ‘water conservation fee’ on industries and infrastructure projects, including residential and commercial complexes, and brought agriculture sector for the first time into ambit of regulations for ", "groundwater", " use in the country.\n", "\n", "\n", "The ministry has submitted its report, comprising 45-point decadal action plans for next 50 years and several short-term suggestions, to the National Green Tribunal (NGT) which may next month take its call on the larger issues of groundwater conservation and regulation while hearing a petition on the issue. The ministry submitted the report on NGT’s direction. \n", "\n", "Once the NGT takes its final view, the Central Ground Water Board (CGWB) will come out with a quantum and mechanism on levying such fee and even consider the concept of ‘water credit’ - credit earned by user agencies from water conservation measures. \n", "\n", " \n", " \n", "\n", "The ministry’s report, submitted to the NGT on July 18, said that the money deposited as ‘", "water conservation fees", "’ may be used for groundwater recharging projects as identified by the Central Ground Water Authority (CGWA) or state government. The fees may be deposited in central depository account and maintained by the Centre for releasing to the states, it added.\n", "\n", "The ministry, however, made it clear that the extraction of groundwater in the over-exploited blocks would be considered “only for drinking water purposes and only for important social infrastructure activities” (such as hospitals and schools) with suitable restrictions. \n", "\n", " \n", " \n", "\n", "Besides industries and infrastructure projects, mining agencies and packaged drinking water plants will also come under the ambit of conservation fees. \n", "\n", "“These guidelines are mainly focusing on water conservation fee. The exploitation of groundwater should not be allowed after taking money as ‘water conservation fees’ from users. The extraction must depend only on hydrological condition of particular area,” said environmentalist Vikrant Tongad, one of the petitioners in the Tribunal. \n", "\n", "He said, “These guidelines are not very different from the previous draft. We don’t agree with all points in the latest guidelines. Authorities have to control groundwater exploitation and focus on reuse of water in all sectors, keeping in view critical groundwater situation in the country.”\n", "\n", "Though the CGWB had earlier come out with the concept of such a fee in its draft guidelines in December last year, the NGT had in January directed the ministry to get the draft examined by an expert committee comprising of representatives from IIT Delhi, IIT Roorkee, IIM Ahmedabad, CPCB, Niti Aayog and other agencies.\n", "\n", "“We have now submitted the report, endorsing certain points of the earlier draft and extending suggestion on other new areas including one on agriculture sector,” said an official, confirming the ministry’s submission.\n", "\n", "Recommendations on agriculture sector have come up for the first time, noting how groundwater is one of the most important water resources in India which contributes 63% of the country’s irrigation needs.\n", "\n", "The ministry suggested that all farmers with individual land holdings of more than three-five hectares of land may be covered under regulation with nominal charges by the CGWA or state authority. If this recommendation is accepted, nearly 10% of country’s total 14.5 crore farmers will come under the ambit of the regulation for groundwater use. \n", "\n", "The ministry in its report also talked about crop diversification so that farmers can switch over from cultivation of water-guzzling crops such as surgarcane and paddy to water efficient farm produce like millets.\n", "\n", "The report also recommended different regulatory rules for water deficit zones, keeping in mind large number of over-exploited blocks in the country. At present, 1,034 blocks (ground water assessment units) out of 6,584 are over-exploited - it means withdrawal of ground water is more than recharge in those particular units. Additionally, 934 blocks are in various stages of ground water criticality.\n", "\n", "\n", "\n"]], "tags": ["groundwater", "water conservation industry", "water conservation fees", "groundwater ngt", "water conservation residential"]},
{"heading": [["242cr trees to be planted under Cauvery project"]], "sub_heading": [[]], "time": [["Last Updated: Sep 02, 2019, 06.17 AM IST"]], "publisher": [["TNN"]], "article": [["NEW DELHI: \"I f economy and ecology doesn't go together, the ecology will go to hell,\" said Sadhguru of ", "Isha Foundation", " ahead of launch of a rally under '", "Cauvery Calling", "' - an ongoing campaign to revitalise the Cauvery river in Tamil Nadu and Karnataka through a massive plantation exercise and bringing farmers on board for switching over to agro-forestry. \n", "\n", "\n", "\"Land is in the hands of farmers. Unless you make it a lucrative process for them, there is really no solution,\" said Sadhguru while noting that he has actually been \"officiating a marriage between economy and ecology\" through people's support.\n", "\n", " During the rally, Sadhguru himself will ride a motorbike along with 25 other riders across the entire length of the river Cauvery. The rally will be flagged off at Talacauvery in Karnataka on September 3 and go all the way to Thiruvarur and culminate in Coimbatore in Tamil Nadu on September 18. \n", "\n", " Idea behind the rally is to raise awareness about urgency to revitalise the forest-fed river Cauvery. There will be several large-scale public events and meetings at major cities and nearly a thousand of farmer engagement programmes along the way. \n", "\n", "This will be followed by action on the ground by supporting farmers to plant 242 crore trees in next 12 years, and thereby touch the lives of over 84 million people in Cauvery Basin in Karnataka and Tamil Nadu.\n", "\n", "Underlining that merely planting trees by individuals, institutions or government is not a solution, Sadhguru said, \"Not that this has no effect. But, this is not a solution. It's like for cancer you put a bandaid...There is huge population pressure on land. If you just talk about saving the world, saving the rivers, it's not going to work.\" He, therefore, emphasised on involving farmers and make them part of the solution where farmers can get benefited by earning more and in the process help the ecology of the Cauvery Basin thrive. \n", "\n", " The Isha Foundation has, during the ongoing 'Cauvery Calling' campaign, been asking farmers to convert at least one-third of their farmland into agro-forestry, which will not only revitalise the river and groundwater and restore soil health, but will also enhance their income 3-8 times in 5-7 years. \n", "\n", "\"This is a tried-and-tested model since we have already been working with 69,760 farmers for over a decade now,\" said Sadhguru. \n", "\n", " Full report on www.toi.in \n", "\n", "In a month long farmer outreach programme, which was started on July 31, the Foundation has touched 2.7 lakh farmers in over 6,500 villages in Cauvery Basin. Over 46% of those farmers have already signed up for agro-forestry - a practice of growing conventional crops with fruits and timber trees in the same farm.\n", "\n", "On a question whether the switch to agro-forestry won't affect the farmers' income in initial years, Sadhguru said the Isha Foundation had already worked out a subsidy plan by calculating farmers' existing income and submitted it to the government. \n", "\n", " He believes that the government's support in initial years would definitely help farmers switch over to planting high-value trees so that they can benefit economically in next 5-7 years. \"The best thing is when problems are staring at our face, solutions are also staring at our face. The question is do we have the wisdom and courage to choose the solution or just go on quarrelling about the problems,\" said Sadhguru. \n", "\n"]], "tags": ["cauvery calling aforestation", "Isha Foundation", "cauvery calling", "Cauvery Calling campaign", "cauvery calling sadhguru"]},
{"heading": [["Time has come for the world to say good-bye to single-use plastic: PM Modi"]], "sub_heading": [[]], "time": [["Last Updated: Sep 09, 2019, 02.15 PM IST"]], "publisher": [["ANI"]], "article": [["GREATER NOIDA: Prime Minister Narendra Modi on Monday said that the time has come for the world to say 'good-bye' to single-use plastic.\n", "\n", "\n", "\"My government has announced that India will put an end to the single-use plastic in the coming years. I believe the time has come for even the world to say good-bye to single-use plastic,\" Prime Minister Modi said while addressing the 14th Conference of Parties (COP14) to United Nations Convention to Combat Desertification (UNCCD).\n", "\n", "The conference is being held at a time when India has assumed the COP Presidency for two years.\n", "\n", "\"India looks forward to making an effective contribution as we take over the COP Presidency for a two-year term,\" Prime Minister Modi added.\n", "\n", "Last month, during his monthly radio address to the nation, 'Mann Ki Baat', the Prime Minister had pitched for launching a \"new mass movement\" against single-use plastic from October 2, the birth anniversary of Mahatma Gandhi. He also spoke about the initiative during the Independence Day address, urging people to join the movement.\n", "\n", "UNCCD was adopted in Paris on June 17, 1994, and was ratified by 196 countries and the European Union. India ratified the UNCCD Convention in 1996.\n", "\n"]], "tags": ["UN Convention to Combat Desertification", "un Desertification", "desertification modi", "india un cop", "single use plastic modi"]},
{"heading": [["Poachers blamed for killing Gir lion cub"]], "sub_heading": [["A 5-month-old lion cub was killed for its nails and bones by poachers on the outskirts of Gir Wildlife Sanctuary near Liliya in Amreli district, forest wardens said."]], "time": [["Last Updated: Mar 02, 2014, 04.43 AM IST"]], "publisher": [["TNN"]], "article": [["AHMEDABAD: A 5-month-old lion cub was killed for its nails and bones by poachers on the outskirts of ", "Gir Wildlife Sanctuary", " near Liliya in Amreli district, forest wardens said. ", " The mutilated carcass was found with its feet and bones missing. Forest officials suspect poachers cut the feet after trapping and killing the animal. ", " In 2007, eight lions were killed in the sanctuary and in far-flung areas near Palitana by poachers from Madhya Pradesh. The same year, feet and bones of eight lions were found missing. \"In this case too, only the skull and some small bones were still intact,\" said an official of the team of trackers which visited the spot. Lion bones are often used as a substitute for tiger bones in traditional medicines. ", " Late on Friday night, villagers called up the forest department about the legless carcass of a cub. When the officials reached Chandgadh village they found that the cub’s body had been eaten by other animals. ", " \"The carcass was in such a bad condition that it was not possible to ascertain the time of death. It has been sent to the forensic laboratory and a team has also been sent to inspect the spot,\" said C N Pandey, principal chief conservator of forests. ", " Pandey said since the legs are missing, ", "poaching", " cannot be ruled out. Hence, senior forest officials along with the chief conservator of forest (", "wildlife crime", ") have been asked to investigate the case. As the incident has occurred in a revenue area, social forestry officials have also been involved in the investigations. "]], "tags": ["poaching", "Gir Wildlife Sanctuary", "wildlife crime"]},
{"heading": [["As people stay home, Earth turns wilder and cleaner"]], "sub_heading": [["As people across the globe stay home to stop the spread of the new coronavirus, the air has cleaned up, albeit temporarily. Smog stopped choking New Delhi, one of the most polluted cities in the world, and India's getting views of sights not visible in decades."]], "time": [["Last Updated: Apr 22, 2020, 04.34 PM IST"]], "publisher": [["AP"]], "article": [["An unplanned grand experiment is changing Earth.\n", "\n", "As people across the globe stay home to stop the spread of the new ", "coronavirus", ", the air has cleaned up, albeit temporarily. Smog stopped choking New Delhi, one of the most polluted cities in the world, and India's getting views of sights not visible in decades. Nitrogen dioxide pollution in the northeastern United States is down 30%. Rome air pollution levels from mid-March to mid-April were down 49% from a year ago. Stars seems more visible at night.\n", "\n", "\n", "Blog: Level the field - News producers can’t keep incurring the costs while digital platforms drain away profits", "\n", "\n", "People are also noticing animals in places and at times they don't usually. Coyotes have meandered along downtown Chicago's Michigan Avenue and near San Francisco's Golden Gate Bridge. A puma roamed the streets of Santiago, Chile. Goats took over a town in Wales. In India, already daring wildlife has become bolder with hungry monkeys entering homes and opening refrigerators to look for food.\n", "\n", "When people stay home, Earth becomes cleaner and wilder.\n", "\n", "\"It is giving us this quite extraordinary insight into just how much of a mess we humans are making of our beautiful planet,'' says conservation scientist ", "Stuart Pimm", " of Duke University. ``This is giving us an opportunity to magically see how much better it can be.''\n", "\n", "\n", "Read our coronavirus live blog for all the latest news and updates", "\n", "\n", "Chris Field, director of the ", "Stanford Woods Institute for", " the Environment, assembled scientists to assess the ecological changes happening with so much of humanity housebound. Scientists, stuck at home like the rest of us, say they are eager to explore unexpected changes in weeds, insects, weather patterns, noise and light pollution. Italy's government is working on an ocean expedition to explore sea changes from the lack of people.\n", "\n", "\"In many ways we kind of whacked the Earth system with a sledgehammer and now we see what Earth's response is,'' Field says.\n", "\n", "Researchers are tracking dramatic drops in traditional air pollutants, such as nitrogen dioxide, smog and tiny particles. These types of pollution kill up to 7 million people a year worldwide, according to Health Effects Institute president Dan Greenbaum.\n", "\n", "The air from Boston to Washington is its cleanest since a NASA satellite started measuring nitrogen dioxide,in 2005, says NASA atmospheric scientist Barry Lefer. Largely caused by burning of fossil fuels, this pollution is short-lived, so the air gets cleaner quickly.\n", "\n", "\n", "\n", "\n", "Coronavirus pandemic: Complete Coverage", "21-day lockdown: What will stay open and what won't", "How to quarantine yourself at home", "Trust the newspaper for your daily verified news", "\n", "\n", "Compared to the previous five years, March air pollution is down 46% in Paris, 35% in Bengaluru, India, 38% in Sydney, 29% in Los Angeles, 26% in Rio de Janeiro and 9% in Durban, South Africa, NASA measurements show.\n", "\n", "\"We're getting a glimpse of what might happen if we start switching to non-polluting cars,'' Lefer says.\n", "\n", "Cleaner air has been most noticeable in India and China. On April 3, residents of Jalandhar, a city in north India's Punjab, woke up to a view not seen for decades: snow-capped Himalayan peaks more than 100 miles away.\n", "\n", "Cleaner air means stronger lungs for asthmatics, especially children, says Dr. Mary Prunicki, director of air pollution and health research at the Stanford University School of Medicine. And she notes early studies also link coronavirus severity to people with bad lungs and those in more polluted areas, though it's too early to tell which factor is stronger.\n", "\n", "The greenhouse gases that trap heat and cause climate change stay in the atmosphere for 100 years or more, so the pandemic shutdown is unlikely to affect global warming, says Breakthrough Institute climate scientist Zeke Hausfather. Carbon dioxide levels are still rising, but not as fast as last year.\n", "\n", "Aerosol pollution, which doesn't stay airborne long, is also dropping. But aerosols cool the planet so NASA climate scientist ", "Gavin Schmidt", " is investigating whether their falling levels may be warming local temperatures for now.\n", "\n", "Stanford's Field says he's most intrigued by increased urban sightings of coyotes, pumas and other wildlife that are becoming video social media staples. Boar-like javelinas congregated outside of a Arizona shopping center. Even New York City birds seem hungrier and bolder.\n", "\n", "In Adelaide, Australia, police shared a video of a kangaroo hoping around a mostly empty downtown, and a pack of jackals occupied an urban park in Tel Aviv, Israel.\n", "\n", "We're not being invaded. The wildlife has always been there, but many animals are shy, Duke's Pimm says. They come out when humans stay home.\n", "\n", "For sea turtles across the globe, humans have made it difficult to nest on sandy beaches. The turtles need to be undisturbed and emerging hatchlings get confused by beachfront lights, says David Godfrey, executive director of the ", "Sea Turtle Conservancy", ".\n", "\n", "But with lights and people away, this year's sea turtle nesting so far seems much better from India to Costa Rica to Florida, Godfrey says.\n", "\n", "\"There's some silver lining for wildlife in what otherwise is a fairly catastrophic time for humans,'' he says.\n", "\n", "\n"]], "tags": ["Gavin Schmidt", "stanford woods institute for", "duke university .", "Stuart Pimm", "coronavirus", "Sea Turtle Conservancy"]},
{"heading": [["Five lakh fruit trees to be planted across India on Environment Day"]], "sub_heading": [[]], "time": [["Last Updated: May 08, 2020, 03.25 PM IST"]], "publisher": [["PTI"]], "article": [["DEHRADUN: Around five lakh fruit trees will be planted across the country on the World ", "Environment Day", " on June 5.\n", "\n", "\n", "The plantation drive will be undertaken by two NGOs from India and the US.\n", "\n", "The Dehradun-based ", "Sustainable Green Initiative", " and the United States-based ", "One Tree Planted", " will execute the programme together with the involvement of local communities in the land of small and marginal farmers countrywide, SGI founder Raj Mohan said.\n", "\n", "Trees to be planted during the drive include moringa, papaya, banana, lemon, guava, apricot, pear, peach and jujubes, he said.\n", "\n", "The SGI has planted 30,100 fruit trees in ten villages in Saklana range of Uttarakhand's Tehri Garhwal district, he said.\n", "\n", "The initiative is intended to not just expand the green cover but also create sustainable livelihood for the rural populace.\n", "\n", "Fruit trees will not only provide nourishment but also supplement income of small farmers, he said.\n", "\n", "Moringa, papaya, and banana trees can produce food and fruit within 8-10 months of planting. Lemon, guava, apricot, pear, peach, and jujubes produce fruit in their third year and onwards, he said.\n", "\n", "The long-term benefit is immense. Each tree provides a minimum of Rs 1000 per year, half a million fruit trees translate into Rs 50 crore worth of fruit and nutrition, year after year for the next 50-60 years, the SGI founder said.\n", "\n", "Beyond the nutritional and social benefits of reforestation with fruit trees, this project will support cleaner air and help reduce the effects of climate change.\n", "\n", "The planting and nurturing of fruit trees will be executed by local partners at Sustainable Green Initiative with whom One Tree Planted has already planted over 300,000 trees throughout India. \n", "\n"]], "tags": ["environment day fruit tree plantation", "environment day", "environment day tree plantation", "Sustainable Green Initiative", "one tree planted"]},
{"heading": [["Important to implement environmental rules to sustain gains of lockdown: Javadekar"]], "sub_heading": [[]], "time": [["Last Updated: May 18, 2020, 09.24 AM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: To sustain the environmental \"gains\" of the coronavirus lockdown during normal times, it is important that the states and the union territories should strictly implement relevant rules governing pollution, Union environment minister ", "Prakash Javadekar", " has said.\n", "\n", "\n", "Due to the unforeseen situation arising out of COVID-19, there has been a significant reduction in industrial activity, vehicular movement and construction activities due to which air and water quality have improved, he said in a letter to the states and the UTs, urging them to strive for this benchmark in normal times too.\n", "\n", "\"As normal life will resume, it would become more and more challenging to sustain current environmental gains but we have a chance to prove that we can have a much improved environment even during normal activities.\n", "\n", "\"This is a challenge which will have to be met by state authorities by strict enforcement of environmental norms and rules and regulations governing pollution. We must look at the quantum improvement in things like waste management, industrial discharge, river quality and emission levels,\" Javadekar said.\n", "\n", "He said various reports have pointed out that there has been a significant improvement in the air and the water quality besides the reduction in noise pollution during the lockdown.\n", "\n", "\"This is the benchmark that we need to strive for even in the normal times with majority of our activities going on,\" the minister said in the letter.\n", "\n", "He said there was a need for creating more environmental awareness among the people who can appreciate a qualitative change in environmental health through better lifestyle management.\n", "\n", "\"I look forward to work with you to drive the idea of sustaining development in conjunction with conservation of environment, based on the foundation of sustainable lifestyle management rooted in Indian philosophy of living in harmony with nature. I request you to ask all concerned departments to implement all the relevant rules, monitor them and try to sustain the gains,\" he said.\n", "\n"]], "tags": ["javadekar environment", "Prakash Javadekar", "environment lockdown", "lockdown pollution", "javadekar lockdown"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["modi at unccd cop14", "Narendra Modi", "rio convention", "climate change issues", "Conference of Parties", "PM Modi"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["modi at unccd cop14", "Narendra Modi", "rio convention", "climate change issues", "Conference of Parties", "PM Modi"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["modi at unccd cop14", "better crop", "rio convention", "climate change issues", "Conference of Parties", "PM Modi"]},
{"heading": [["PM Modi impressed by solar-powered Kochi airport"]], "sub_heading": [[]], "time": [["Last Updated: Jun 09, 2019, 11.41 AM IST"]], "publisher": [["PTI"]], "article": [["KOCHI: Impressed by the fully solar-powered operations at the Cochin International Airport, Prime Minister Narendra Modi has said it should be an inspiring model for energy guzzlers and suggested that stadiums can tap the natural resource for achieving power neutrality.\n", "\n", "\n", "During his brief stopover visit on Saturday, Modi hailed the Cochin International Airport Limited (CIAL) for being the world's first fully solar-powered airport, a statement issued by the ", "CIAL", " said here on Sunday.\n", "\n", "During a discussion with CIAL Managing Director V J Kurian, the prime minister endorsed the effort in tapping green energy for operating the airport, which has won it the United Nations Champions of the Earth award in 2018, the statement said.\n", "\n", "The CIAL model of solarisation should inspire all other high-energy consumers, Modi said, adding that the possibilities of laying solar panels at probable locations needed to be explored. He also suggested that the roof of the galleries of stadiums could be used for that.\n", "\n", "\"Achieving power neutrality for big energy consumers is important for our country,\" the CIAL statement quoted the prime minister as having said.\n", "\n", "Modi also instructed the CIAL to render its expertise for a massive deployment of solar energy, in tune with the International Solar Alliance (ISA), an organisation of 78 countries which was formed by his initiative.\n", "\n", "As part of the ISA's project, envoys of 40 countries visited the CIAL's solar power plants last month.\n", "\n", "The prime minister was in Kerala on Saturday. He offered prayers at the famous Lord Krishna temple at Guruvayur in Thrissur district.\n", "\n", "Modi met the CIAL officials before leaving for Maldives from the airport here on Saturday afternoon.\n", "\n", "The CIAL at present is one of the largest green energy companies in the country with a total installed capacity of 40 MWp.\n", "\n", "The airport, on an average, receives 1.62 lakhs units of power a day from the solar plant, whereas the daily consumption stands at around 1.52 lakhs units.\n", "\n", "The airport achieved the status of power neutrality in August, 2015.\n", "\n", "The statement said Kurian handed over a memento and a brochure to the prime minister, which includes his tweets on the CIAL.\n", "\n"]], "tags": ["modi kochi", "modi kochi airport", "cial solar ower", "kochi airport solar", "cial"]},
{"heading": [["Forest areas being 'finished' due to concretisation, says SC"]], "sub_heading": [[]], "time": [["Last Updated: Sep 12, 2019, 07.25 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Forest areas across the country like Pachmarhi and Gir are \"finished\" due to urbanisation and construction of five-star hotels for which politicians, social workers and even courts are \"responsible\", the Supreme Court said on Thursday.\n", "\n", "\n", "Expressing serious concern over degradation of such eco-sensitive places, the apex court stressed that there is a need to \"protect the forests\" and made reference of such places in Rajasthan, Gir National Park in Gujarat and Pachmari biosphere reserve in Madhya Pradesh where hotels and resorts have come up inside the forest areas.\n", "\n", "\"Have you gone to Pachmarhi? You have finished Pachmarhi. We are responsible for this. The courts are responsible, you are responsible. It was least expected from social workers, politicians, courts and others. Pachmarhi has gone,\" a bench headed by Justice Arun Mishra said.\n", "\n", "\"The forest needs to be protected,\" it added.\n", "\n", "The apex court was hearing a matter related to eviction of around 11.8 lakh alleged illegal forest dwellers and tribals across the country.\n", "\n", "The bench said that sometimes even the tribals residing in forest areas have been found transferring their land for building hotels and other commercial establishments.\n", "\n", "\"Sometimes even the tribals are found transferring their lands to them. Do not compel us to say anything more. We all know what is happening in these places,\" said the bench, also comprising justices M R Shah and B R Gavai.\n", "\n", "Senior advocate Colin Gonsalves, appearing for tribal organisations opposing eviction, told the bench that those indulging in construction activities inside forest areas should be evicted but millions of innocent tribals cannot be thrown out like this.\n", "\n", "Terming it as \"quite an important issue\", the bench said it would hear final arguments in the matter on November 26.\n", "\n", "The top court was informed that nine states and Union Territories (UTs) have filed affidavits giving requisite details, including on the procedure adopted in rejecting the claims of tribals over the forest land.\n", "\n", "Gonsalves told the bench that these states and UTs have said in their affidavits that \"claims were wrongly rejected\".\n", "\n", "The counsel representing the Forest Survey of India (FSI), which was earlier asked by the apex court to make a satellite survey and place on record encroachment positions in forest areas, said they have not received information from all the states and union territories.\n", "\n", "The FSI's counsel said they have communicated with 30 states and UTs but have received information from 11 only.\n", "\n", "\"You collect the information from other states also,\" the bench said and granted FSI time till October 30 for this.\n", "\n", "Senior advocate Shyam Divan, appearing for one of the parties, told the bench that responses filed by the states and UTs are \"very inadequate\" and at least those, whose claims over the forest lands have been rejected, should be removed.\n", "\n", "\"We will see what is the process followed (for rejecting the claims). Second issue is that we must take a final call on this,\" the bench observed.\n", "\n", "Divan told the bench that FSI has said that it would take 16 years to complete the satellite survey as they have limited manpower and resources.\n", "\n", "Divan said they have filed an application seeking a direction to the Centre to release funds to FSI so that it can be done as soon as possible.\n", "\n", "\"To preserve our forest and wildlife, action has to be taken as per the statute,\" he said, adding, \"We have placed on record the satellite imagery both before the Act (Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006) and after the Act. Whole areas have been wiped out\".\n", "\n", "The bench issued notice on the application and asked the Centre to respond to it.\n", "\n", "Gonsalves, while referring to the Centre's affidavit filed in the case, argued the government has said that claims were wrongly rejected throughout the country.\n", "\n", "At the fag end of hearing, Gonsalves said that Prime Minister Narendra Modi had recently said in a conference that forest cover in India has increased by one million hectare in last four-five years.\n", "\n", "The bench observed, \"Forest cover has increased because of afforestation\".\n", "\n", "The top court had on August 6 observed that nine states have not followed the procedure in rejecting claims of tribals over the forest land.\n", "\n", "It had earlier stayed its February 13 order directing 21 states to evict 11.8 lakh illegal forest dwellers whose claims over the forest land have been rejected by the authorities.\n", "\n", "The Centre had rushed to the top court for modification of the February 13 order saying the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006 was a \"beneficial\" legislation and should be construed liberally to help \"extremely poor and illiterate people\" who are not well informed of their rights and procedure under the law.\n", "\n", "The apex court had directed that authorities would also examine whether the state-level monitoring committee, which ensure that no tribal is displaced except in compliance with the formalities under the 2006 Act, were involved in the process when the claims were rejected.\n", "\n", "\n"]], "tags": ["supreme court forest", "supreme court concretisation", "supreme court panchmarhi", "supreme court deforestation"]}
]