[
{"heading": [["Sterling and Wilson Solar commissions its first Solar project in Oman"]], "sub_heading": [["Sterling and Wilson Solar Limited (SWSL) has become the first Indian company to commission a solar photovoltaic (PV) project in this region, a company release said."]], "time": [["Last Updated: Jun 02, 2020, 02.30 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Sterling and Wilson Solar on Tuesday said it has commissioned its first 125-MW ", "solar energy project", " in ", "Oman", ".\n", "\n", "Sterling and Wilson Solar Limited (", "SWSL", ") has become the first Indian company to commission a solar photovoltaic (PV) project in this region, a company release said.\n", "\n", "\"Being a dominant player in the Middle East, this project marks our entry in the Oman market, which supports the government's vision for a clean and sustainable future,\" said Bikesh Ogra – Director and Global CEO, Sterling and Wilson Solar.\n", "\n", "Sterling and Wilson Solar Ld (SWSL) had received the order from Amin Renewable Energy Company SAOC.\n", "\n", "The Amin Solar PV project is supported by the Japanese-Omani consortium designed by Marubeni Corporation, Oman Gas Company S.A.O.C., Bahwan Renewable Energy Company LLC and Nebras Power.\n", "\n", "The Amin solar project, with installed capacity of 125 MW (DC), is Oman's first renewables-based independent power project, it said.\n", "\n", "It is also the biggest single-unit solar park in the world to use bifacial modules, which generate less heat and can withstand the desert temperature fluctuations.\n", "\n", "Sterling and Wilson Solar has commissioned a series of high-performing solar power projects globally and has to its credit around 9.2 GWp projects in various geographies.\n", "\n", "This portfolio includes a 1,177 MWp solar project in Abu Dhabi - one of the worlds largest single location Solar PV plants.\n", "\n", "SWSL also manages a portfolio of 7.4 GWp of O&M projects globally.\n", "\n"]], "tags": ["Photovoltaic power station", "Solar energy project", "Sterling and Wilson Solar Ltd.", "SWSL", "oman"]},
{"heading": [["SoftBank-Bharti JV eyes up to $750 million fund-raise"]], "sub_heading": [["SB Energy, renewable energy arm of SoftBank, has mandated Bank of America Merrill Lynch and Barclays to help raise $500-$750 million in SBG Cleantech — it’s 80:20 joint venture with Bharti, multiple people aware of the development said."]], "time": [["Last Updated: May 29, 2020, 11.32 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["SoftBank-backed renewable energy firm ", "SBG Cleantech", " is set to reach out to financial and strategic investors to raise capital to fund its ongoing and pipeline projects in India and the US.\n", " \n", "SB Energy, the renewable energy arm of ", "SoftBank", ", has mandated ", "Bank of America", " Merrill Lynch and Barclays to help raise $500-$750 million in SBG Cleantech, it's 80:20 joint venture with Bharti, multiple people aware of the development said.\n", " \n", "Formal outreach to potential investors – global utilities, infrastructure-focused PE funds, pension and sovereign wealth funds (SWFs) – will start in the coming weeks, they said. \n", " \n", "On offer is the JV's entire global portfolio, except Japan where SoftBank’s renewable projects are owned by a separate entity.\n", " \n", "Confirming the development, a Softbank spokesperson told ET, “SB Energy is exploring potential co-investment partnerships to accelerate growth of its leading renewable energy platform.” Reiterating its commitment to the venture, the person said, “SoftBank is fully committed to its long-term ownership of SB Energy and has no plans to divest the business.” \n", " \n", "Mails to Bharti did not generate a response till press time Thursday. \n", " \n", "SBG Cleantech predominantly has operating assets in India but also has assets across the US, Latin America and Middle East through acquisitions and bidding.\n", "\n", "\n", "\n", "The company claims to have 7.7-gigawatt pipeline of projects in India and will reach its 20-gigawatt target within the next five years. Currently, as per the management, it has nearly 2 GW operating renewable energy capacity in the country, 2 GW under construction, and additional 3,700 MW under “active development” with contracts in hand.\n", "\n", "As on December 2019, the joint ventures partners had made equity financing of $737 million in SBG Cleantech with around $590 million coming from Softbank alone. \n", "\n", "Another $1.2 billion of equity was required then for the pipeline and operational projects to get completed.\n", "\n", "The latest exercise comes after efforts to on-board a marque investor failed as did plans of a bond issuance said people in the know.\n", "\n", "ET had in its January 9 edition reported that SoftBank was in talks with SWFs in the Middle East and Asia, some of whom are limited partners (LPs) of SoftBank Vision Fund, besides Silicon Valley-based technology giants that are big buyers of clean energy for an investment, and was even open to selling a majority stake in the venture. This was part of an ongoing review as parent SoftBank was facing record losses and liquidity pressures.\n", "\n", "SB Energy CEO Raman Nanda had at that time told ET, “As part of business strategy, we review all options to raise external capital, including strategic investments, from time to time.” He had insisted there was absolutely no plan to exit the business even as SoftBank founder ", "Masayoshi Son", " subsequently announced a $40 billion asset sale programme across his technology-telecoms platforms.\n", "\n", "People with direct knowledge on the matter said Softbank had then broad-based those conversations and even approached Brookfield and Actis in India. The discussions fell through predominantly on valuation mismatch, they said. \n", "\n", "According to industry peers, the company’s near-$1-billion leverage in operating projects could be a handicap in attracting investments. “On an average, the debt-Ebitda ratio of most renewable companies are 5.5 times,” CEO of a rival clean energy firm said on condition of anonymity. “In SB Cleantech’s case, it is around eight times. Their high cost structures could prove to be a challenge.”\n", "\n", "\n", "\n", "In 2015, amid much fanfare, SoftBank had teamed up with Bharti Enterprises and Taiwan’s Foxconn Technology Group to form a 70:10:20 alliance to build solar and wind parks and subsequently start manufacturing panels in India to promote Prime Minister Narendra Modi’s push for clean energy and Make in India initiatives. Together they were to invest $20 billion over a 10-year period to set up 20,000 MW, or 20 GW, of clean energy projects, subject to certain conditions. Later, Foxconn exited without investing at all and it became a 80:20 venture.\n", "\n", "The company’s plan to fix tariffs in dollars by negotiating differentiated dollar power purchase agreements (PPAs) and demand for a central guarantee to buy electricity from its plants did not find favour with the government. This came as a setback to Son’s proposal to invest a staggering $1trillion by 2030. \n", "\n", "In India, the company has aggressively chased central government projects participating in auctions by Solar Energy Corporation of India (SECI) and NTPC to bulk its portfolio. It recently won two 600 MW each from state-run NHPC and SECI at Rs 2.55/kwh and Rs 2.50/kwh as renewable prices show a continuous decline. Its partnership with NHPC is aimed at providing affordable, round-the-clock renewable energy in a hybrid combination of solar and hydro. \n", "\n", "In the US, too, the company is looking at a gigawatt of solar parks out of the 1.7 GW platform that it acquired in 2019.\n", "\n", "The Covid-19 pandemic has impacted rollout plans for most solar players in India, including SBG Cleantech, as supplier shutdowns in China have impacted deadlines.\n", "\n"]], "tags": ["SBG Cleantech", "Bharti JV", "bank of america", "Softbank", "Masayoshi Son"]},
{"heading": [["PFC & REC to offer 10-year loans to state discoms at 9.5%"]], "sub_heading": [["A senior government official said that PFC and REC have fixed interest rates under the liquidity package at 8.75% for three-year loans, 9% for five year loans, 9.25% for seven years and 9.5% for 10-year term loans. The interest rates will be valid for the next 60 days."]], "time": [["Last Updated: Jun 01, 2020, 09.19 AM IST"]], "publisher": [[", ET Bureau"]], "article": [[" Power Finance Corp (PFC) and REC Ltd have decided to offer 10-year loans to ", "state distribution utilities", " at 9.5% for the next 60 days under the Rs 90,000 crore liquidity infusion package while the government is considering relaxing working capital borrowing limits of ", "power distribution companies", ". \n", "\n", "Sources said the government is considering relaxing the working capital borrowing limit to the extent required for borrowing under the liquidity infusion scheme, subject to a maximum of 35%-40% of a discom’s previous year’s revenue. \n", "\n", "Currently, banks and financial institutions can lend only 25% of a discom’s revenue in the previous year as working capital. This restriction was imposed after clearance by the Union Cabinet at the time of ", "Ujwal Discom Assurance", " Yojna (Uday) scheme.\n", "\n", "A senior government official said that PFC and REC have fixed interest rates under the liquidity package at 8.75% for three-year loans, 9% for five year loans, 9.25% for seven years and 9.5% for 10-year term loans. The interest rates will be valid for the next 60 days.\n", "\n", "Electricity distribution companies of 8-9 states including Maharashtra for, Telengana, Andhra Pradesh, Uttar Pradesh, Meghalaya, Jammu & Kashmir and Tamil Nadu have expressed interest in borrowing the loans from PFC and REC for about Rs 60,000 crore loans and are likely to complete documentation in 7-10 days, he said.\n", "\n", "Uttar Pradesh is likely to approach the two lenders for Rs 20,000 crore, Tamil Nadu for Rs 18,000 crore, Telengana for Rs 12,000 crore, Andhra Pradesh for Rs 6,500 crore and Maharashtra for Rs 5,000 crore. Some of these states have written to the Union power ministry seeking relaxation of the loan disbursement rules, including easing borrowing limits, he said.\n", "\n", "The relaxation is required as most distribution companies are nearing their borrowing limits while some have already exhausted them.\n", "\n", " \n", "\n", "The liquidity scheme classifies ", "discoms", " into three categories based on their working capital borrowing limits and state government receivables. The loans will be provided to the discoms against guarantees by state governments and will be used to clear liabilities of power generation and transmission companies including renewable generators. \n", "\n", "Discoms, which have headroom for further borrowing within the working capital limits prescribed under Uday will get immediate access to the loans from REC and PFC. Discoms that do not have headroom but have receivables from the state government in the form of electricity dues and undisbursed subsidy will also be eligible for these loans to the extent of receivables from the state government.\n", "\n", "However, discoms that do not have receivables from states or headroom available under the working capital limits imposed under Uday need to ask the Centre for relaxation of the limit.\n", "\n"]], "tags": ["discoms", "state distribution utilities", "PFC & REC", "Renewable Energy Corporation", "ujwal discom assurance", "power distribution companies"]},
{"heading": [["Power consumption dips 14% to 103 BU in May due to coronavirus lockdown"]], "sub_heading": [["However, the slump in power consumption has narrowed down in May to 14.16 per cent from 22.65 per cent recorded April in this year. The entire month of April had witnessed low power demand due to COVID-19 lockdown."]], "time": [["Last Updated: Jun 01, 2020, 01.00 PM IST"]], "publisher": [["PTI"]], "article": [["Power consumption", " in May declined by 14.16 per cent to 103.02 billion units (BU) compared to 120.02 BU a year ago, mainly due to ", "low demand", " amid coronavirus-induced lockdown.\n", "\n", "However, the slump in power consumption has narrowed down in May to 14.16 per cent from 22.65 per cent recorded April in this year. The entire month of April had witnessed low power demand due to COVID-19 lockdown.\n", "\n", "This shows that power consumption has improved after government started giving relaxations for economic activities and mercury soared beyond 45 degree intensifying ", "heat wave", " in the country.\n", "\n", "According to power ministry data, the total electricity consumption was 103.02 billion units in May this year compared to 120.02 BU in same month year ago.\n", "\n", "The data showed that power consumption in April dipped 22.65 per cent to 85.16 billion units (BU) compared to 110.11 BU in the same month a year ago.\n", "\n", "The government had imposed lockdown from March 25 to fight the deadly ", "coronavirus", " in the country. This also resulted in lower commercial and ", "industrial demand", " in April as well as May.\n", "\n", "The peak power demand met in May stood at 166.42 GW (recorded on May 26), which was 8.82 per cent less than 182.55 GW in the same month a year earlier.\n", "\n", "Similarly, the peak power demand met in April stood at 132.77 GW, 25 per cent less than 176.81 GW in the same month a year earlier.\n", "\n", "This also shows that the slump in power demand has narrowed down considerably and it is inching towards normal levels recorded in the period under review last year.\n", "\n", "The peak power demand met is the highest energy supply during the day across the country.\n", "\n", "Besides, lower commercial and industrial demand, the relatively cool weather during April this year played spoil sport. The temperature remained below 40 degree celsius even in the second half of the month.\n", "\n", "However, during May, many relaxations from May 4 to 31, perked up industrial and commercial demand. Besides the rising temperatures due to intense heat wave also increased the power demand.\n", "\n", "The government had started easing out lockdown for economic activities from April 20.\n", "\n", "Industry experts expressed hope about rise in power demand in coming days, with more relaxations in place from June 1 onwards for economic activities and movement of individuals as well across the country.\n", "\n", "Besides further intensifying of heat wave is also expected to push power demand in coming days, they added.\n", "\n"]], "tags": ["heat wave", "low demand", "coronavirus", "industrial demand", "Power consumption"]},
{"heading": [["View: Modi has political capital to reform the power sector"]], "sub_heading": [["Coronavirus has strengthened will for power reform but must be sustained to overcome political hurdles."]], "time": [["Last Updated: May 31, 2020, 11.00 AM IST"]], "publisher": [[", TOI Contributor"]], "article": [["In Prime Minister ", "Narendra Modi", "’s Rs 20-trillion package, power reforms are the most urgent. Electricity prices have long been political prices unrelated to costs, efficiency or morality. For decades, chief ministers took kickbacks on power contracts and forced ", "state electricity boards", " (and, after the break-up of SEBs, the distribution companies or ", "discoms", ") to sell electricity-free or at highly subsidised rates, to farmers and urban dwellers.\n", "\n", "This aimed to win votes without providing the required subsidies from the budget, ruining power systems across India. High industrial tariffs were used to subsidise farmers, but the resultant costly electricity affected the competitiveness of Indian exports, a major problem today.\n", "\n", "Older reforms created electricity regulators to set fair tariffs, but they typically did the bidding of chief ministers. Discoms today have enormous accumulated losses of nearly Rs 1,00,000 crore and have massive arrears of payment to suppliers like ", "Coal India", ", the Railways and equipment manufacturers. Aggregate Commercial and Transmission (ACT) losses, no more than 6% in the best countries, exceeded 40% in India in the 2000s since chief ministers gave no priority to efficiency or checking rampant theft. ", "The Ujjwal Discom Assurance Yojana", " of 2015 was supposed to induce the states to reform their power sectors, check power theft, slash transmission and commercial losses, minimise cross subsidies and restore the health of the discoms. Alas this did not happen.\n", "\n", "Now, Modi’s Rs 20-trillion package allows the states additional borrowing of 2% of GDP, subject to reforms of various sectors including power. To qualify, states must select transmission and generation developers by competitive tender to cut corruption and cronyism; privatise power distribution; improve billing and collection; and check theft. ACT losses are down from a peak of 40% to 18% but must be slashed below 10%. Modi’s Sowbhagya scheme, providing electricity to every household, is socially laudable but has meant a huge expansion of the power network with little revenue, deepening commercial losses.\n", "\n", "It remains to be seen whether the new reforms will have more success than earlier attempts, which were sabotaged by chief ministers. Modi badly needs reforms to accelerate the economy and create jobs. His party also rules most states, including the worst performers like Uttar Pradesh. He could give a new impetus to reforms.\n", "\n", "My visit to Uttar Pradesh last January revealed imaginative political and bureaucratic efforts but huge hurdles too. Sowbhagya provided an additional 12 million connections at huge cost with little revenue. UP energy secretary Arvind Kumar sought to outsource the collection of rural dues. He appointed village level franchisees — ration shopkeepers, bank correspondents, self-help groups and co-operatives — to collect electricity dues for a fee, pass them on to aggregators, and thence to the discoms. These shopkeepers were online, making collection from them simple. This was a promising start.\n", "\n", "Smart metering was unfeasible in rural areas for want of telecom. But smart metering had been initiated in urban areas, enabling remote reading of meters and billing, with electronic payments speeding collection. This also ended meter manipulation and enabled remote disconnections of defaulters. Earlier local mobs would thwart officials from disconnecting defaulters, and an acute police shortage meant thana help was unavailable. Pre-paid electricity cards carrying a 2% discount have been offered to consumers, avoiding the normal security deposit and possible harassment by collectors. Every step was incentive compatible, a good practice.\n", "\n", "Yet problems multiplied. Meter suppliers were scarce, quality was erratic, and shipments delayed. Staff training took time. Checking electricity theft was vital to slash ACT losses. Police thanas were too pre-occupied with major crimes to spare time for electricity theft.\n", "\n", "Modi as CM of Gujarat had created one thana per district dedicated to power theft, dramatically reducing theft. UP and other states are copying this. But they have long met their fiscal targets by not filling vacant posts. In 2019, UP had 1.2 lakh police vacancies out of 2.6 lakh sanctioned posts. Mass recruitment and training has begun to fill the posts, but the police shortage will last a long time, and not enough newcomers can be spared for dedicated power theft thanas. This may take one to two years.\n", "\n", "The accumulated losses of the state discoms keep rising stridently. UP bureaucrats say the only solution is privatisation of discoms, making them commercial and non-political. The Modi package includes privatisation of discoms in Union Territories, and hopefully in BJP-ruled states too. The coronavirus crisis has strengthened the political will for power reform but must be sustained for several years to overcome the many practical difficulties UP has revealed.\n", "\n"]], "tags": ["Narendra Modi", "Coal India", "the ujjwal discom assurance yojana", "Prime Minister of India", "state electricity boards", "BJP", "Smart Communications", "discoms"]},
{"heading": [["NHPC to suffer power generation loss of Rs 119.43 cr due to lockdown"]], "sub_heading": [["The shortage of labour may affect the construction schedule and enhance the completion cost of the project, it added.  At Subansiri Lower, it said all construction work was suspended from March 24 because of lockdown. "]], "time": [["Last Updated: May 29, 2020, 10.29 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: State-run ", "hydro-power", " giant ", "NHPC", " on Friday said it would suffer electricity generation loss of Rs 119.43 crore due to delay in restoration work at its three plants during the lockdown to fight COVID-19. \n", "\n", " \"The restoration schedule of three power stations i.e. ", "Chamera-II Power Station", ", Kishanganga Power Station, ", "Loktak Power Station", " has been affected due to movement restrictions imposed in wake of CoVID-19 pandemic. An estimated loss of Rs 119.43 crore is expected due to anticipated generation loss,\" NHPC said in a statement. \n", "\n", " The construction at its two ", "hydro-electric", " projects, ", "Parbati-II", " and ", "Subansiri", " Lower, also affected due to the lockdown. \n", "\n", " At Parbati-II, the construction activities were completely halted from March 23 to April 22 due to the lockdown announced to contain COVID-19. \n", "\n", " The shortage of labour may affect the construction schedule and enhance the completion cost of the project, it added. \n", "\n", " At Subansiri Lower, it said all construction work was suspended from March 24 because of lockdown. \n", "\n", " The completion time of the project has been affected. The lockdown would also have an impact on the cost of the project, it added.\n"]], "tags": ["Subansiri", "NHPC", "electric projects", "loktak power station", "loktak lake"]},
{"heading": [["Households driving up power demand"]], "sub_heading": [["Electricity demand is inching closer to last year's level but experts feel it is mostly due to hot weather, particularly in the plains of northern India. Andhra Pradesh, Madhya Pradesh, Bihar, Delhi and Uttar Pradesh are closer to last year’s electricity demand level."]], "time": [["Last Updated: May 29, 2020, 07.52 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Rural India and urban households are driving up the consumption for ", "electricity", " and liquid fuels with gradual increase in economic activity but demand remains weak in industrialised regions.\n", "\n", "Peak-hour electricity demand in Punjab last Tuesday was 15% higher at 8,097 megawatts compared to a year ago. Consumption is higher by 3-5% in Haryana and Rajasthan also, but Gujarat, Maharashtra and Tamil Nadu, which have a high number of Covid cases, are lagging behind as industries are yet to operate in full capacity. In the union territories of Dadra & Nagar Haveli, power consumption fell 48%, while in Daman & Diu it fell 37%.\n", "\n", "Electricity demand is inching closer to last year's level but experts feel it is mostly due to hot weather, particularly in the plains of northern India. Andhra Pradesh, Madhya Pradesh, Bihar, Delhi and Uttar Pradesh are closer to last year’s electricity demand level.\n", "\n", "Industrial demand on ", "power exchange", " is substantially lower than the average level but is still about 4-5 times after lockdown restrictions have been eased. Prices on ", "India Energy Exchange", " have been in the range of ₹2.4-2.5 per unit since March.\n", "\n"]], "tags": ["India Energy Exchange", "Sumer", "electricity", "power exchange", "power consumption india"]},
{"heading": [["IndiGrid to Buy Kalpataru Power JV Asset for Rs 310 crore"]], "sub_heading": [["IndiGrid aims to scale up its power transmission assets under management (AUM) to Rs 30,000 crore by 2022 and has plans to diversify into the solar power sector.This will be the second acquisition by IndiGrid from a company other than its original sponsor Sterlite Power. "]], "time": [["Last Updated: May 30, 2020, 05.15 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Private equity firm ", "KKR", " backed infrastructure investment trust ", "India Grid", " Trust, or ", "IndiGrid", ", has signed an agreement to acquire a ", "power transmission", " asset at Jhajjar in Haryana for Rs 310 crore from current owners Kalpataru Power Transmission and Techno Electric & Engineering Company.\n", "\n", "IndiGrid aims to scale up its power transmission assets under management (AUM) to Rs 30,000 crore by 2022 and has plans to diversify into the solar power sector.\n", "\n", "\"This transaction is a major milestone and example of an accretive capital allocation process that KPTL has employed over the past several years. We are also progressing well on sale of other T&D assets and expect to close the same in FY21,\" Manish Mohnot, managing firector and CEO, KPTL said. \n", "\n", "An executive from IndiGrid executive, on the condition on anonymity told ET, \"IndiGrid is moving closer to the vision of having Rs 30,000 crore AUM. It already has Rs 18,000 crore of assets in the pipeline and Rs 12,000 crore have been acquired already. Third-party deals like these will add to that asset base and we aim to diversify into solar power to have 15-20% of our portfolio from that sector eventually.\"\n", "\n", "This will be the second ", "acquisition", " by IndiGrid from a company other than its original sponsor ", "Sterlite Power", ". In May 2019, IndiGrid received investments from KKR and ", "GIC", ", following which IndiGrid is managed by Sterlite Investment Managers which is majority owned by KKR.\n", "\n", "The pact to buy Jhajjar KT Transco Private is subject to approvals and marks the infrastructure investment trust’s first such transaction with Kalpataru Power Transmission. It is the second transaction with Techno Electric & Engineering Company, after acquisition of Patran Transmission Company Limited in August 2018.\n", "\n", "“We will continue to acquire operating assets and for that we are creating partnerships with Kalpataru Power and Techno Electric who actively bid for developing power transmission projects,” said the IndiGrid executive. \n", "\n", "Jhajjar KT Transco is an operational intra-state asset under the ‘design-build-finance-operate and transfer’ model, which evacuates power from the 1,320 megawatt thermal power plant in Jhajjar. The project has a contract for 25 years which can be extended by another 10 years. It has been operational for eight years, with a steady collection track record and receivable cycle of less than a month. \n", "\n", "IndiGrid currently has nine operating projects, which own 20 transmission lines with 5,800 circuit km length and four substations with 7,735 MVA capacity, with total AUM of Rs 12,100 crore. \n", "\n"]], "tags": ["gic", "Deal", "Sterlite Power", "kkr", "indigrid", "Power transmission", "India grid", "acquisition"]},
{"heading": [["Punjab, UP, Rajasthan, evince interest in taking loans to pay gencos: New PFC CMD"]], "sub_heading": [["The company needs to explore new areas of financing such as charging infrastructure and electric vehicles, renewable energy sources with substantial storage and make efforts to tap business from good business houses, , Dhillon who took charge of PFC on Monday said."]], "time": [["Last Updated: Jun 01, 2020, 04.03 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Punjab, Uttar Pradesh, Rajasthan, Manipur and Karnataka have evinced interest to avail loans under the Centre’s Rs 90,000 crore ", "liquidity infusion package", ", Power Finance Corp (", "PFC", ") chairman and managing director Ravinder Singh Dhillon said on Monday adding the Corona virus pandemic posed significant business challenges.\n", "\n", "The company needs to explore new areas of financing such as charging infrastructure and electric vehicles, renewable energy sources with substantial storage and make efforts to tap business from good business houses, , Dhillon who took charge of PFC on Monday said.\n", "\n", "“Apart from affecting our social life, the outbreak of this pandemic and the consequent nation-wide lockdown has also created an unprecedented economic disruption. We are uncertain on how prolonged this situation will be. We all are therefore in an uncharted territory, facing significant and unique business challenges, which we had never imagined. With all these challenges, PFC is clearly at cross roads,” he said.\n", "\n", "Dhillon lauded PFC’s response to the pandemic. “We have all stood together and fought against all odds to make 11,000 Crs disbursement possible in the last 3 days of the FY despite the lockdown. We have also brought out a moratorium policy and liquidity package to help the power sector during these testing times,” he said during his first interaction with the employees.\n", "\n", "ET had on Monday said PFC and REC Ltd have decided to offer 10-year loans to state distribution utilities at 9.5% for the next 60 days under the Rs 90,000 crore liquidity infusion package while the government is considering relaxing working capital borrowing limits of power distribution companies. The package proposes loans from the two lenders to discoms to help them pay there pending power bills. \n", "\n", "Sources said the government is considering relaxing the working capital borrowing limit to the extent required for borrowing under the liquidity in fusion scheme, subject to a maximum of 35%-40% of a discom’s previous year’s revenue. \n", "\n", "Currently, banks and financial institutions can lend only 25% of a discom’s revenue in the previous year as working capital. This restriction was imposed after clearance by ", "the Union Cabinet", " at the time of ", "Ujwal Discom Assurance", " Yojna (Uday) scheme.\n", "\n", "A senior government official said that PFC and REC have fixed interest rates under the liquidity package at 8.75% for three-year loans, 9% for five year loans, 9.25% for seven years and 9.5% for 10-year term loans. The interest rates will be valid for the next 60 days.\n", "\n", "Electricity distribution companies of 8-9 states including Maharashtra for, Telengana, Andhra Pradesh, Uttar Pradesh, Meghalaya, Jammu & Kashmir and Tamil Nadu have expressed interest in borrowing the loans from PFC and REC for about Rs 60,000 crore loans and are likely to complete documentation in 7-10 days, he said.\n", "\n", "\n"]], "tags": ["liquidity infusion package", "Renewable Energy Corporation", "the union cabinet", "PFC", "ujwal discom assurance"]},
{"heading": [["Punjab, Haryana, Rajasthan power demand significantly up; Gujarat, Maharashtra lag behind"]], "sub_heading": [["A state-wise analysis showed that the consumption of electricity in states like Punjab, Haryana and Rajasthan has increased over last year- in both peak-hour demand and energy consumed per day terms, a quick comparison between electricity demand (both peak-hour and energy met) on May 26 this year with May 24, 2019—a corresponding working day last year."]], "time": [["Last Updated: May 29, 2020, 04.13 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Agricultural and domestic consumers in ", "north India", " are pushing India’s electricity demand to last year’s level amid the Covid-19 pandemic, while industrial states like Gujarat and ", "Maharashtra", " wait for further easing of lockdown restrictions. \n", "\n", "The demand for electricity is inching closer to last year's level but experts believe it is mostly due to hot weather conditions, particularly in plains of northern India. \n", "\n", "A state-wise analysis showed that the consumption of electricity in states like ", "Punjab", ", Haryana and Rajasthan has increased over last year- in both peak-hour demand and ", "energy", " consumed per day terms, a quick comparison between electricity demand (both peak-hour and energy met) on May 26 this year with May 24, 2019—a corresponding working day last year – and ", "average demand", " in the week of May 20-26, 2019. \n", "\n", " \n", "\n", "\n", "For example, the peak hour demand in Punjab rose by about 14.4% to 8,097-mw on May 26 this year from 7073-mw on May 24, 2019—a corresponding working day last year. The energy consumed was 14% higher at 184 MUs on May 26 this year against 161 MUs on the corresponding day last year. The growth in demand is much higher than average of 152 MUs registered in the third week of May last year. \n", "\n", "\n", " \n", "\n", "\n", "However, Gujarat, Maharashtra and Tamil Nadu lagged behind as industries are yet to operate on a full scale. Demand for electricity in Andhra Pradesh is closer to last year. \n", "\n", "\n", " \n", "\n", "\n", "The union territories of Dadra & Nagar Haveli posted the maximum reduction in power consumption at 48% in energy terms this month over corresponding period last year. This is followed by Daman & Diu at about 37% less energy consumption. \n", "\n", "\n", " \n", "\n", "\n", "Haryana has posted 2-3% rise in electricity consumption, while Rajasthan posted about 5% increase in the fourth phase of the lockdown. ", "Madhya Pradesh", ", ", "Bihar", ", Delhi and Uttar Pradesh are closer to last year’s electricity demand level. \n", "\n", "India’s energy consumption on May 26 was 3775 million units, against 4,091 MUs about 7.7% less than May 24, 2019. The maximum demand met during May 26 2020 was 166 Gw against 170 GW around the same time last year.\n", "\n", "\n", " \n", "\n", "\n", "The electricity demand is likely to achieve last year's level once the lockdown restrictions are eased. Most industries are operating at low scale while the commercial units still are not functional. \n", "\n", "\n", " \n", "\n", "\n", "Industrial demand on power exchange is substantially low than the average level but is still about 4-5 times after lockdown restrictions have been eased. Prices on ", "India Energy Exchange", " have been in the range of Rs 2.4 – Rs 2.5 per unit since March. \n", "\n"]], "tags": ["Power demand in india", "North India", "punjab", "India Energy Exchange", "average demand", "Bihar", "Madhya Pradesh", "Maharashtra", "Daman & Diu", "energy"]},
{"heading": [["Tata Power to manage power distribution in central Odisha from June 1"]], "sub_heading": [["The five circles consist of Bhubaneshwar, Cuttack, Puri, Paradip and Dhenkanal. As per order issued by the Odisha Electricity Regulatory Commission (OERC) on May 28, 2020, Tata Power will hold 51% equity with management control and the state-owned GRIDCO will have the remaining 49% equity stake in the company, an official statement said."]], "time": [["Last Updated: Jun 01, 2020, 06.32 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Tata Power on Monday said it has taken over the management of electricity distribution of five circles in Odisha, together constituting Central Electricity Supply Utility (CESU) of the state.\n", "\n", "The five circles consist of Bhubaneshwar, Cuttack, Puri, Paradip and ", "Dhenkanal", ". As per order issued by the Odisha Electricity Regulatory Commission (", "OERC", ") on May 28, 2020, Tata Power will hold 51% equity with management control and the state-owned ", "GRIDCO", " will have the remaining 49% equity stake in the company, an official statement said.\n", "\n", "Tata Power said its priority will be to improve reliability, reduce technical and commercial losses and offer quality customer service.\n", "\n", "As per the agreement, the company will retain all the existing employees of CESU. Tata Power has received the license for 25 years. Spread over 30,000 Sq km, CESU has five electrical circles comprising of the areas of Bhubaneswar (Electrical Circle - I and II), Cuttack, Paradip and Dhenkanal with a population of over 1.4 crore and consumer base of 2.5 million. \n", "\n", "Tata Power CEO", " and MD Praveer Sinha said, “Our tie up with CESU is a huge development for Tata Power. We are thankful to ", "the Odisha Government", " and OERC for giving us this opportunity. We constantly strive to become the most preferred distribution company in the country. The success of our Delhi, Mumbai and Ajmer Distribution businesses are testament to this fact.”\n", "\n", "With CESU, Tata Power aims to expand its consumer base to 5 million consumers from the present base of 2.5 million across Mumbai, Delhi and Ajmer. The average demand of CESU is around 1,300MW with the annual input energy of 8,400MUs (FY 2018).\n", "\n", "“Tata Power endeavors to bring about a positive transformation in Odisha by deploying ", "smart grid", " technologies to supply reliable and quality power. Our customer-centric approach aims to enhance all aspects of customer services with smooth and efficient power distribution operations.” said Tata Power President (T &D) Sanjay Banga.\n", "\n"]], "tags": ["The Odisha government", "Smart Grid", "OERC", "Dhenkanal", "Gridco", "tata power ceo"]},
{"heading": [["In biggest consumer-centric reforms, Govt proposes to end power tariff differentiation among consumers"]], "sub_heading": [["Domestic power tariffs are low in India, while the industrial tariffs are among the highest in the world due to cross subsidization. The Tariff Policy proposes six categories of consumers on voltage basis against the present 50-60 categories and sub-categories."]], "time": [["Last Updated: Jun 02, 2020, 08.39 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: India proposes to end ", "tariff differentiation", " between ", "electricity consumers", " by charging them as per their consumption rather than on the basis of the end use of ", "power", ".\n", "\n", "The Centre expects the proposal, along with other proposed National Tariff Policy amendments, will be the biggest consumer-centric reforms.\n", "\n", "Domestic power tariffs are low in India, while the industrial tariffs are among the highest in the world due to ", "cross subsidisation", ".\n", "\n", "The Tariff Policy proposes six categories of consumers on voltage basis against the present 50-60 categories and sub-categories, a senior government official said.\n", "\n", "States, however, are apprehensive that the policy could be difficult in implementing though the Centre had consulted them before finalising it.\n", "\n", " \n", "\n", "The other proposals of the tariff policy include laying service standards for power distribution companies (discoms) including ", "24x7 power supply", ", penalising gratuitous load shedding and ban on passing on more than 15% of commercial losses to consumer tariffs. \n", "\n", "The policy also proposes direct benefit transfers to agricultural and rural consumers and reduction of cross subsidies on large open access consumers to 20% within four years.\n", "\n", "The amendments to the National Tariff Policy, which have been approved by a group of ministers (GoM) led by defence minister Rajnath Singh, is expected to be taken up by the Union Cabinet next week. “The changes to ", "the National Tariff Policy", " have been finalised and the policy is likely to be sent to Cabinet for approval. The inter-ministerial consultations were held earlier,” the government official said.\n", "\n", "The policy proposes to simplify categorisation of electricity consumers by fixing tariff on the basis of quantity consumed against the present system of differentiating on the basis of land use, another official said.\n", "\n", "“We propose to move to tariff categories on voltage basis, not on the basis of land use. The latter is subject to interpretation. Agriculture will be dealt separately for which the Tariff Policy proposes giving direct benefit transfer,” he said.\n", "\n", "There are a lot of residential buildings where there is mixed land use. For example, people run IT companies, coaching centres, kirana stores and salons from home. Their categorisation is subject of interpretations and leads to consumer harassment and corruption, the second official quoted above said.\n", "\n", "“The proposed policy aims at eliminating this ‘inspector raj’. We don’t distinguish between a commercial taxi or a private vehicle for diesel. Why should the cost of power be different? Higher the load, the higher you pay,” he said.\n", "\n", "The first official said the voltage-based tariff fixation would be on technical basis, which is measurable.\n", "\n", "\n"]], "tags": ["electricity consumers", "cross subsidisation", "tariff differentiation", "power", "24X7 power supply", "the national tariff policy"]},
{"heading": [["Lockdown delayed project execution, led to cost escalation: Adani Transmission"]], "sub_heading": [["According to the filing, delay in getting multiple regulatory approval, that is ROW (right of way), forest approvals, wildlife, defense, civil aviation and power and transmission line crossing will delay the SCOD (scheduled commercial operation date), leading to cost escalation. "]], "time": [["Last Updated: Jun 01, 2020, 10.15 PM IST"]], "publisher": [["PTI"]], "article": [["Adani Transmission", " on Monday said the coronavirus-induced lockdown has delayed execution of its under-construction projects and escalated costs. The company is also worried that 25 per cent of its earmarked ", "capital expenditure", " for FY21 would remain unutilised. \n", "\n", " \"The continued lockdown has also resulted in migration of resources affecting project execution work due to non-availability of work force and disruption of allied services,\" it said in regulatory filing. \n", "\n", " According to the filing, delay in getting multiple regulatory approval, that is ROW (right of way), forest approvals, wildlife, defense, civil aviation and power and ", "transmission line crossing", " will delay the ", "SCOD", " (scheduled commercial operation date), leading to cost escalation. \n", "\n", " \"In view of lockdown disruption, our suppliers, contractors and resources down the line have not been able to perform their obligation and this may likely get further extended, for which extension of time has been provided to them. This will result in delay of COD (commercial operation date) beyond our control,\" it said. \n", "\n", " \"Owing to the uncertainty in the availability of the labour force and moderate delay in key materials, and moderate hurdles in the availability of technical specialists of vendors, we envisage that roughly 25 per cent of the planned capex (capital expenditure) will be unutilized. The unutilized capex will impact the targeted EBITDA & Regulated Asset Base for FY21,\" it added. \n", "\n", " The government, on March 25, imposed a 21-day nationwide lockdown to fight ", "COVID-19", " pandemic, and has been gradually relaxing the guidelines for restarting economic activities.\n"]], "tags": ["scod", "adani construction project", "Adani Transmission", "transmission line crossing", "capital expenditure", "coronavirus", "covid lockdown"]},
{"heading": [["Tata Power eyes Rs 3,000-crore divestment, revamp of green assets to cut debt"]], "sub_heading": [["The company, which has an installed capacity of 12,742 MW, aims at raising Rs 3,000 crore from divestment of assets in 2020-21, despite the disruption caused by Covid-19 pandemic in the global economy, managing director Praveer Sinha told ET. "]], "time": [["Last Updated: Jun 02, 2020, 09.09 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: ", "Tata Power", " Company hopes to raise about Rs 3,000 crore from divestment of non-core operations and restructuring the ", "renewable energy business", " with an aim to cut debt by at around 40% this financial year.\n", "\n", "The company, which has an installed capacity of 12,742 megawatts, hopes to raise the divestment proceeds despite the disruption caused by the ", "pandemic", ", in the global economy, Chief Executive Officer and Managing Director Praveer Sinha told ET.\n", "\n", "“Our attempt is to reduce the debt to the levels of Rs 25,000 crore by the end of this fiscal year from Rs 44,000 crore; it is an indicative target. We are looking at various means to do it. We have already started our divestment process,” Sinha said. \n", "\n", "In April, Tata Power Company completed the sale of its 50% stake in South African ", "wind power", " company Cennergi to joint venture partner Exxaro Resources for Rs 660 crore. It is already in a pact to sell its stake in PT Arutmin Indonesia, and is now in talks to sell its stake in its asset in Zambia, BSSR coal mine in Indonesia and its shipping business.\n", "\n", "“Even in this challenging environment, we received the money for our deal in South Africa. We are in the final stages of signing the deal for the sale of our shipping company and hopefully we will get the payment by June end,” Sinha said. \n", "\n", "Over a decade ago, Tata Power invested in coal mines and shipping facilities to ensure backward integration and also diversified its global presence by investing in power assets overseas. But changes in the macro-economic environment and rising debt made the company change its strategy. The company has reduced its debt-to-equity ratio from 2.19 to 1.99 in FY20 and aims to reduce it to below 1.5 in FY21. \n", "\n", "“We will restructure our renewable energy business this year; we have not yet finalised the structure for it. But we will definitely look at de-consolidation, so that Rs 11,000 crore of debt on renewable assets moves out of the company’s balancesheet,” Sinha said.\n", "\n", "The lockdown due the pandemic has delayed the signing of agreements for revised tariff for its loss-making Mundra unit. Sinha said that two of the key power procurers from the project-- Gujarat and Maharashtra - have agreed and the other discoms are likely to get on board once the discussions resume. He also said that the government’s decision to inject Rs 90,000 crore liquidity into discoms has come as a big relief for the cash-strapped sector.\n", "\n", "“Liquidity was a challenge in the sector. The industrial and commercial consumers consume about 30-35% of our volumes but their revenue accounts for 55-60% of total revenue, so their inability to pay is impacting the discoms and restricting their ability to pay generation and transmission companies. The move to inject Rs 90,000 crore into state discoms is a welcome step as it will pump in money directly into the system,” Sinha said. \n", "\n", "Separately, Tata Power took over the management of Central Electricity Supply Utility of Odisha (CESU) management on Monday, after it emerged as the winner for bids for license to supply electricity to five circles in the coastal state.\n", "\n"]], "tags": ["wind power", "renewable energy business", "Tata Power", "pandemic"]},
{"heading": [["Centre notifies land acquisition process for laying oil pipeline"]], "sub_heading": [["The Centre on Wednesday has notified the process for land acquisition for the 486-km long oil pipeline from Mundra to the upcoming refinery at Pachpadra in Barmer, Rajasthan whose ground-breaking ceremony was done by Prime Minister Narendra Modi in 2018."]], "time": [["Last Updated: May 28, 2020, 08.59 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The Centre on Wednesday has notified the process for land acquisition for the 486-km long oil pipeline from Mundra to the upcoming refinery at Pachpadra in Barmer, Rajasthan whose ground-breaking ceremony was done by Prime Minister Narendra Modi in 2018.\n", "\n", "The HPCL Rajasthan Refinery Limited (HRRL) refinery at Barmer will comprise of a 9.0 mmtpa grass root refinery and petrochemical complex and it is proposed to expand the refinery capacity from 9.0 to 18.0 mmtpa — which will be one of the largest in the country. \n", "\n", "The refinery complex is designed to process a mix of Rajasthan crude oil & Arab Mix crude (Arab Heavy (AH): Arab Light (AL); 50:50) and future option of refinery operation on Arab Mix (AM) & Maya/Doba is also envisaged. The project also involves designing ", "Crude Oil Terminal", " (COT) facilities for storage and handling of Maya/Doba crude in the future.\n", "\n"]], "tags": ["rajasthan crude oil & arab mix", "Iranian calendars", "crude oil terminal", "hindustan petroleum", "Barmer district"]},
{"heading": [["Government seeks USD 520 million from Cairn Oil & Gas; company slaps arbitration notice"]], "sub_heading": [["Cairn is the operator of Rajasthan block with 70 per cent interest while the balance is held by state-owned Oil and Natural Gas Corp (ONGC)."]], "time": [["Last Updated: May 28, 2020, 03.56 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The government has slapped a USD 520 million (around Rs 3,941 crore) demand notice on billionaire ", "Anil Agarwal", "'s oil and gas unit Cairn after an audit found alleged discrepancies in cost recovery in the Rajasthan oil and gas fields operated by the company, sources said adding the firm has disputed the demand and initiated arbitration proceedings.\n", "\n", "The ", "Directorate General of Hydrocarbons", " (DGH), the upstream technical arm of the ", "Ministry of Petroleum and Natural Gas", ", sought USD 520 million in additional profit petroleum for the government after an audit of capital and operating expenses incurred on the Mangala and other oilfields in the Rajasthan block RJ-ON-90/1, sources with direct knowledge of the development said.\n", "\n", "The audit alleged discrepancies in the way capital expenses made on setting up the infrastructure to produce oil were booked.\n", "\n", "The law provides for operators recovering all the capital and operating cost from revenues earned from the sale of oil and gas before sharing a fixed percentage of profit with the government. Booking a higher expenditure curtails government's profit share.\n", "\n", "Cairn Oil and Gas, a vertical of Agarwal-controlled Vedanta Ltd, earlier this month sent an arbitration notice, disputing the demand, they said.\n", "\n", "A company spokesperson declined to comment.\n", "\n", "Cairn is the operator of Rajasthan block with 70 per cent interest while the balance is held by state-owned Oil and Natural Gas Corp (", "ONGC", ").\n", "\n", "ONGC is not a part of the arbitration but will have to abide by whatever award of the dispute resolution proceeding comes out, sources said adding the company will have to pay 30 per cent of the USD 520 million demand in case the arbitration panel upholds the DGH demand.\n", "\n"]], "tags": ["cairn oil & gas", "Ministry of petroleum and natural gas", "Directorate General of Hydrocarbons", "ONGC", "anil agarwal"]},
{"heading": [["NTPC begins search for CEO of distribution business"]], "sub_heading": [["State-owned power giant NTPC said it has started the process for recruiting a Chief Executive Officer (CEO) for its electricity distribution business. "]], "time": [["Last Updated: Jun 02, 2020, 02.34 PM IST"]], "publisher": [["PTI"]], "article": [["State-owned power giant NTPC said it has started the process for recruiting a ", "Chief Executive Officer", " (CEO) for its electricity distribution business. Last week NTPC had announced its plan to foray into electricity distribution business and also offered to acquire 51 per stake in two utilities of Anil ", "Dhirubhai Ambani", " Group (ADAG) in Delhi. \n", "\n", " In a letter to ", "the Delhi Electricity Regulatory Commission", " (DERC), NTPC had said it has learnt that ADAG wants to divest its 51 per cent stake in BSES Rajdhani Power Ltd (BRPL) and BSES Yamuna Power Ltd (BYPL), and the company is keen on acquiring the distribution assets. \n", "\n", " This assumes significance because NTPC is primarily power-generation company. \"NTPC is looking for a dynamic experienced professional as CEO of distribution business,\" the company said in an advertisement. While the upper age limit of an applicant is 55, he or she must be holder of a degree in mechanical/electrical engineering from a recognised university or institution. \n", "\n", " In terms of experience, the applicant should have 25 years of experience including in-depth exposure of distribution business, besides experience of developing and expanding business, exposure on profit and loss account, and knowledge of commercial aspects of power industry, electricity regulations and related aspects of distribution business. \n", "\n", " The appointment shall be on a fixed-term basis for a period of three years and the last date to submit entries is June 15, 2020. NTPC, formerly known as National Thermal Power Corporation Limited, is India's largest power conglomerate with an installed capacity of 62,110 MW. The company has an ambitious plan to attain a total installed capacity of 130 GW by 2032.\n"]], "tags": ["NTPC Limited", "Anil Dhirubhai Ambani Group", "Chief Executive Officer", "dhirubhai ambani", "the Delhi Electricity Regulatory Commission"]},
{"heading": [["China, India soak up oil from floating storage as demand recovers"]], "sub_heading": [["A total of 3.4 million tonnes (24.8 million barrels) of crude oil was discharged from floating storage into Asian markets in the past seven days, with China the top destination at 1.8 million tonnes and India second at 842,679 tonnes, according to oil analytics firm Vortexa."]], "time": [["Last Updated: May 28, 2020, 06.49 PM IST"]], "publisher": [["Reuters"]], "article": [["SINGAPORE: The volume of crude stored on ships in Asia has come off the peaks seen earlier this month on a recovery in demand in China and India, ", "trade sources", " and analysts said.\n", "\n", "A total of 3.4 million tonnes (24.8 million barrels) of ", "crude oil", " was discharged from floating storage into Asian markets in the past seven days, with China the top destination at 1.8 million tonnes and India second at 842,679 tonnes, according to oil analytics firm ", "Vortexa", ".\n", "\n", "Robust demand from China, the world's top oil importer, and OPEC+ production cuts supported crude prices this month while the Brent's contango price spread <LCOc1-LCOc7> that previously encouraged traders to store oil for future sales to reap higher prices has also narrowed.\n", "\n", "\"Rising crude prices and narrowing (Brent) contango with the tightening of the crude market are nibbling away incentives of storing crude on tankers,\" said Vortexa's analyst Serena Huang.\n", "\n", "Data from oil analytics firm ", "Kpler", " showed that floating storage volumes in Chinese waters came off a peak of 35.4 million barrels on May 23 to 29.4 million barrels as of May 26.\n", "\n", "Oil majors and trading houses have been offering Middle Eastern and West African oil stored at sea as spot prices strengthened in Asia, trade sources said.\n", "\n", "Refiners are buying on hopes of a fuel demand recovery as more countries ease ", "coronavirus", " restrictions, and on anticipation that crude prices and freight rates may rise further, they said, although refining margins remained weak, limiting refiners' ability to raise output.\n", "\n", "\"While we're seeing signs of global demand recovery, we're still in the early days of a long road to full recovery, and the outlook remains uncertain on whether there could be a second wave of coronavirus,\" Huang said.\n"]], "tags": ["Crude oil", "vortexa", "trade sources", "coronavirus", "Brent crude", "Opec", "kpler", "oil prices"]},
{"heading": [["Baghjan well blowout: Dharmendra Pradhan takes stock of situation"]], "sub_heading": [["Pradhan had a detailed discussion with CMDs of OIL as well ONGCL. In a statement Oil India Limited (OIL) stated expressing his concern over the incident, Pradhan advised OIL to take all necessary steps to ensure the health and safety of the local population."]], "time": [["Last Updated: May 30, 2020, 12.38 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["GUWAHATI: ", "Dharmendra Pradhan", ", Union Minister for ", "Ministry of Petroleum and Natural Gas", " took stock of ", "the Baghjan Blowout", " in Assam. OIL team along with ", "Crisis management", " team from ", "ONGCL", " and an expert team from ONGCL, Vadodara are working to mitigate the situation.\n", "\n", "He had a detailed discussion with CMDs of OIL as well ONGCL. In a statement Oil India Limited (OIL) stated expressing his concern over the incident, Pradhan advised OIL to take all necessary steps to ensure the health and safety of the local population.\n", "\n", "He instructed ONGCL to provide all possible support to OIL in this moment of crisis. In the meantime, Government of Assam is also keeping a keen watch over the developments and providing all possible help to OIL.\n", "\n", "OIL stated the safety zone has been extended to 1.5 Kms from the well site and another relief camp is being set up to evacuate the people with the help of Tinsukia District administration. OIL with the help of district administration has ensured that all necessary food and logistic support is made available to the people staying in these relief camps.\n", "\n", "Presently, OIL team along with Crisis management team from ONGCL and an expert team from ONGCL, Vadodara are working to mitigate the situation.\n", "\n", "OIL added that OIL wants to reassure the local people of the area that their wellbeing, health and safety is the top priority for the company. OIL is also closely monitoring the environment and doing the best to minimise the impact. OIL Management is hopeful that the well will be brought under control at the earliest. At this critical time, OIL seeks the support of all the stakeholders so that together this crisis can be overcome. \n", "\n", "On Wednesday last OIL’s producing well Baghjan 5 in Upper Assam’s Tinsukia district witnessed blow out. Earlier the well was producing around 1lakh Standard Cubic Metre per day (SCMD) of gas from a depth of 3870 metres. \n", "\n"]], "tags": ["Ministry of petroleum and natural gas", "Dharmendra Pradhan", "the baghjan blowout", "Guwahati", "crisis management", "Baghjan well blowout", "ONGCL"]},
{"heading": [["View: Covid-19 will hasten the demise of many oil refineries"]], "sub_heading": [["When consumption of transport fuels collapsed this year because of coronavirus, much of the industry moved into survival mode, cutting processing rates and even temporarily stopping refining in some cases. While that helped prop up the industry’s margins for a while, a combination of rising crude costs and still-weak end-user demand are starting to bite."]], "time": [["Last Updated: May 29, 2020, 10.08 AM IST"]], "publisher": [["Bloomberg"]], "article": [["\n", "Who needs a loss-making, inflexible oil refinery in a world where demand for petroleum has been obliterated? We’re about to find out.\n", "\n", "When consumption of transport fuels collapsed this year because of ", "coronavirus", ", much of the industry moved into survival mode, cutting processing rates and even temporarily stopping refining in some cases. While that helped prop up the industry’s margins for a while, a combination of rising crude costs and still-weak end-user demand are starting to bite.\n", "\n", "With many oil traders and analysts expecting a slow and uncertain recovery in demand, there’s now an open question about where that leaves refineries supplying tens of billions of barrels of fuel each year. It seems likely that many of the weaker plants will be permanently shuttered.\n", "\n", "“The Covid situation has accelerated the rationalization process that was always coming,” said Spencer Welch, vice president of oil markets and downstream consulting at ", "IHS Markit", ". “It will hit Europe hardest and first. But it will also hit North America, particularly the East Coast.”\n", "\n", "The refining industries in Europe and the U.S. have long grappled with overcapacity as bigger, more efficient plants got built in the Middle East and Asia. The expansions mean that plants making fuel in France or Belgium, for example, have found themselves increasingly competing against supplies imported from the likes of India, Saudi Arabia or even as far afield as South Korea.\n", "\n", "\n", "\n", "In recent weeks, Asian refineries have enjoyed stronger local demand that’s kept the region’s plants busy, while a recovery in Europe and the U.S. has lagged.\n", "\n", "While the refining industry globally has been forced to take capacity offline, the hit has probably been bigger in Europe and the U.S. than in Asia, according to ", "Fitch Ratings", ". China, in particular, is a relative bright spot -- its refinery runs have recovered, and margins are being helped by a government-set floor in product prices.\n", "\n", "The combination of a tightening crude market and weak demand is set to keep refining margins at historic lows over the coming months, researcher JBC Energy GmbH said in a note.\n", "\n", "“In this difficult environment, efforts by the more resilient refiners, not only in Asia, to gain market share may further contribute to pushing out the most vulnerable players, ultimately leading to some pressure relief in the medium to longer term,” JBC said.\n", "\n", "\n", "\n", "IHS estimates that Europe could lose about 2 million barrels a day of oil-processing capacity by 2025, roughly equivalent to 13%. And about half of that is attributable to the fallout from the current crisis.\n", "\n", "But it’s not only Europe. Refiners in Australia and New Zealand are under pressure, while Asia, especially Japan, could also be affected, according to Facts Global Energy.\n", "\n", "“Many refiners will limp through the next 1-2 years to see what happens to demand recovery,” said Steve Sawyer, director of refining at FGE.\n", "\n", "In recent weeks, America’s refiners responded to the downturn by slashing rates to a minimum and idling some gasoline-making units. Marathon Petroleum Corp., the biggest U.S. refiner, temporarily shuttered two of its refineries.\n", "\n", "The devastation that Covid-19 has wrought on demand “is not over yet,” Tom Nimbley, chief executive officer at PBF Energy Inc., said on a May 15 earnings call, even as U.S. gasoline demand was showing signs of recovery. PBF is running its six refineries at minimum rates.\n", "\n", "“2020 will be a tough year for the industry, and in particular for refineries with high debt and weak liquidity,” said Dmitry Marinchenko, a senior director at ", "Fitch", " Ratings, which has taken negative rating actions on Marathon Petroleum, and Turkey’s Turkiye Petrol Rafinerileri AS, or Tupras.\n", "\n", "The prolonged periods of maintenance known as turnarounds that are required in the industry can easily cost $100 million, according to Sawyer. “The next crunch point for any refiner is when he has to justify significant spend on his refinery,” he said.\n", "\n", "In Europe, the most vulnerable refineries are probably the so-called simple plants -- those lacking options for reprocessing what’s left over after the key distillation process in refining, according to IHS. While the initial slump was particularly bad for jet fuel and gasoline, there have been signs of recovery. Diesel has held up better in Europe, but that’s at risk too because jet fuel is being diverted into that product.\n", "\n", "Weak margins in the industry could last for years, said Jonathan Lamb, an analyst at Wood & Company, an investment bank. He says demand could take a couple of years to recover at best.\n", "\n", "“In the meantime, capacity continues to increase,” he said. “Hanging on in the hope of better margins is not a smart move.”\n", "\n"]], "tags": ["Fitch Ratings", "ihs markit", "Oil refineries", "Fitch", "coronavirus"]},
{"heading": [["Torrent Gas commissions 21 CNG stations in five states"]], "sub_heading": [["Torrent Gas, which holds licence to retail CNG to automobiles and piped cooking gas to household kitchens in 32 districts across seven states, commissioned 10 outlets in Uttar Pradesh, four in Punjab, three in Gujarat and Telangana each and one in Rajasthan. "]], "time": [["Last Updated: May 30, 2020, 03.47 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Torrent Gas Ltd", ", the city gas distribution firm of the Gujarat-based Torrent Group, has commissioned 21 ", "CNG selling stations", " in five states after lockdown relaxations allowed resumption of some economic activities, the company said.\n", "\n", "Torrent Gas, which holds licence to retail CNG to automobiles and piped cooking gas to household kitchens in 32 districts across seven states, commissioned 10 outlets in Uttar Pradesh, four in ", "Punjab", ", three in Gujarat and Telangana each and one in Rajasthan.\n", "\n", "Its CNG stations were part of the 56 newly-built ones that ", "Oil Minister Dharmendra Pradhan", " dedicated to the nation through a web event on Friday, the company said in a statement.\n", "\n", "Speaking on the occasion, Jinal Mehta, director, Torrent Gas, said, \"With the commissioning of these 21 CNG stations, we have set up a total of 58 CNG stations within a relatively short span of time.\"\n", "\n", "Torrent Gas, he said, is committed to making CNG for vehicles and ", "PNG", " for industries and residences widely available across all its operational areas and thereby contribute towards the socio-economic development of these regions.\n", "\n", "Torrent Gas is targeting to set up a total of 200 CNG stations across its authorised areas by June 2021.\n", "\n", "Appreciating the progress made in setting up the CNG stations, especially in the upcountry regions over the last couple of months, Pradhan said \"the energy and enthusiasm of CGD (city gas distribution) entities in setting up and dedicating this CNG infrastructure for the next generation, despite the pandemic, is commendable. Today, 72 per cent of the population and 52 per cent of the geographical area of the country is covered by CGD network.\"\n", "\n", "\"In future, all fuels, including CNG would be provided at the doorstep of the customers through a mobile delivery system,\" the statement quoted Pradhan as saying.\n", "\n", "The USD 3 billion Torrent Group has a strong presence in pharmaceuticals, power and city gas distribution sectors.\n", "\n", "Torrent Pharma, the flagship company of the group, is a dominant player in the cardiovascular and central nervous system (", "CNS", ") segments with global presence spread across 40 countries.\n", "\n", "Torrent Power", " is one of the largest private sector players in the power sector with presence across the entire power value chain -- power generation, transmission and distribution. It has an installed generation capacity of 3,879 MW and distributes power to over 3.65 million customers in 10 cities in three states.\n", "\n", "Torrent Gas has CGD licence to sell Compressed Natural Gas (CNG) to automobiles and Piped Natural Gas (PNG) to industries and households in 32 districts across seven states (Uttar Pradesh, Gujarat, Maharashtra, Rajasthan, Punjab, Tamil Nadu and Telangana) and one Union Territory (Puducherry).\n", "\n", "Torrent's authorised areas across the country have a population of approximately 9-plus crore people, which is about 7 per cent of the total population of India. \n", "\n"]], "tags": ["torrent gas ltd", "punjab", "Oil minister Dharmendra Pradhan", "Torrent Pharma", "png", "CNS", "torrent power", "cng selling stations"]},
{"heading": [["LPG cylinder prices hiked across India, here are the new rates for different regions"]], "sub_heading": [["Prior to this raise, prices had been cut for three months on run up to May. It is worth noting here that cylinder prices are revised at the start of every month depending on the global LPG benchmark rate and the rupee-dollar exchange rate. "]], "time": [["Last Updated: Jun 01, 2020, 12.35 PM IST"]], "publisher": [["ET Online"]], "article": [["The first day of Unlock 1.0 saw a hike in cooking gas ", "cylinder prices", " across the country.\n", "\n", "Following a global hike in June prices, the rates of LPG cylinders in India have been hiked with effect from today. For Delhi consumers, the prices are now up by Rs 11.50 a cylinder, according to a release by the IOC.\n", "\n", "After the latest adjustment, a (non-subsidised 14.2 kg Indane) cylinder will now cost Rs 593 in Delhi, Rs 590.50 in Mumbai, Rs 606.50 in Chennai and Rs 616 in Kolkata.\n", "\n", "The different types of Indane cylinders include: (a) compact 5 kg cylinders for rural, hilly and inaccessible areas, (b) 14.2 kg cylinders for domestic use and (c) 19 kg and 47.5 kg for commercial and industrial use.\n", "\n", "Prior to this raise, prices had been cut for three months on run owing to benign global prices.\n", "\n", "According to the ", "Indian Oil", " website, this hike won't affect Ujjwala Yojana beneficiaries because they are \"covered under Pradhan Mantri Garib Kalyan Yojana and are entitled to a free cylinder till June 30th.\"\n", "\n", "It is worth noting here that cylinder prices are revised at the start of every month depending on the global LPG benchmark rate and the rupee-dollar exchange rate. \n", "\n"]], "tags": ["LPG gas cyclinder price hike", "LPG prices", "LPG cylinder prices", "indian oil", "cylinder prices", "book lpg cylinder"]},
{"heading": [["ATF price up 50%, LPG up Rs 11.5 per cylinder"]], "sub_heading": [["Rates of subsidized gas have been rising following a government directive last year to hike prices by at least Rs 4 every month."]], "time": [["Last Updated: Jun 01, 2020, 11.55 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Oil companies have raised the rates of ", "jet fuel", " by 50% following a rise in international rates, pushing up cost for airlines that resumed passenger flights last week after a gap of two months.\n", "\n", "State oil companies have also raised the prices of non-subsidised cooking gas by Rs 11.50 per cylinder. A refill in Delhi will now cost Rs 593 per cylinder. State oil companies no more publish prices for ", "subsidized cooking gas", ". Rates of subsidized gas have been rising following a government directive last year to hike prices by at least Rs 4 every month.\n", "\n", "Domestic fuel prices have begun increasing in line with the recovery in the ", "international oil markets", ". Crude oil prices are up a third in a month, pushing up rates for refined products such as petrol, diesel, cooking gas and jet fuel in the international market.\n", "\n", "\n", "1590991933000", "\n", "\n", "Jet fuel costs Rs 33,575 per kilolitre in Delhi from Monday, up from Rs 22,544 in May, according to ", "Indian Oil Corp", " website. In Mumbai, the new rate is Rs 33,070 per kilolitre. Indian Oil and other ATF suppliers mostly revise rates at the beginning of every month.\n", "\n", "For most budget airlines, fuel contributes 40% of their total cost. Cost expansion would increase challenges for airlines already facing a storm from the pandemic and lockdown.\n", "\n", "\n"]], "tags": ["LPG cylinders", "subsidized cooking gas", "international oil markets", "Indian Oil Corp", "Jet fuel"]},
{"heading": [["Dharmendra Pradhan envisages home delivery of petrol, CNG"]], "sub_heading": [["Doorstep delivery of petrol and CNG is said to pose risks due to highly inflammable nature of the fuel, and safe and secure modes approved by relevant authorities need to be evolved.  Pradhan said the government has already started mobile dispensers for diesel and is working on energy efficiency, affordability, security and accessibility. "]], "time": [["Last Updated: May 29, 2020, 05.57 PM IST"]], "publisher": [["PTI"]], "article": [[" After doorstep delivery of diesel, the government is looking at starting home delivery of petrol and CNG for the greater convenience of customers, Oil Minister ", "Dharmendra Pradhan", " said on Friday. Also, the government is looking at unveiling a new fuel retailing model where all types of fuels -- petrol, diesel, CNG, LNG and LPG -- would be available at one place, he said. \n", "\n", " Indian Oil Corp (", "IOC", "), the nation's largest fuel retailer, in September 2018 started home delivery of diesel through a mobile dispenser. This service is available only in a handful of cities. \n", "\n", " Doorstep delivery of petrol and CNG is said to pose risks due to highly inflammable nature of the fuel, and safe and secure modes approved by relevant authorities need to be evolved. \n", "\n", " Speaking at a function to inaugurate 56 new CNG stations in 11 states, Pradhan said the government has already started mobile dispensers for diesel. \n", "\n", " It \"would like to expand the same for petrol and LNG,\" an official statement quoted him as saying. \"Pradhan said that people would be able to get the home delivery of the fuel in future.\" \n", "\n", " The government, he said, is working on energy efficiency, affordability, security and accessibility. \n", "\n", " He envisioned that soon, the customers will have to go to only one place, where all types of ", "fuels - petrol", ", diesel, CNG, LNG and LPG will be made available. \n", "\n", " The minister said city gas network of CNG supplies to automobiles and piped cooking gas to kitchens will soon cover 72 per cent of the country's population. \n", "\n", " He was speaking on the occasion of inauguration of 56 new CNG stations in 11 states including Gujarat, Haryana, Jharkhand, Karnataka, Madhya Pradesh, Maharashtra, New Delhi, Punjab, Rajasthan, Telangana and Uttar Pradesh. \n", "\n", " \"Lauding the efforts of all the stakeholders in the expansion of the gas network in the country, Pradhan said that 72 per cent population of the country will soon be covered through the City Gas Distribution (CGD) network, with spread over 53 per cent of the geographical area,\" the statement said. \n", "\n", " CGD network, comprising of over 2,200 CNG outlets and nearly 61 lakh piped natural gas users, presently covers about half of the country's population. \n", "\n", " Stating that the country is moving towards a gas-based economy, he said the number of piped natural gas (PNG) users has gone up from 25.4 lakh in 2014 to 60.68 lakh. Industrial gas connections have risen to 41,000 from 28,000 and the number of CNG vehicles has gone up from 22 lakh to 34 lakh. \n", "\n", " He said that it is a matter of satisfaction that besides the public sector, private companies are taking part in the expansion of gas infrastructure in the country. \n", "\n", " Oil Secretary Tarun Kapoor said that India is the third-largest energy consumer of the world, and is working to raise the share of natural gas in its energy basket to 15 per cent from current 6.2 per cent. \n", "\n", " He said that as the economic activity and consumption level goes up in the country, the energy consumption is bound to go up. \n", "\n", " The government will promote and support gas as an environment-friendly, energy-efficient and economically efficient fuel, he said. \n", "\n", " \"Completion of work at these stations was affected due to the countrywide lockdown imposed to prevent the spread of coronavirus. However, after easing of restrictions last month, the work gathered pace and was carried out ensuring all safety and social distancing norms. This ensured minimum delay in commissioning of these stations as against the original schedule,\" the statement said. \n", "\n", " With the addition of these stations to India's CNG network, the daily filling capacity in the country has gone up by over 50,000 vehicles.\n"]], "tags": ["petrol home delivery", "indian oil corp (ioc", "Dharmendra Pradhan", "cng home delivery", "ioc"]},
{"heading": [["Petrol sales down 36.5%, diesel down 31% in May; improves from April"]], "sub_heading": [["Diesel sales fell 31% year on year in May compared with a 56% slump in April while petrol consumption declined 36.5% in May as against a 60% decline in April. May data is for sales by state companies, which control about 90% of the fuel market."]], "time": [["Last Updated: Jun 01, 2020, 02.18 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Fuel sales recovery gathered momentum in May as the easing of lockdown brought more people out of their homes and restarted factories.\n", "\n", "Diesel", " sales fell 31% year on year in May compared with a 56% slump in April while ", "petrol consumption", " declined 36.5% in May as against a 60% decline in April. May data is for sales by state companies, which control about 90% of the fuel market.\n", "\n", "Fuel sales witnessed a record fall in April and the gradual comeback in May signals a change in economic sentiment.\n", "\n", "“It’s getting better. We are coming back on rails,” said an industry executive. “Increased sales in ", "petrol", " and diesel are a pointer towards improving economic activity.”\n", "\n", "“Sales will further get a boost in June as lockdown curbs have been eased and economic activity is picking up,” he said.\n", " \n", "\n", "\n", "Jet fuel", " sales also improved from April as the government permitted airlines to resume passenger flights towards the end of May. The volume is still low as very few flights are currently operational. Jet fuel sales dropped 85% in May from a year earlier compared to a 91% drop in April. \n", "\n", "Improvement in jet fuel sales will depend on how airlines add flights, the executive said.\n", "\n", "The sale of liquefied petroleum gas (LPG), or cooking gas, barely changed from April. In April, the ", "LPG", " sales jumped 13% year on year compared to a 12.2% rise in April. \n", "\n", "With restaurants and malls set to open in June, LPG demand is likely to rise further. Opening of inter-state transport and an expected increase in attendance at offices and factories will likely push up demand for transportation fuels in June.\n", "\n", "Rising demand for fuels is boosting refinery run rate. Capacity utilization at ", "Indian Oil Corp", ", the largest refiner in the country, has risen to more than 75% from 45% in April. \n", "\n"]], "tags": ["diesel", "lpg", "petrol", "petrol consumption", "Indian Oil Corp", "Jet fuel"]},
{"heading": [["OIL contacts global experts to control blowout in Assam's Baghjan"]], "sub_heading": [["On May 27th, the gas producing well of Baghjan-5 under Baghjan Oilfield of OIL had suddenly become very active while work-over operation was on. However, there is no incident of any fire, casualty or injury."]], "time": [["Last Updated: Jun 01, 2020, 05.04 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["GUWAHATI: Oil India Limited (OIL) has contacted global expert to control the blowout in the gas well at Baghjan in upper Assam, from which offers with ", "action plan", " and timeline were received. Offers from Boots and Coots, Alert and ", "Wild Well Control", " in well control operation are being examined and are currently under consideration. OIL has stated that the “safety of surrounding villagers and their properties, working team and protection of the environment is paramount while carrying out the well control operation.\"\n", "\n", "CMD of OIL Sushil Chandra Mishra, along with top management, visited the site. He informed that OIL has already shown cause to M/s John Energy Pvt Limited, and actions will be initiated on employees of OIL if there is any prima facie evidence of human error, the same for which a five member inquiry committee has been formed.\n", "\n", "The CMD reaffirmed the fact that OIL is not carrying out any operations within the Eco Sensitive Zone (ESZ). All operations of OIL are being carried out outside the ESZ (as published vide gazette notification dated 28 January, 2020 by Ministry of Environment, Forest and Climate Change (MoEF&CC).\n", "\n", "On May 27th, the gas producing well of Baghjan-5 under ", "Baghjan Oilfield", " of OIL had suddenly become very active while work-over operation was on. However, there is no incident of any fire, casualty or injury.\n", "\n", "OIL stated that the crisis management team (CMT) members approached the wellhead taking all ", "precautionary measures", " and opened the casing valve and started pumping water through it. \n", "\n", "OIL further said that the placement of water pumps in the nearby river, which is the source of the water, and pipeline-laying jobs are in progress for additional high quantity of water. “Additional plot of land adjacent to the well site has been arranged to create a big reservoir of water and to place the well control equipment. Excavation of the pond will be started from today. OIL fire service and with mutual aids are stationed 24x7 at site since 27-05-2020 for continuously water jacketing the well to avert any eventuality. Gas and air quality are being monitored at constant interval”.\n", "\n", "OIL in a statement said that around 650 families have been evacuated from the nearby affected areas and are camped in three relief camps set. CMD OIL along with Dr. P. Chandrasekaran, Director (Exploration & Development), P. K. Goswami Director (Operations), D. K. Das Resident Chief Executive, Prasanta Barkakaty, ED(HR&A), and other senior officials of OIL had a detailed meeting with Bhaskar Pegu, Deputy commissioner (DC), ", "Tinsukia district", " and Shiladitya Chetia Superintendent of police Tinsukia on the issue and various measures taken to provide necessary support to the evacuated local population in the vicinity of the blow out well.\n", "\n", "CMD elaborated the action taken by Oil India Ltd to control the blowout at the earliest. He also informed that OIL is very grateful to the state government and district administration and the Minister of Petroleum and Natural Gas, Government of India for all their support in this moment of crisis.\n", "\n", "He expressed his grief on the hardships that the local population is facing due to this unprecedented situation. He assured that OIL is taking all possible measures to ensure the health and safety of the local people impacted in the vicinity of the blowout well. \n", "\n", "Replying to the queries on the environment and the impact on the local flora & fauna, CMD informed that the Forest Department, District Administration and OIL are taking stock of the issues in all earnest. \n", "\n", "CMD had detailed discussions with the experts of OIL and ONGC at the site. CMD had a detailed interaction with the local people who expressed their agony and hardships. CMD assured that OIL will take all possible care to provide them necessary compensation.\n", "\n", "He also assured that OIL is equally concerned about the reported impact on the bio diversity of the area for which OIL is awaiting the observations and findings of District Administration, Forest department, Pollution Control Board so that all necessary steps can be taken.\n", "\n"]], "tags": ["precautionary measures", "Wild Well Control", "Tinsukia district", "Oil and Natural Gas Corporation", "action plan", "baghjan oilfield"]},
{"heading": [["A team of experts from Singapore to help plug the blow out at Baghjan in Upper Assam"]], "sub_heading": [["Assam Chief Minister Sarbananda Sonowal on Tuesday telephoned Union Minister for Petroleum and Natural Gas Dharmendra Pradhan and requested his help in getting foreign experts in plugging a leak in the well of Oil India Limited at Baghjan leading to spewing of natural gas in the air. "]], "time": [["Last Updated: Jun 02, 2020, 07.40 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["GUWAHATI: An expert team from ", "Singapore", " will reach the ", "Assam", " on Wednesday to lend its expertise to plug the blow out at ", "Baghjan", " in Upper Assam.\n", "\n", "Assam Chief Minister ", "Sarbananda Sonowal", " on Tuesday telephoned Union Minister for Petroleum and Natural Gas ", "Dharmendra Pradhan", " and requested his help in getting foreign experts in plugging a leak in the well of Oil India Limited at Baghjan leading to spewing of natural gas in the air. \n", "\n", "OIL’s Baghjan oil well caused rupture on Wednesday last week causing spewing of gas into the environment. In a statement state government stated that though best of the efforts have been put in place by the crisis management team to control the release, gushes of natural gas have been oozing unrelentingly. Following this, Chief Minister Sonowal called up Union Minister Pradhan, briefed him about the situation and requested him to take up immediate steps like taking the help of foreign experts in stopping the release.\n", "\n", "The statement added in view of the cascading effect of the incident on the surroundings and the residents in fringe areas, Sonowal also requested the Union Minister for announcing adequate compensation of the victims.\n", "\n", "Pradhan assured the Chief Minister of taking positive steps including bringing experts from Singapore to plug the leak. He also informed Sonowal that a Joint Secretary from Union Petroleum Ministry has also been directed to rush to the site to take stock of the situation. Meanwhile consequent upon Sonowal’s request, Joint Secretary Petroleum Ministry has already reached Assam. An expert team from Singapore will reach the state to lend its expertise to plug the leak.\n", "\n", "Oil India Limited (OIL) has contacted Global Expert to control the blowout. Offers with action plan and time line received from three Global Experts. Offers of Boots and Coots, Alert and Wild Well Control in Well Control Operation are being examined and under consideration.\n", "\n"]], "tags": ["assam", "singapore", "Baghjan", "Dharmendra Pradhan", "Sarbananda Sonowal"]},
{"heading": [["Net marketing margin on petrol and diesel turns negative"]], "sub_heading": [["Oil companies would probably begin worrying in the next quarter if international prices keep rising and domestic fuel rates stay frozen."]], "time": [["Last Updated: Jun 02, 2020, 07.26 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: ", "Net marketing margin", " on ", "petrol", " and ", "diesel", " has turned negative after soaring to a record in early May as ", "oil marketing companies", " have frozen domestic fuel rates while international rates and taxes have sharply increased. \n", "\n", "Net marketing margin is currently at minus Rs 1.56 per litre, down from Rs 16.1 per litre during May 1 to 5, according to ICICI Securities. The margin sharply contracted after the government hiked excise duty on petrol and diesel by Rs 10 and Rs 13 per litre, respectively, on May 6. For the period between May 6 and 15, the margin averaged Rs 3.9 per litre on the two fuels. Increase in taxes didn’t translate into any change in ", "retail prices", " then as oil companies absorbed the full hike.\n", "\n", "In the second fortnight of May, the margins slipped further to Rs 1.84 per litre as international prices started rising while domestic prices remained frozen. International rates of petrol and diesel have risen by 35% and 48%, respectively, in a month. On June 1, the margin on domestic fuels slipped into negative.\n", "\n", "“Unless the retail price is hiked significantly, the net margin would be in the red in June,” ICICI Securities said in a note on Tuesday basing its estimate on current prices. A high margin of Rs 7.9 per litre in April-May would, however, more than offset negative June margin and ensure a healthy Rs 5.1 per litre margin for the April-June quarter, as per the ICICI estimates. By comparison, the average margin was Rs 2.2 per litre in the year 2019-20.\n", "\n", "Oil companies would probably begin worrying in the next quarter if international prices keep rising and domestic fuel rates stay frozen.\n", "\n", "“We are faced with some hard choices. Domestic fuel prices are already high and raising them further may not make sense in a slowing economy. But expecting the government to cut duties when it is short on revenue also may not be realistic,” said a state oil company executive. \n", "\n", "On Tuesday, petrol and diesel were sold for Rs 71.26 and Rs 69.39 per litre, respectively, in Delhi. Prices have remained almost frozen for more than two months, which oil company executives say is aimed at shielding consumers from volatility. By abandoning daily revision of prices, a practice they adopted three years ago, oil companies also denied consumers the benefit of the recent oil crash. \n", "\n"]], "tags": ["net marketing margin", "diesel", "petrol", "retail prices", "oil marketing companies"]},
{"heading": [["CNG price in Delhi hiked by Re 1 per kg"]], "sub_heading": [["The company had last cut CNG price by Rs 3.2 per kg and piped natural gas rate by Rs 1.55 per unit from April 3."]], "time": [["Last Updated: Jun 01, 2020, 09.51 PM IST"]], "publisher": [["PTI"]], "article": [["CNG price", " in the national capital and adjoining cities on Monday was hiked by Re 1 per kg to make up for the additional cost incurred to keep stations coronavirus ready. ", "Indraprastha Gas Ltd", " (", "IGL", "), the firm that retails CNG to automobiles and piped ", "natural gas", " to household kitchens, revised CNG price in the national capital \"from Rs 42/ kg to Rs 43/ kg, w.e.f. 6 am on 2nd June 2020,\" the firm tweeted. \n", "\n", " There will, however, be no change in piped cooking gas prices. \n", "\n", " The company had last cut CNG price by Rs 3.2 per kg and piped natural gas rate by Rs 1.55 per unit from April 3. \n", "\n", " The nationwide lockdown imposed from March 25 saw ", "fuel sales", " drop by as much as 90 per cent but relaxations thereafter have not helped demand recover to pre-COVID levels. Despite the drop in sales, the company continued to incur expenditure on paying salaries, fixed charges for power connections, maintenance of equipment and rent, sources said. \n", "\n", " To recover these charges, the firm has raised CNG prices, they said. \n", "\n", " \"CNG retail price in Noida, Greater Noida & Ghaziabad being revised from Rs 47.75/ kg to Rs 48.75/ kg, w.e.f. 6 am on 2nd June 2020,\" IGL said in another tweet. \n", "\n", " CNG rate in Karnal district of Haryana was hiked to Rs 50.85 per kg and that in Rewari to Rs 55 a kg from Rs 54.15.\n"]], "tags": ["natural gas", "CNG price", "Indraprastha Gas Ltd", "fuel sales", "IGL"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["pelrol delivery", "cng delivery", "home delivery", "door step delivery", "mobile app", "diesel delivery"]},
{"heading": [["Power minister proposes a new scheme worth Rs 3 lakh crore to finance commission"]], "sub_heading": [["Officials of the power ministry discussed the need to restructure the power system to make states responsible for the financial health of their power distributions companies (discoms), with the NK Singh-led FC. This would entail recalibrating state borrowing limits under the Fiscal Responsibility and Budget Management (FRBM) Act, to account for the added liabilities, the press release said."]], "time": [["Last Updated: May 30, 2020, 12.29 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Power minister ", "RK Singh", " proposed a new scheme for the ", "power sector", " amounting to Rs 3 lakh crore spanning five years, in his meeting with the ", "15th Finance Commission", " (FC) on Friday. \n", "\n", "Officials of ", "the power ministry", " discussed the need to restructure the power system to make states responsible for the financial health of their power distributions companies (", "discoms", "), with the NK Singh-led FC. \n", "\n", "This would entail recalibrating state borrowing limits under the Fiscal Responsibility and Budget Management (FRBM) Act, to account for the added liabilities, the press release said.\n", "\n", "The new scheme included an amalgamation of old schemes under the power ministry and focused on reducing losses in the power sector, separate feeders for agriculture and smart prepaid meters\n", "\n", "The minister also discussed policy reforms that were in the pipeline to turnaround the beleaguered power sector, including amendments to the Electricity Act. \n", "\n", "The meeting was in continuation to the recommendations the FC made on the power sector in its FY21 report released in November last year. \n", "\n", "The FC’s report had noted that most states had reduced their aggregate technical and commercial (AT&C) losses and the difference between average cost of supply and average realizable revenue (ACS-ARR) after implementation of the Ujwal Discom Assurance Yojana (UDAY) in 2016-17. However, the progress was not sustainable unless systemic issues in the power sector are suitably addressed, it added.\n", "\n", "The commission will have to take into account the significant change in circumstances for the sector, including the Covid-19 and lockdown shock and the Rs. 90,000 crore liquidity injection for discoms announced by finance minister ", "Nirmala Sitharaman", ", as part of the Atmanirbhar Bharat package. \n", "\n", "The FC was mandated to work out a fiscal consolidation roadmap for five financial years starting from the ongoing FY21 to FY26. Its final report is due on October 30. \n", "\n", "Earlier in May, the commission met with its committee on fiscal consolidation roadmap, that was constituted to take stock of the emerging situation and chart the way forward to review the fiscal consolidation of the general government.\n", "\n"]], "tags": ["15th finance commission", "RK Singh", "Nirmala Sitharaman", "The Power Ministry", "NK Singh", "power sector", "discoms"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["lpg price hike news", "lpg", "Rs 11.50 per cylinder", "Indane Gas Cylinder", "Cylinder", "Delhi", "LPG price hike in delhi"]}
]