[
{"heading": [["Film-makers may have to rewrite shooting script"]], "sub_heading": [["Many Bollywood producers and studios consider 2020 a washout as the film industry has come to a standstill amid disrupted production schedules, mounting costs and continued delays in theatre exhibition, even as they formulate safety protocols to restart shooting."]], "time": [["Last Updated: May 28, 2020, 06.02 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Many Bollywood producers and studios consider 2020 a washout as the ", "film industry", " has come to a standstill amid disrupted production schedules, mounting costs and continued delays in theatre exhibition, even as they formulate ", "safety protocols", " to restart shooting. \n", "\n", "Unlike TV production, where most of the shoots are done inside studios with limited set of people, shooting for films involves much bigger sets and a lot of people. \n", "\n", "While Producers Guild of India has come up with new safety protocols and standard operating procedures (SOPs), it’s a given that filmmaking is going to get costlier and more time consuming than before.\n", "\n", "As a result, most of the films currently under production are expected to take at least one year to hit the cinemas, probably between June and November next year, some producers told ET. \n", "\n", "“There will just be 3-4 tent-pole films left for releasing in a theatre over the next nine months and film production is not expected to kick start for another 2-3 months,” a leading producer said on conditions of anonymity. \n", "\n", "The economics of filmmaking is set to change with theatres expected to remain closed for 4-5 months, industry insiders said.\n", "\n", "Even when the exhibition halls open, their installed capacity will drop to 50%, they said. This may impact release of big-budget films that would need a good box-office performance to recover the costs.\n", "\n", "“The economics for any movie, which has to recover first marketing and then the print levy, will make everyone think, is it worth it? Or, shall the producers just slow down on production or make the really big movies only in 2021 for release in 2022?” head of a production studio told ET. “In all, 2020 is a washout and 2021 will be a tough year for the film industry.” \n", "\n", "Producers said the dearth of new films will be felt both in cinemas and streaming platforms such as ", "Netflix", " and Amazon Prime. \n", "\n", "“Once you run out of existing films, there will be no films or series to release in theatres, OTT alike,” said Ajit Andhare, chief operating officer of Viacom18 Studios. “Even when the production resumes, the key concern as a producer is to get the crew back to shoot, ensure their safety, and if, god forbid, there is contamination, then contain it,” he said. “The shooting process will require tremendous discipline to work with minimal contact.”\n", "\n", "Film is one of those industries where maintaining social distancing is a real challenge, given that film production requires close interaction between all the participants—actors, director, production crew members, makeup artists, extras and spot boys, among others. \n", "\n", "“It’s going to be a new world when shoots resume,” said ", "Siddharth Roy Kapur", ", film producer and president of Producers Guild. “While we have already created a set of safety protocols and SOPs, we have to be prepared to deal with unforeseen issues and solve them as they come up. Our way of working will involve major changes, but we will have to embrace these changes if we want to be able to resume production.”\n", "\n", "Asked about shooting of item songs or crowd scenes that require actors to be in close proximity to one another, Roy Kapoor said that the conceptualisation of certain scenes or sequences will have to change. “Artistes need to feel safe as they will be most at risk, and we will do everything we can to make them feel secure,” he said.\n", "\n", "Head of a film studio who did not wish to be identified said, “Shooting can begin in controlled locations at first, and can then be opened up slowly. Of course, insurance is a priority to safeguard everyone’s interest. We await insurance companies to introduce products related to shoots too.” \n", "\n", "As the industry has come to a standstill, perhaps the worst-hit segment is the daily wage earners such as extras and spot boys who have lost their livelihood during the lockdown. \n", "\n"]], "tags": ["film industry", "Siddharth Roy Kapur", "amazon video", "film shooting", "Netflix", "safety protocols"]},
{"heading": [["For stand-up comedians, bad days will likely continue even after lifting of lockdown"]], "sub_heading": [["What is even more worrying is uncertainty. Even when the lockdown is lifted, social-distancing measures will remain the norm and that will mean no live events for a some more time, say comedy circuit insiders. They expect the dry spell to continue for the next 6-8 months, at least."]], "time": [["Last Updated: May 02, 2020, 06.42 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["The coronavirus isn’t funny — as India’s comedy circuit has realised all too well.\n", "\n", " For comedians who counted on stand-up to make a living, the fallout from the ", "Covid-19 pandemic", " has been huge. With the country in ", "lockdown", ", the only revenue is from heavily discounted ", "Zoom shows", " for corporate houses, open mics on ", "Google Hangouts", ", ", "Instagram Live", " and other experiments. But not everyone is doing these, and even for those trying to utilise the virtual means, earnings are down 80-90%.\n", "\n", " What is even more worrying is uncertainty. Even when the lockdown is lifted, social-distancing measures will remain the norm and that will mean no live events for a some more time, say comedy circuit insiders. They expect the dry spell to continue for the next 6-8 months, at least.\n", "\n", "“Live comics won’t be getting shows for at least six months,” says stand-up comedian Raghav Mandava. “I don’t see people getting comfortable in a place with more than 10 people for some time.”\n", "\n", "Mandava, who says he currently has no income to speak of, isn’t comfortable with the online medium. He’s living off his savings for now. “Maybe I’ll take to writing content for shows,” he says.\n", "\n", " \n", "\n", "Only Much Louder, an artist and event management company, is now relying more on digital events, says chief operating officer Dhruv Sheth.\n", "\n", "Some comics like Sahil Shah at Only Much Louder are doing open mics on Google Hangouts, where a limited number of fans are invited. Another artist, Tanmay Bhat, has been doing livestreaming on YouTube, where he calls comics on his show.\n", "\n", "A few companies have started to reach out to them to do live shows via the Zoom video application for their employees.\n", "\n", "But there is a catch. Companies are offering only about 20-30% of regular rates. That apart, say comedians, interaction with the audience doesn’t work very well online.\n", "\n", "“You don’t get the feel of a live audience in an online show,” says Vipul Goyal. There are no live gigs this year; only virtual shows, he says, adding: “Aesthetics gets affected.”\n", "\n", "“Ninety percent of income is from live shows. And that’s dropped to zero,” says Goyal. He isn’t too inclined to make content for the Internet, because that doesn’t bring much money.\n", "\n", "“Why should I make content if I can’t monetise it? Everyone is active on Instagram now because that’s the only way to get noticed by brands now,” he says.\n", "\n", "While ticket sales are often zero for digital shows, even YouTube rates have come down, say those in the business.\n", "\n", "For Sunil Pal, online shows don’t bring work satisfaction as it does during a live interaction with people. “Everyone is very sad that this sort of misfortune is upon us. All the work is now happening on social media or on news channels,” he says.\n", "\n", "Kishore Dayani, who owns two comedy clubs in Delhi and Gurgaon, says the Zoom shows are asking for rate cuts of 70-80%. “Most comedians are not opting for them; they’re scared it’ll become a culture,” he says.\n", "\n", " Dayani is, however, planning ahead. When clubs are allowed to start again, he says he will operate at half the capacity and take precautions. “I’m thinking optimistically; hoping some might come for entertainment.”\n", "\n"]], "tags": ["Google Hangouts", "lockdown", "Instagram Live", "zoom shows"]},
{"heading": [["Beat your lockdown blues with the horror dramedy 'Official Bhootiyagiri',  streaming exclusively and for free on MX Player"]], "sub_heading": [[]], "time": [["Last Updated: May 15, 2020, 04.40 PM IST"]], "publisher": [["Mediawire"]], "article": [["  ", "  ", "  ", "  ", "  ", "  ", "  ", "https://bit.ly/OfficialBhootiyagiri_YT_ep1", " ", " "]], "tags": []},
{"heading": [["JioSaavn hires former LinkedIn exec Virginia Sharma as vice-president of brand solutions"]], "sub_heading": [["Sharma will be based out of the Gurugam office, and will lead the company’s global digital ad monetisation efforts across platforms. She will be responsible for driving adoption of JioSaavn’s advertising solutions for brands, while overseeing agency and client relationships. "]], "time": [["Last Updated: May 04, 2020, 11.41 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["BENGALURU: Streaming platform for South Asian ", "music", " and audio entertainment ", "JioSaavn", " has brought on board ", "Virginia Sharma", " as its vice-president of brand solutions, said a statement issued today.\n", "\n", "Sharma will be based out of the Gurugam office, and will lead the company’s global digital ad monetisation efforts across platforms. She will be responsible for driving adoption of JioSaavn’s ", "advertising", " solutions for brands, while overseeing agency and client relationships. \n", "\n", "With more than 20 years of experience leading ", "marketing", " and ", "sales", " teams, Sharma joins JioSaavn from LinkedIn. She has also worked with IBM for more than 15 years in various global and regional roles, including India vice-president of marketing and communications before joining LinkedIn Asia Pacific in 2014. \n", "\n", "Sharma has been recognised on the 2018 Economic Times Women Ahead list. She was also the first Indian leader to become a Marketing Academy Fellow delivered by McKinsey and Co. She is currently pursuing her doctorate in business administration from Indian School of Business in business model innovation.\n", "\n", " “Music is a conduit for emotional expression, and it connects people of all ages and backgrounds. As a seasoned marketer and early JioSaavn user, I already recognise many opportunities for brands to find their voice on the JioSaavn platform, allowing them to engage and build loyalty with millions of consumers,” Sharma said about her new role. \n", "\n", "Having worked in the US, Singapore, Japan and India, Sharma brings a global perspective to JioSaavn’s brand solutions team. Part of her new role will be finding innovative solutions that balance a great user experience, advertisers’ needs and respect for content creators. \n", "\n", "“As the JioSaavn user base continues to grow, the company was ready for a strong, seasoned and passionate executive in our core market to scale our advertising business. Virginia is an accomplished marketer turned sales leader with the proven capability to understand marketer needs and create durable long-term solutions for them, applying a mix of business creativity and strong ad technology. We are pleased to welcome her to the team and very excited to work together on this road ahead,” said Vinodh Bhat, co-founder, president and chief strategy officer, JioSaavn. \n", "\n", "\n"]], "tags": ["Jio saavn new vp", "virginia sharma", "marketing", "music", "advertising", "jiosaavn", "sales"]},
{"heading": [["Multiplexes’ pain is OTT’s gain"]], "sub_heading": [["The move will allow the producers and studios to protect their investments and offset carrying losses on their ready to release films and also leverage Amazon Prime’s global reach. "]], "time": [["Last Updated: May 15, 2020, 09.45 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: The tug of war between the video streaming services (over-the-top players) and the multiplexes is set to intensify after Amazon Prime Video fired the latest salvo by acquiring 7 Bollywood and regional films, including Amitabh Bachchan – Ayushmann Khurrana’s ‘Gulabo Sitabo’ and Vidya Balan-starrer ‘Shakuntala Devi’ for direct-to-digital premier.\n", "\n", "The move will allow the producers and studios to protect their investments and offset carrying losses on their ready to release films and also leverage Amazon Prime’s global reach. \n", "\n", "The OTT major’s actions will not go down well with the multiplexes, who have been asking the producers to hold back their releases till they resume operations and honour the time-tested exclusive theatrical window.\n", "\n", " \n", "\n", "“We are ensuring that these movies will get the widest possible distribution across 200 countries and over 150 million Prime users can access fresh content within the safety of their homes,” said Gaurav Gandhi, GM- India at Amazon Prime Video, who was the architect of this disruptive move. \n", "\n", "Apart from the two Bollywood films, Amazon has also acquired rights of Jyothika-starrer Tamil legal drama ‘Ponmagal Vandhal’, two Kannada titles – ‘French Biryani’ and ‘Law’, Malayalam film ‘Sufiyum Sujathayum’, and Penguin (Tamil and Telugu).\n", "\n", "ET had reported on May 5th that OTT players like Amazon Prime Video, ", "Netflix", " and Disney + ", "Hotstar", " were in talks with multiple filmmakers to release films on their respective platforms.\n", "\n", "Expressing its “extreme displeasure” and “disappointment”, ", "Inox Leisure", ", India’s second largest multiplex chain, said in a statement that such decision of the production house is alarming and disconcerting.\n", "\n", "“Such acts, though isolated, vitiate the atmosphere of mutual partnership and paint these content producers as fair-weather friends rather than all-weather life-long partners,” ", "Inox", " said. “Needless to say, Inox will be constrained to examine its options, and reserves all rights, including taking retributive measures, in dealing with such fair-weather friends.”\n", "\n", "When asked if Amazon will continue this trend and acquire movies ahead of theatrical release in future too, Vijay Subramaniam, Head of Content, Amazon Prime Video India, said that such deals are happening across the world. \n", "\n", "“We believe this is the best way to bring fresh content to our customers. Also, in current times, all the producers have taken a very holistic view. We all have to readjust to the new reality. The producers are happy with the value they are realising on their films by releasing on Prime Video,” said Subramaniam.\n", "\n", "Earlier, the Multiplex Association of India (MAI) had asked all its partners – studios, producers, actors and content creators – to support the cinema exhibition sector by holding and releasing their films in the theatres only, once they open again.\n", "\n", "\n"]], "tags": ["amazon video", "Hotstar", "INOX Leisure", "Netflix", "inox"]},
{"heading": [["More trouble for TV producers as broadcasters try to cut costs"]], "sub_heading": [["Executives across broadcasting companies as well as production houses have confirmed to ET that commercial teams of TV channels have initiated informal discussions with producers, asking them to reduce the cost by 20-40%."]], "time": [["Last Updated: May 14, 2020, 07.13 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Under stress due to a halt in all production activities, television producers are in for another rude shock following a decision by the ", "broadcasters", " to renegotiate the existing deals, a move that reflects the extreme cost pressure now impacting the entire supply chain across broadcasting industry.\n", "\n", "“2020 will be super stressed,” said Abhishek Rege, CEO of India’s largest reality content producer, Endemol Shine India. “On one hand we will have to look at how to reduce cost, and on the other side there will be cost escalation due to on-ground safety measures.”\n", "\n", "Executives across broadcasting companies as well as production houses have confirmed to ET that commercial teams of TV channels have initiated informal discussions with producers, asking them to reduce the cost by 20-40%.\n", "\n", "Earlier, Uday Shankar, chairman, Star & Disney India and president, Asia Pacific of the ", "Walt Disney Company", ", while talking to ", "ET Now", ", had commented that the broadcasters will have to reduce programming cost once the lockdown is lifted. “All broadcasters will have to very aggressively revisit their programming cost. Those who were making 10 shows will be forced to start with 3-4 because of the logistical as well as the financial pressure,” Shankar told ET Now.\n", "\n", "TV producers", " also agree that there will be pressure to reduce cost.\n", "\n", "“Since advertising revenues of broadcasters have taken a huge hit, everyone is talking about rationalisation,” said Mautik Tolia, CEO, Bodhi Tree Multimedia. “At this time, nobody has a clear idea on what is the extent of the damage, which can be ascertained only after the lockdown is lifted. The situation on the ground is changing every day. But for the cost to come down, the entire ecosystem will have to scale down.”\n", "\n", "A couple of producers, who had their daily soaps running on three mainline Hindi general entertainment channels, told ET that broadcasters have indeed reached out to them with new proposals.\n", "\n", "“All producers making shows for ", "Star Plus", ", Zee TV, Colors, Sony Entertainment TV, have received calls seeking a reduction of cost. Some of us, who were pitching new shows, have been told that the negotiations will start at 60% of the proposed cost. It’s not easy,” said executive producer at an independent production company. \n", "\n", "Other producers argue that it is easy to talk about cutting cost, but not easy to implement, if you need quality content.\n", "\n", "“If you cut cost and reduce quality, viewership will go down, which will ultimately impact ad revenues,” one executive explained.\n", "\n"]], "tags": ["Walt Disney Company", "TV producers", "et now", "Star Plus", "broadcasters"]},
{"heading": [["Spotify signs content deals with aawaz.com, private FM channels"]], "sub_heading": [["The global deal with aawaz.com will allow Spotify users access to 48 different audio originals, podcasts and audio shows from the Hindi repertoire of aawaz amounting to 700 episodes and a total of 100 hours across genres including comedy, stories, horror, spiritual, lifestyle, and entertainment."]], "time": [["Last Updated: May 15, 2020, 12.31 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Swedish ", "audio streaming", " service ", "Spotify", " has signed exclusive content deals with ", "aawaz.com", ", an Indian ", "podcasts", " and spoken-word audio network, and private ", "FM channels", " Radio City and Big FM.\n", "\n", "Spotify has also launched 12 new podcasts after the response it received for the first three Spotify Original podcasts that the company had launched in December last year.\n", "\n", "“We’ve continuously analysed what users are listening to, and gradually commissioned original podcasts that our local users relate to, and want to engage with. Much of this content is non-fiction, but we are also open to fiction,” said Amarjit Batra, managing director, Spotify India.\n", "\n", "The global deal with aawaz.com will allow Spotify users access to 48 different audio originals, podcasts and audio shows from the Hindi repertoire of aawaz amounting to 700 episodes and a total of 100 hours across genres including comedy, stories, horror, spiritual, lifestyle, and entertainment.\n", "\n", "“We are elated to partner with Spotify through this global licensing arrangement that brings the best of aawaz to Indians and Indian diaspora around the world,” said Sreeraman Thiagarajan, cofounder and CEO, aawaz.com.\n", "\n", "The 12 new podcasts include ‘Special Mission with Gul Panag’, ‘Maha Bharat with Dhruv Rathee’, ‘Zindagi Unplugged’, ‘Our Last Week with Anuvab & Kunaal’ and ‘Off Script with Salil’, with a total of over 200 episodes.\n", "\n", " “Creating high quality podcasts is a relatively new phenomenon in India, and at Spotify, we are keen to work with committed creators and production houses to bring relevant, local content for not only listeners in India, but also for our millions of users across 78 other markets,” Batra added.\n", "\n", "Spotify claims to have over one million podcast titles on the platform.\n", "\n", "\n", "\n", "\n"]], "tags": ["Podcasts", "Spotify", "aawaz.com", "audio streaming", "FM channels"]},
{"heading": [["Film producers and multiplexes at loggerheads over video streaming releases"]], "sub_heading": [["On Thursday, when it was announced that Amitabh Bachchan – Ayushmann Khurrana starrer ‘Gulabo Sitabo’ will be aired directly on Prime Video, Inox said that the company will be constrained to examine its options, and reserves all rights, including taking retributive measures, in dealing with such ‘fair-weather friends’."]], "time": [["Last Updated: May 15, 2020, 07.20 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: After film producers started talks with leading video ", "streaming", " services to directly release their films on the ", "OTT platforms", ", a war of words has broken out between the producers and the multiplexes who are miffed at producers skipping the ‘theatrical window’.\n", "\n", "Theatrical window is the period between a film’s release in movie ", "theaters", " and its release on other platforms.\n", "\n", "The Producers Guild of India on Friday issued a statement, responding to film exhibitor ", "Inox", " Leisure’s earlier statement in which the multiplex player has strongly criticised producers for skipping theatrical release during the ", "lockdown", ", calling such producers as ‘fair-weather friends’.\n", "\n", "The guild said it is disappointing to see “abrasive and unconstructive” messaging from some of the colleagues in the exhibition sector, hinting at Inox.\n", "\n", "It also highlighted that at this difficult time, all stakeholders — producers, distributors, exhibitors, daily wage earners and technicians and others — have to support each other.\n", "\n", "“Statements that call for ‘retributive measures’ against producers who decide to take their movies direct to OTT platforms -especially at a time when cinemas are unfortunately closed for the foreseeable future - do not lend themselves to a constructive or collaborative dialogue on the way forward for the industry,” PGI’s statement said.\n", "\n", "ET had first reported on May 5th that tension is brewing between the producers and the multiplexes after producers started exploring ways to cut down their losses by releasing the films directly on the OTT platforms.\n", "\n", "On Thursday, when it was announced that Amitabh Bachchan – Ayushmann Khurrana starrer ‘", "Gulabo Sitabo", "’ will be aired directly on ", "Prime Video", ", Inox, India’s second largest multiplex chain, said that the company will be constrained to examine its options, and reserves all rights, including taking retributive measures, in dealing with such ‘fair-weather friends’.\n", "\n", "“Inox has been investing profoundly towards adding world class quality screens, across the country, only to provide more eyeballs to the great content being produced. This partnership has endured for decades, and has provided succour to each other. In these troubled times, it is disturbing to see one of the partners not interested in continuing the mutually beneficial relationship, especially when the need of the hour is to stand shoulder to shoulder with each other, and bring the film industry back to its vibrant best,” it said.\n", "\n", "Criticising Inox, the Guild highlighted that when it comes to financial losses, the situation of the producers is no different from exhibitors.\n", "\n", "“Elaborate and expensive sets erected for under-production films have had to be taken down due to no date in sight for shoots to resume, with the sunk cost of the set and studio rentals to be borne completely by producers - as insurers refuse to cover the cost. Shoot schedules have had to be abruptly cancelled due to the lockdown, with huge cancellation charges being borne completely by the producer,” said the guild.\n", "\n", "The issue at hand is that cinema screens may be one of the last sectors of the service likely to be given permission to re-open.\n", "\n", "Also, if all the producers wait, there will be a huge backlog of films, which will lead to sub-optimal showcasing of small and mid-budget films.\n", "\n", "The guild said that the producers will seek out all avenues available to recover their investment and to stay in business, while adding that a theatrical release will always be the preference for movies that were conceptualised as cinematic experiences.\n", "\n", "“These are unprecedented times and it is imperative to see things in that context,” the guild said. “For producers to continue to keep producing' the movies that light up our cinema screens, they need to continue to be in business in the first place.”\n", "\n", "Meanwhile, PVR also issued a statement, maintaining that the theatrical release is the “best way” for audiences to experience the labour and creative genius of the filmmakers.\n", "\n", "“The on-going Covid-19 crisis has caused an unfortunate shutdown of cinemas. We are confident, once we get to the other side of this crisis, there would be enough and more pent up demand from cine-goers who have been cooped up at homes for the last many weeks,” said Kamal Gianchandani, CEO, PVR Pictures.\n", "\n", "He added that PVR is disappointed with some producers’ decision to go straight to the streaming platforms. “We were hoping that the producers would accede to our request to hold back their film’s release till cinemas reopen. That said, this is not the first time films are being premiered on a streaming platform,” Gianchandani said.\n", "\n"]], "tags": ["inox", "gulabo sitabo", "OTT platforms", "Streaming", "theaters", "lockdown", "Prime video"]},
{"heading": [["Understanding India’s streaming platforms industry in the context of lockdown"]], "sub_heading": [["Sector experts believe that because of potential threat of contracting with the Coronavirus, people may avoid group engagement activities such as watching films in theatre for a long time. Considering this fact, producers are releasing films slated to be released in theatres on streaming platforms."]], "time": [["Last Updated: May 20, 2020, 11.05 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["In the book Folktales From India—a precious contribution to Indian culture—poet, and an authority on Indian aesthetics A K Ramanujan narrates a South Indian folktale. The folktale is called Losing a Self. It is a story of a Guru and his twelve idiot disciples. They want to cross a river. But the river is treacherous. They wait for some time. After making a firm resolve, they cross the river. As they reach the other end, a disciple starts counting to ascertain whether all were able to cross the river. He counts everyone except himself. All believe that one person died while crossing the river. But they are unable to figure out who died. A magician passing by listens to their problem patiently. He reassures them that he will solve this conundrum. He asks a disciple to bring cow dung and make a long line of cow dung. After asking all to stand in a row in front of the cow dung line, he asks all to bend down and press their noses in the dung. He asks them to count the number of dents in the cow dung. They unanimously agree that the number is thirteen and realise no one has died while crossing the river. In an allegorical sense, this folktale—like many folktales which have a certain amount of truth in them—reflect an inveterate tendency in ", "entertainment industry", " to spell doom for cinema and theatre every time a ‘new avenue’ of entertainment gains high acceptance among viewers.\n", "\n", "In almost every evolutionary phase, it is assumed that a new avenue of entertainment will make the old or already existing avenues of entertainment irrelevant or unprofitable. It started with the advent of television. This was followed by huge acceptance of cable television and watching films at home by renting movies from video library, proliferation of private television channels, and Direct-To-Home (DTH) services. Throughout these phases, a constant concern is piracy, which still persists. And now, the latest threat or a concern is increasing acceptance of streaming platforms as a serious contender which can jeopardise the existence of theatre and the way we watch cinema or consume content. These observations have found more relevance in the context of ", "lockdown", " which has made a large section of viewers realise the power of streaming platforms in providing engaging and entertaining content.\n", "\n", "Sector experts believe that because of potential threat of contracting with the Coronavirus, people may avoid group engagement activities such as watching films in theatre for a long time. Considering this fact, producers are releasing films slated to be released in theatres on streaming platforms. Given these new realities, a few key questions which have popped up in minds of experts and viewers are: Will streaming platforms define the way we watch films as more and more films are being released on these platforms? Will theatre lose its relevance as the costs attached to watching a film in theatre are not economical in comparison with watching a film on a streaming platform in a well-equipped surround sound home-theatre environment? What exactly has happened with the advent of streaming platforms to other avenues of entertainment in India? And most importantly, like the South Indian folktale, will streaming platforms co-exist with the old or already existing avenues of entertainment such as television and theatre? Let us understand these aspects in detail:\n", "\n", "\n", "\n", "\n", "For a long time before private channels proliferated, viewers shared a common experience of watching serials on the government-sponsored channel Doordarshan. These serials had substance, entertainment value and a certain touching simplicity of presentation which had elements to make them stuff of nostalgia. Even today these serials are re-watched with the same fervour and warmth as they were watched when they were shown on Doordarshan. From mid-1980s, serials such as Hum Log, Buniyaad, Nukkad, Ramayan, Mahabharat, Byomkesh Bakshi, Vikram Vetal, Trishna, Oshin and Kirdaar showed that in a limited episode format one could entertain and appeal to a wide and vast audience. These serials were based on literature, true events, original ideas and mythology. In a clear sense, these very ingredients make streaming platforms a unique offering today. The experience of watching serials in the mid-1980s on ", "Doordarshan", " has been almost similar to what today’s audience experience watching web series on streaming platforms. The only difference is web series on streaming platforms have better production value than the serials on Doordarshan. This aspect may give a sense of novelty to what streaming platforms have to offer. \n", "\n", "In the mid-1990s, things changed drastically. A large number of private channels were launched as the power of television as a medium of reaching out to a wide audience was acknowledged and recognised by producers and advertisers. Television provided a viable economic model of making money for creators and investors. This resulted in what usually happens when too many players enter an industry. When a structure and the costs associated with that structure are not so high, creative freedom is also high. Such structures are congenial for creating artistic content. But when structures grow and evolve as more players enter and compete, creative freedom gets sacrificed and more importance is given to the viability of the content. In such a structure, ‘science’ prevails. The focus shifts to creating serials which can be elongated and are not tight enough from providing wholesome and meaningful entertainment in limited episode format. This is because such a structure is remunerative for producers in terms of television rating points and hence, advertisements. Consequently, serials became imitative and monotonous. This brought division in categories of audiences.\n", "\n", "The audience which craved for wholesome, meaningful and thought-provoking entertainment was utterly ignored. Infrequently, this audience satisfied this taste from films or some serials which showed the promise of good entertainment in the early phase but subsequently conformed to the format dictated by market forces. This created division among audiences and it became clear to advertisers that the target audience for general entertainment content on television will be non-working women and men will be interested in sports and non-entertainment channels. \n", "\n", "Over the years, a few categories of audiences, which already existed, exhibited their distinction in the way they watched content. These categories showed a clear trend how content will be consumed in theatre as content on television became extremely formulaic, imitative and sterile. Broadly speaking, six categories of audience emerged in the two decades. Firstly, there is an audience of evolved taste. They are nothing but discerning audience. They have access to information and they understand what they like and what they don’t like. This category basically is a torrent audience who download films from the internet. Then, there is an audience which, largely, catches up with others around them. This audience gets disappointed far often than the evolved audience because it goes to theatre more often than the audience of evolved taste. Then, there is urban audience which just seeks pure entertainment. This audience does not have keen interest in cinema. They don’t have any viable and equally interesting means or avenues of entertainment on weekends. For them, going to theatre for a film is a family outing. This ritual borders on discharging family duty of taking care and being considerate towards wife and kids.\n", "\n", "This category is followed by lower middle class, which is the staple audience for Hindi movies. This audience has sustained the formula on which the juggernaut called Hindi cinema has been established. A film which merges known tropes without making it esoteric and presenting it in a fresh way is an event for this audience. Watching films in theatre is a strict ritual for this audience because it is like a spiritual ceremony in dark which gives them intense happiness. This is the most stable theatre goer. The fifth category is the audience which is in tier-II and tier-III cities. This audience in tier-II and tier-III cities is driving revenues at the box office because of two reasons. One, multiplexes have expanded in these locations rapidly in the past five years as space constraints and rising costs in cities make expansion outside metros more feasible and viable. Two, audiences in tier-II and tier-III believe the ritual of going to multiplexes as one of the ways they catch up with city-dwellers. And lastly, there is rural audience which is undemanding and is content with what comes its way.\n", "\n", "Increasing predictability of content on television, rising ticket prices, economical internet packages (the launch of Jio services has played a critical role in this), exposure and understanding of well-written and superbly executed English and non-English content from the west, easy access to films through piracy and most importantly, the freedom to watch content at one’s subjective pace and convenient time without the patience-testing advertisements sowed the seeds for a much-needed space for an offering for the audience with evolved taste. Streaming or Over The Top (OTT) platforms filled up this space in the past five years.\n", "\n", "Today, in India, there are close to thirty-six streaming platforms which are owned by Indian companies. Apart from these, there are global streaming platforms such as Netflix, ", "Amazon Prime", " Video, and Disney+Hotstar.\n", "\n", "Since the lockdown it is clearly evident that the awareness and importance of streaming or OTT platforms has increased. According to various estimates and reports, there has been jump of 8-100% in subscribers’ addition of major OTT platforms. According to industry experts, the lockdown has helped OTT platforms secure new subscribers. Even the average age of the subscribers’ universe has increased. Film-maker Shivdarshan Sable says, “I think this is clearly evident that the lockdown has been a blessing in disguise for streaming platforms. Earlier, the average age of the subscribers’ universe might be less than 30. Due to lockdown, I think the average age of the subscribers’ universe has gone up. I am certain that today a fair share of the new subscribers added will be in the age group of 35-55.” This means that there are an increasing number of people who are acknowledging the engaging and superior production value of the content offered up by streaming platforms.\n", "\n", "The recent flurry of release of Hindi films on streaming platforms also add to their increasing importance as it shows that producers have acknowledged the potency of these platforms in distributing content and reaching out to a large universe of viewers. Amazon Prime Video has acquired seven Bollywood and regional films. A noteworthy aspect about this flurry of release is they also include films boasting big stars and well-known directors and producers. A case in the point is the film Gulaabo Sitabo. Well-established and critically-acclaimed director Shoojit Sircar directed the film which has successful pairing of the man with a Midas touch Ayushmann Khurrana and Amitabh Bachchan. \n", "\n", "\n", "\n", "Now, in this context of the increasing importance of streaming platforms among viewers and producers for content consumption and distribution, one needs to understand whether business in television or theatre affected. \n", "\n", "Gauging the pattern of how television and streaming platforms are providing content, it is evident that television and streaming platforms feed into each other. It has been observed that the content generated by television finds its place in the catalogue or offerings of streaming platforms also. The famous TV series Kyunki Saas Bhi Kabhi Bahu is available on streaming platform Disney+Hotstar. It is also observed that broadcast-backed streaming platforms show the content of their streaming platforms on their respective channels. For instance, the content of Zee5, a streaming platform of Zee Entertainment Enterprises, is being shown on its channels also and vice versa. This aspect of feeding into each other is likely to prolong the relevance of television and quell any kind of panic-driven knee-jerk assumption that streaming platforms will kill television. \n", "\n", "Besides this, television will serve its purpose in different ways. The emergence of Smart Television with surround sound home theatre facility gives a new purpose of watching content of streaming platforms on television. Also sporting events which require bigger screen than mobile devices will also justify the existence of television. Most importantly, India’s infrastructure will provide longer life for television to exist because broadband and telecommunications connectivity are yet to penetrate deeper in locations beyond tier-II and tier-III cities. This is evident from the fact that one of the most highly watched series during lockdown period was the re-run of the serial Ramayan on DD National. This indicates that there is no threat for TV from streaming platforms. \n", "\n", "Even as regards theatre, streaming platforms have not been a threat to their business model. It has been more than five years global streaming platforms have entered into India. And encouraged by them, television channels launched their own streaming services. In the past five years, there has been no impact on footfalls in theatres. Footfalls in two major multiplexes such as PVR and Inox Leisure have grown in this period. Footfalls in PVR and Inox Leisure grew to 99.4 million and 62.5 million respectively in FY19 from 59.9 million and 38.6 million respectively in FY14. Also an analysis of financial performance of these multiplexes before the advent and after the advent of streaming platforms (FY14) shows that there has been reasonably good growth in revenue per screen before and after FY14.\n", "\n", "Revenue per screen for Inox increased to Rs2.9 crore in FY19 from Rs2.6 crore in FY14. Similarly, for PVR, revenue per screen increased to Rs4 crore in FY19 from Rs3.1 crore in FY14. Also the number of films which recorded more than Rs100 crore at the box office jumped close to two times to 13 in FY19 from seven in FY14, points out a KPMG report. Even the box office collections have grown to Rs3759 crore in FY19 from Rs2493 crore in FY15. This is despite the fact that the average ticket price of multiplexes has been rising in the range of 5-8% in the past five years. This shows that streaming platforms have not created any material impact on theatre business as it is content which attracts viewers to theatres not just the ‘avenue’ of entertainment.\n", "\n", "\n", "\n", "Though till last year, streaming platforms have not hurt the theatre or movie business, due to the recent announcement of films to be released on streaming platforms in the coming months, there is an increasing concern over the future of movie and theatre business. This is because digital release does not fetch returns as high as theatrical release. According to an analysis of auditing firm KPMG, around 75% of overall revenue on a film comes from big screen cinema release while digital makes up 13% and the rest from television and satellite broadcasting. Given the small share of revenues streaming platforms generate, it is unlikely it will jeopardise the business model of movie and theatre business.\n", "\n", "Besides this, it is the very structure of content offering of streaming platforms works in the favour of movies and theatre business. This is because the structure does not appeal to all kinds of audience. In recent years, there have been a few observations of well-known film-makers which amply explain the fact that cinema or movie business is likely to remain and will charm the audience for years to come. There are three key observations of famed and critically acclaimed film-makers why cinema or theatre as an avenue will survive and not lose its relevance. These comments centre on the very structure of streaming platforms. Director Oliver stone, in an Oxford Union dialogue, said that the content on streaming platforms is journalism and cinema has a quality of literature. He said, “It (content on streaming platforms) makes the first draft longer...a first draft of history. In other words, it is like a journalistic account. You have to go deeper and that is what makes movies interesting. Once you get to a movie usually years later you really can go in there and try to see the patterns at work.” Also director Alfonso Cuaron, in the ", "YouTube", " channel BAFTA Guru said, “What we are experiencing on platforms is not necessarily cinema. It is more connected with television. I am lost in a series not because of its cinematic value of the series. I am getting lost in a story. In many ways, it is becoming a media for lazy readers. What I am more intrigued about is cinema.” An interesting remark of director Joel Coen of director duo Coens Brothers also shows how the structure of content of streaming platforms does not pose a threat to movie and theatre business. He said the content on streaming platforms has start, middle but no end and goes on and on. Cinema, on the other hand, has an end which gives it a sense of finality in presentation in limited time. \n", "\n", "Also the structure of content offering on streaming platforms entails long hours of watching comes with its own health problems. Dr. Priyanka Shah Dattani, Counselling Psychologist at NH SRCC Hospital, Haji Ali, Mumbai said, “I think these platforms are largely about the concept of indulgence. Earlier you would wait for things which would delay gratification. But this concept of ‘binge watching’ for instant gratification is a serious matter which needs pondering. One of the serious repercussions is this whole exercise numbs you out. You become emotionally numb. In psychology, it is said you can heal what you feel. But when you are emotionally numb it becomes difficult to assess exactly what is the problem. It results various kind of mental and physical ailments such as depression and Spondylitis due to continuous watching of content.” She added, “Besides, one does not build any social skills as interaction with the outside world is bare minimum. The whole process disconnects you from the outside world and provides you an alternative reality within the confines of a virtual world. This is suspension from reality and it disconnects a person from her inner world. One hardly acquires any skills.” She pointed, “As regards adults, stress levels have gone up. The idea of recreation has changed to watching content on these platforms rather than talking to child or spouse. Children are lot more affected than adults. Since they have more time and chemically wired to emulate adults, their sleep pattern is massively affected. A lot of children are sleeping as late as 2 am. Across the board one can see how the content has created distraction affecting relationship, work and productivity. ”\n", "\n", "In a sense, streaming platforms are like television channels only. They show programmes on digital platform. The only difference is OTT platforms provide content to the viewer in the following manner: When they want, where they want and how they want. This means there is convenience and freedom to viewers to watch content anytime and at any point in the narrative of a series. Though these platforms have created a perception that they cater to a certain category of viewers, in truth, they are merely creating “library” of content. It is clear that they want to cater to all and sundry. This is evident from how content is delivered on these platforms. These platforms provide subtitles. One can listen to the narrative of a series in more than language (includes regional languages) apart from English. According to Ernst & Young, Indian consumers prefer to watch videos in vernacular and regional languages. In India, close to 93% of the time spent on videos is in Hindi and other regional languages. As a result, streaming platforms have content which go beyond Hindi and English and reach out to these consumers.\n", "\n", "Another aspect of business model of streaming platforms is what looks like the strength of these platforms can also be its limitation. These platforms sustain on creativity, which unlike plain advertisement model, does not make up for fickle pattern of subscription. According to several research studies, viewers have shown clear preference for original and fresh content. This shows that subscribers are more interested in fresh and original content, which is a tall order to a certain extent. Given these realities, viewers will not be glued to their OTT screens and will step out of their comfort zones and watch films in theatres.\n", "\n", "In the coming years, one is likely to see three trends in the context of increasing acceptance of streaming platforms. One, mid-budget and low-budget films may straight away release on streaming platforms. This trend is already evolving. But it will become more prominent. This is because of two reasons. One, high cost involved in promoting or publicity of a mid-budget or low-budget film. A mid-budget film costs Rs25-40 crore and a low-budget film is made in less than Rs25 crore. But publicity is a huge expense. A case in the point is director Apoorva Lakhia’s film Haseena Parkar released in 2017. The director in an interview mentioned that the film was made for Rs 11 crore and the publicity budget of the film was Rs 8 crore. Two, low-and-mid-budget films have to compete with big-budget films, which occupy disproportionately higher screens in theatres. \n", "\n", "The second trend is the change in economic model of film-making. Film-makers point out that in the near future certain Hindi films will be made under a budget that even if they get released straight on streaming platforms the producers will not lose much money. Lastly, streaming platforms industry will consolidate. Presently, there are thirty six OTT or streaming platforms. This means there is intense competition among streaming platforms to attract viewers in times when viewers are spoilt for choice regarding content. Streaming platforms do not follow the traditional advertisement-based revenue model which means that they have to rely on huge cash which may result in high debt for companies. Also subscribers are largely fickle and they switch their accounts to different platforms as and when they find a series exciting.\n", "\n", "Only those platforms which have backing of strong balance sheet and moneyed or strategic investors will survive and acquire weaker players who may die a natural death due to lack of funds. According to industry veterans, the budget of a web series is almost similar to a film’s budget. A web series is shot as a film and cut and edited in episodic format. This requires more money than television series where money is provided on each episode basis and locations are mostly interior. This will put pricing pressure on streaming platforms. It is quite likely that broadcast-backed and international streaming platforms will survive. They have long experience and brand power, which will help secure funds.\n", "\n", "In the overall scheme of things, most avenues of entertainment will co-exist because they will not only feed into each other but also independently and distinctly serve their purpose. It has been observed that even feature length film directors produce work exclusively for OTT platforms. In addition to this, they make films which are released only in theatre first and then on OTT platforms. Theatres will release films which will be experiential in nature and can only be enjoyed better in theatres than any platform. Television will also survive as it serves a break from theatre and OTT platforms. But OTT platforms face two major threats. These are piracy and censorship. If the government changes censorship rules and brings out fresh rules for streaming platforms industry, then it may affect the quality of content on streaming platforms. This is because censorship will curb creative freedom, which is the fundamental reason for the huge acceptance and success of content of streaming platforms. Also piracy, which affects cinema, affects OTT platforms.\n", "\n", "In the context of these realities, it will be the viewers who will benefit amply. They will continue to have access to humongous content. The various avenues of entertainment—television, OTT, cinema and other social media platforms—have created a food thali which satisfies hunger of almost all kinds of viewers. But the appetite of viewers is also humongous. The content creators know whom they are serving. To borrow a phrase of poet Dom Moraes’ writings, the content creators know that they are serving ‘a ferocious master’ in viewers. In the coming years, the success and longevity of these avenues of entertainment will be tested in this question: Are viewers watching content because they have time at hand or the content is so good that viewers are making time to watch it? \n", "\n"]], "tags": ["YouTube", "entertainment industry", "amazon video", "Hotstar", "online streaming", "lockdown", "doordarshan", "Amazon Prime"]},
{"heading": [["Audiences eager to go back to cinema halls, says Ormax survey"]], "sub_heading": [["The report, ‘Back to the Theatre’, suggests that 82% of cinema-going audiences are missing going to the theatres a lot during the lockdown and a dominant section of audience believe that they will go back to the theatres within 2-3 weeks of them re-opening."]], "time": [["Last Updated: May 25, 2020, 05.41 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: For multiplex players, who are fuming over the fact that some ", "filmmakers", " have decided to release their ", "films", " directly on digital video streaming services, there is a lot to cheer for. A latest survey of cinema ", "audience", " by specialised media consulting firm Ormax Media suggests that viewers are missing theatres a lot during the lockdown and would like to watch the films on the big screen.\n", "\n", "The report, ‘Back to the Theatre’, suggests that 82% of cinema-going audiences are missing going to the theatres a lot during the lockdown and a dominant section of audience believe that they will go back to the theatres within 2-3 weeks of them re-opening.\n", "\n", "Conducted earlier this month, the online survey is based on responses from 1,000 regular theatre-goers of over 15 years of age group from across 58 cities and towns and Hindi, Tamil and Telugu audiences.\n", "\n", "While respondents agree that social distancing and sanitisation precautions taken by theatres will play a crucial role in their decision to visit, 75% audiences said that they will visit the theatres within the first month of opening, out of which 28% said they will go to theatres as soon as they open. \n", "\n", "A mere 6% audience said that they will not go for another 6 months, while 19% respondents said they will wait for 1-2 months.\n", "\n", "Earlier, PVR Pictures chief executive Kamal Gianchandani had said that while the on-going Covid-19 crisis had caused an unfortunate shutdown of cinemas, once the industry get to the other side of this crisis, there would be enough and more pent up demand from cine-goers who have been cooped up at homes for the last many weeks.\n", "\n", "Interestingly, the ", "Ormax survey", " also points out that movie consumption on TV or video streaming is hardly a cause to worry for cinema exhibition players. Only 9% respondents said that they are used to watching content on TV or OTT services.\n", "\n", "However, multiplexes will have to assuage safety concerns of their audience, which is the biggest barrier, to which almost 70% of respondents agreed to.\n", "\n", "Basis the survey, Ormax believes that theatre-specific measures and the local Covid-19 situation will drive the decision to go to movie theatres more than the content itself. Hence, effective communication by theatre chains becomes pivotal to win the audience’s confidence.\n", "\n", "Also, 69% of the respondents have said that they would love to watch films in theatre, despite of the film’s size and budget, while just 31% said that they will only go for big films and top star cast.\n", "\n", "The survey also pointed out that the audiences are not expecting theatres to reduce ticket prices to lure them as 71% respondents feel that cinema owners can keep the ticket prices same, but should spend money on safety measures.\n", "\n"]], "tags": ["cinema halls", "ormax survey", "films", "audience", "Filmmakers"]},
{"heading": [["ZEE creates fresh content across TV, digital, live entertainment amidst lockdown"]], "sub_heading": [["The company said it has started using technology solutions across its key functions through remote production of content over mobile and professional cameras to support broadcast, digital and social platforms. All the content has been shot at the homes of the respective celebrities using mobile phones."]], "time": [["Last Updated: May 22, 2020, 10.40 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Even as all production activities are halted in Mumbai due to the ", "lockdown", ", ", "ZEE Entertainment", " Enterprises (ZEE) said Thursday that it has created original content for its consumers.\n", "\n", "The company said it has started using technology solutions across its key functions through remote production of content over mobile and professional cameras to support broadcast, ", "digital", " and social platforms.\n", "\n", "“I am very proud of our teams for making the optimal utilisation of technology solutions to ensure that our consumers continued to get a fresh dosage of entertainment content, amidst the lockdown,” said Punit Goenka, MD & CEO, ZEE. “We will continue to create fresh, rich and engaging content for our viewers, by discovering new means and paths. It is time for the Industry to define a new normal, to ensure that our consumers remain well-informed and entertained.”\n", "\n", "For television, ZEE is bringing together the music industry across 10 states with celebrities, music stalwarts, best of Saregamapa singers and judges to deliver a 25 year silver jubilee concert.\n", "\n", "The 25-hour live music marathon, ‘Ek Desh Ek Raag’ will raise funds for India ‘COVID Response Fund’ by GiveIndia.\n", "\n", "As a first of its kind ", "TV", " + Digital Musical initiative, the 25-hour digital live-athon will start on May 23rd on Zee TV and our other popular channels. The title song of the iconic singing reality show is being rendered in 10 languages with the contribution of Pandit Jasraj, Ronu Majumdar, Selva Ganesh, Himesh Reshammiya, Shaan, Udit Narayan and others.\n", "\n", "The company will also launch new non-fiction shows two non-fiction shows, ‘Lockdown Diaries’ and ‘Coffee with Anu’ in on Zee Kannada and three non-fiction shows on Zee Marathi - ‘Vedh Bhavishyacha’ (a spiritual chat show), ‘Gharchya Ghari Home Minister’ (a virtual format of the popular show ‘Home Minister’) and ‘Gharat Basle Saare’ (a standup comedy puppet show by Ramdas Pandhye).\n", "\n", "The popular Marathi channel will also offer four new fiction shows, shot locally in Maharashtra under the new social distancing guidelines.\n", "\n", "Zee Bangla has also launched three new shows, including ‘Lockdown Diaries’, which is completely shot on mobile and is a tribute to the human spirit of fighting through short stories that aim to portray the human bonding, family strength and positivity. \n", "\n", "ZEE’s Odia channel Zee Sarthak, which has been airing ‘Lockdown Challenge’, showcasing lives of leading celebrities during the lockdown, is also ready with a two-hour original movie, ‘Mu Tame Lockdown’ to be launched this June 2020.\n", "\n", "All the content has been shot at the homes of the respective celebrities using mobile phones.\n", "\n", "On the digital front, ZEE5, which launched 11 new original shows and movies amidst the lockdown, will also release five new shows by the end of May. These include ‘Bhalla Calling Bhalla’, ‘Never Kiss Your Best Friend’ (Lockdown Special), and ‘Kaalchakra’.\n", "\n", "The platform will also release Bollywood film ‘Ghoomketu’ on May 22nd.\n", "\n", "ZEE’s ", "live Entertainment", " vertical has converted its on-ground IP – Supermoon into Supermoon Live to Home. Streaming May 23rd, ‘Supermoon Live to Home’, will present 12 weeks of original content with acts of over 24 artists and bands including Bickram Ghosh, Palash Sen, Sahil Khattar, Varun Thakur, Mame Khan, and Parkirama.\n", "\n", "ZEE Music Company, meanwhile, will add over 1,000 songs to its catalogue this year despite the lockdown phase, the company said.\n", "\n", "During the lockdown phase itself, the vertical has released over 120 songs. The vertical is also focusing on creating ZEE Music Originals, home-shot music videos by renowned artists.\n", "\n", "The company is using its facility in Jaipur (Essel Vision) as a hub for post-production and edit support.\n", "\n"]], "tags": ["Digital", "TV", "Zee Entertainment", "fresh content", "lockdown", "live entertainment"]},
{"heading": [["Film bodies seek help from Finance Minister"]], "sub_heading": [["“It is sad the industry has been overlooked by the government. ​​We have sent numerous correspondences to the PM and I&B ministry for providing aid to hundreds of workers and technicians associated with the industry, who though are categorised as daily wage earners, have not received any help from the government,” film body wrote to FM."]], "time": [["Last Updated: May 25, 2020, 07.36 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Film bodies have written to the Centre asking for helping the industry tide through the ", "Covdi-19 crisis", ". ", "The Federation of Western India Cine Employees", " (FWICE) that represents associations covering 32 different crafts of the media and entertainment industry wrote to finance minister ", "Nirmala Sitharaman", " on Saturday, “It is sad the industry has been overlooked by the government. We have sent numerous correspondences to the PM and I&B ministry for providing aid to hundreds of workers and technicians associated with the industry, who though are categorised as daily wage earners, have not received any help from the government.”\n", "\n", "\n"]], "tags": ["I&B", "Nirmala Sitharaman", "new delhi film bodies", "The Federation of Western India Cine Employees"]},
{"heading": [["Baseline Ventures signs India’s under-19 cricket captain Priyam Garg"]], "sub_heading": [["The multi-year deal will see Baseline managing all the commercial interests of Garg. Born in Meerut, UP, Garg made his first-class debut against Goa in 2018 where he went on to score an unbeaten 117. He recently led the Under-19 Indian team at the World Cup in South Africa where they finished runners-up."]], "time": [["Last Updated: May 04, 2020, 01.35 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Sports marketing firm ", "Baseline Ventures", " has added India’s Under-19 cricket team captain ", "Priyam Garg", " to its talent roster.\n", "\n", "The multi-year deal will see Baseline managing all the commercial interests of Garg.\n", "\n", "Born in Meerut, UP, Garg made his first-class debut against Goa in 2018 where he went on to score an unbeaten 117.\n", "\n", "He recently led the Under-19 Indian team at the World Cup in South Africa where they finished runners-up.\n", "\n", "“I am excited to be represented by Baseline. They have helped build the careers of many young talents by guiding them in the right direction. I look forward to a great partnership with them,” Garg said.\n", "\n", "Garg has an impressive first-class record where he averages 66.69 in his 16 innings for his home state Uttar Pradesh. The youngster has made rapid strides since his breakout debut and was one of the most sort-after players at the ", "IPL", " auction in December. After some intense bidding between the Kings XI Punjab and ", "Sunrisers Hyderabad", ", he was finally bought by Sunrisers for Rs 1.9 crore (base price Rs 20 lakhs).\n", "\n", "“Priyam is a wonderful talent and a natural leader. At Baseline, we have always believed in helping athletes right from the start of their careers and helping them build their brands as their career grows. We are excited to welcome him on board and become a part of the Baseline family,” said Tuhin Mishra, managing director, Baseline Ventures.\n", "\n", "Baseline also represents Garg’s under-19 teammates, vice-captain Divyaansh Saxena, player of the tournament Yashasvi Jaiswal and wicket-keeper Dhruv Jurel.\n", "\n", "The company also represents and manages PV Sindhu, ", "Bhuvneshwar Kumar", ", ", "Smriti Mandhana", ", Prithvi Shaw, Pankaj Advani, Apurvi Chandela, ", "Saurav Ghosal", " and ", "Joshna Chinappa", ".\n", "\n"]], "tags": ["priyam garg", "Baseline Ventures", "Sunrisers Hyderabad", "IPL", "Saurav Ghosal", "Smriti Mandhana", "Bhuvneshwar Kumar", "Joshna Chinappa"]},
{"heading": [["Bengali OTT service Addatimes forays in Bangladesh"]], "sub_heading": [["While in India, Addatimes has both, paid and ad-supported model, in Bangladesh, the service in under paid-subscription only, priced at 299 Bangladeshi Taka (approx. Rs 266) per annum."]], "time": [["Last Updated: May 26, 2020, 03.45 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Addatimes, one of the fastest growing Bengali entertainment ", "OTT", " platforms from India has now entered in Bangladesh, with an ambitious target to reach 5 million subscribers in the first year.\n", "\n", "While in India, ", "Addatimes", " has both, paid and ad-supported model, in Bangladesh, the service in under paid-subscription only, priced at 299 Bangladeshi Taka (approx. Rs 266) per annum.\n", "\n", "“Bengali is the eighth most popularly spoken language in the world and Bangladesh is a country where the Bengali language is all-encompassing,” said Rajiv Mehra, founder and promoter, Addatimes. “We have all the ingredients to serve the Bangladeshi audience the real feast of entertainment.”\n", "\n", "For entry in the neighbouring country, Addatimes has partnered with LBC Media Entertainment Company, a concern of Agrani Holdings Group and Allianz FMCG Holdings.\n", "\n", "The Agrani Holdings Group", " and Allianz FMCG Holdings are the largest distributors of multinationals such as - British American Tobacco Bangladesh, Unilever Bangladesh, ", "Reckitt Benckiser Bangladesh", ", ", "Coca Cola", ", Pure It Water, Tele Labs Video Conferencing and more.\n", "\n", "As a distribution partner, Agrani Holdings Group will expand Addatimes' reach and business by entrusting the online streaming platform to OEMs, telecom companies and internet service providers, among others. They will also promote the brand in Bangladesh through marketing projects.\n", "\n", "“Our group has over the years, earned the reputation of rapidly developing strategic business environments with a strong understanding of the local culture,” said Sakib M Rahman, CEO, Agrani Holdings. “Addatimes is one of the most popular Indian-Bengali online streaming giants, offering a wide variety of content. Our distribution network will focus on providing the video-on-demand service across the country.”\n", "\n", "LBC has a strategic association with Insomnia Media and Content Services for curating, developing and producing content for LBC across genres and formats.\n", "\n", "“We are excited about Addatimes launch in the Bangladesh market. Insomnia is here to tell compelling untold stories, with global production values for the evolving audience,” said Juhi Parekh Mehta, co-founder of Insomnia.\n", "\n", "Addatimes showcases series, films, short films, music videos, crime fiction, biographies, talk shows, cookery and fashion videos. Its existing library has 21 original shows and over 18 are in the pipeline.\n", "\n"]], "tags": ["reckitt benckiser bangladesh", "bengali entertainment ott platforms", "addatimes", "OTT", "coca cola", "Reckitt Benckiser", "the agrani holdings group"]},
{"heading": [["TV broadcasters face existential crisis amid drop in ad revenue"]], "sub_heading": [["The very survival of small television networks and free-to-air (FTA) channels is at stake after the advertising slump due to Covid-19 pandemic delivered a crippling blow to their cashflows, and with costs mounting every day, the liquidity crunch has now begun hindering their day-to-day operations. "]], "time": [["Last Updated: May 09, 2020, 09.34 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: The very survival of small television networks and free-to-air (FTA) channels is at stake, as a slump in ", "advertising", " due to the Covid-19 pandemic has delivered a crippling blow to their cash flows. With costs mounting, the liquidity crunch has now begun hindering their day-to-day operations.\n", "\n", "Advertising revenue is the lifeline for small networks, constituting more than 75% of their total ", "revenues", ". For FTA channels, it is the only source of revenue.\n", "\n", "Out of around 900 permitted TV channels in India, only 330, or just over a third, are pay channels, and the rest are FTA. The top five broadcasters own around 250 of these channels.\n", "\n", "The Covid-19 crisis and the nationwide ", "lockdown", " have led to advertisers shifting resources to more critical business functions and that has resulted in companies cutting discretionary spends.\n", "\n", "TV advertising has dropped close to 50% in volume and 80% in value in April, and prospects are not looking any better in May, according to industry experts.\n", "\n", "No one knows how deep the impact of the current slump will be and for how long this uncertainty over the economy will last, a top executive at a large media agency said.\n", "\n", "“Testing time will be post July when consumer sentiment will be truly revealed. Right now, everything is based on guess work,” he said. “In April, advertising expenditure was down by 80% and May isn’t looking any better.”\n", "\n", "Some experts fear that the tough advertising environment could last a few months before the consumer sentiment changes.\n", "\n", "“Most of the categories and advertisers are not advertising. I believe this phase will last for another 5-6 months as advertising is driven by sentiments. It’s now a question of survival,” said the ad sales head of a TV network.\n", "\n", "However, some TV executives feel that advertising will return post second quarter. \"I am cautiously optimistic at present. We have cut cost and hope that second quarter will be better. In the festive season, advertisers should be back to at least 70-80% of last year's level,\" he said.\n", "\n", "In the last one month, most broadcasters have slashed budgets across functions, including production.\n", "\n", "ET had reported that categories which advertise heavily during summers, including soft drinks, ice-creams and ACs, have either not released or deferred their ad campaigns.\n", "\n", "“We are in a unique situation where the clients with money aren’t advertising while others who are facing disruption in their business are in no position to spend,” said a top executive of another media agency.\n", "\n", "Sources said planned campaigns of consumer companies like Coca-Cola, McDonalds and KFC have been cancelled or put on hold.\n", "\n", "A top executive from a traditional media company said large networks like ", "Star India", ", ", "Zee Entertainment Enterprises", " and Sony Pictures Networks would weather the storm due to their size, existing cash reserves, support from holding companies, and distribution revenues which might get delayed but will not be wiped out.\n", "\n", "“It looks like the overall ad ecosystem has collapsed and most of the impact will be on smaller and regional networks. If the crisis drags on for another 5-6 months, you will see a lot of channels staring at bankruptcy,” he added.\n", "\n"]], "tags": ["Zee Entertainment Enterprises", "star india", "covid impact", "lockdown", "advertising", "revenues"]},
{"heading": [["Nandan Srinath rejoins Mirchi as Executive President"]], "sub_heading": [[]], "time": [["Last Updated: May 11, 2020, 05.40 PM IST"]], "publisher": [["Mediawire"]], "article": [["  ", "  ", "  ", "  ", "  ", "  ", " ", " "]], "tags": []},
{"heading": [["Online release: It’s film producers vs multiplexes"]], "sub_heading": [["Multiplex players may boycott studios, actors if exclusive theatrical window not honoured"]], "time": [["Last Updated: May 05, 2020, 07.41 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: The Indian film industry is headed towards a major face-off between two of its biggest stakeholders – film producers and multiplexes – after film executives started exploring the option of releasing films, due for a theatrical release, on video streaming services. \n", "\n", "The cinema exhibitors have insisted that to-be-released films should not be made available to over-the-top (OTT) players. Multiple sources in the multiplex industry told ET that the exhibition players might take a hard stance of boycotting future releases from producers and actors, if they allow the films to be streamed before a theatrical release.\n", "\n", "“It’s a matter of survival,” said a top executive of a multiplex chain on condition of anonymity. “We are not against smaller films, which are meant to be released directly on streaming services, or films commissioned by ", "Netflix", " or other such services, to not have a theatrical window. But at a time when we are forced to cease operations, if producers and actors don’t support us, we will have to deliberate if we want to support them in the future.”\n", "\n", "\n", "\n", "\n", "In a statement, the Multiplex Association of India (MAI) requested all its partners – studios, producers, actors and content creators – to support the cinema exhibition sector by releasing their films in the theatres after lockdown ends. \n", "\n", "“We urge all studios, producers, artistes and other content creators, to kindly respect the exclusive theatrical window, which has been a time-tested industry practice, agreed upon by all stake-holders, not just in India, but even globally, for several decades,” the statement said.\n", "\n", "Currently there is an eight-week window between a theatrical and other screen release in India. \n", "\n", "However, producers are worried about mounting carrying costs on their investment, and piracy. “There is no certainty on when cinema screens will be allowed to operate again. Even after the lockdown is lifted, moviegoers might not want to visit cinema halls. We can’t just sit with a ready film till then, it costs us money every single day,” said a producer.\n", "\n", "The Covid-19 pandemic has caused major disruption in the films business with both multiplex owners and producers losing money due to shut cinemas. \n", "\n", "Cinema exhibition players have been rueing nil revenues since March and high recurring fixed costs. \n", "\n", "Multiple sources told ET that producers of films such as Laxxmi Bomb (Akshay Kumar-Kiara Advani), Gulabo Sitabo (", "Amitabh Bachchan", ", Ayushmann Khurrana) and Gunjan Saxena (Janhvi Kapoor) are already in talks with services including ", "Hotstar", ", Amazon Prime Video and Netflix to release the films directly on these services.\n", "\n", "Another producer said these are unprecedented times and no stakeholder is in a position to flex muscles. “A producer, sitting on a completed movie has no other way but to go to a video streaming service or a broadcaster. Everyone has to work together and I would have understood if it was business as usual, but it is not. Cinemas are not open right now so there is no point in them taking an adversarial stance right now,” he added.\n", "\n"]], "tags": ["Akshay Kumar", "amazon video", "Hotstar", "amitabh bachchan", "Netflix"]},
{"heading": [["The Economic Times continues to grow, daily readership crosses 1.1 million"]], "sub_heading": [["Indian business dailies added 270,000 readers to their monthly readership during this period, almost all of it accruing to ET."]], "time": [["Last Updated: May 13, 2020, 06.39 AM IST"]], "publisher": [["ET Bureau"]], "article": [["New Delhi: ", "The Economic Times", ", ", "India", "’s leading business daily, has further strengthened its leadership, as per the findings of the latest edition of the Indian Readership Survey (IRS) 2019 Q4. ET has gained 263,000 readers, underscoring the importance of credible and accurate information and analysis in a challenging economic environment. The research spans a period of November 2018 to March 2020, and compares with the Q3 reporting period of August 2017 to November 2019.\n", "\n", "Indian business dailies added 270,000 readers to their monthly readership during this period, almost all of it accruing to ET.\n", "\n", "Business Standard", " gained 45,000 readers, while ", "Mint", " (a fall of 32,000) and The Hindu Business Line (down 5,000) lost readers in the same period.\n", "\n", "As a result, The Economic Times is today read by over 4.4 million readers every month, using a metric called Total Readership (TR). Nearly a quarter of them — 1.1 million — read the newspaper daily. Daily readership is measured by Average Issue Readership (AIR). This is nearly double the combined readership of all other business papers put together (TR of 2.2 million and AIR of 620,000).\n", "\n", "\n", "\n", "\n", "\n", "ET occupied the fourth position among all English language dailies using both methods, TR and AIR. Times of India, our sister publication, continued to occupy the top position with Total Readership of 17.3 million.\n", "\n", "Interestingly, the new readers attracted to ET continue to be young, affluent and well educated.\n", "\n", "Nearly 87% of new daily readers are below the age of 40. Almost all belong to NCCS A category. And three-quarters of all 1.1 million daily readers of ET hold either a graduate or a higher education qualification.\n", "\n", "Barring a tenth of our daily readers, all others claim to spend 15 minutes or more with the paper daily. In terms of their relationship with this newspaper, 88% of ET’s readers do not read any other business paper.\n", "\n", "\n"]], "tags": ["et readership", "Mint", "The Economic Times", "Business Standard", "India", "economic times"]},
{"heading": [["Exhibitors seek PM's help to stop OTT release of films meant for theatres"]], "sub_heading": [["Single screens and multiplexes had since mid-March stopped screening in the wake of the COVID-19 pandemic.  More than 9,000 single screens and multiplexes might go out of business, and employees could lose jobs, if the trend continues, the association said in its letter."]], "time": [["Last Updated: May 12, 2020, 09.09 PM IST"]], "publisher": [["PTI"]], "article": [["Kolkata: Amid the long wait for ", "single screens", " and ", "multiplexes", " to reopen, some members of the Eastern India Motion Pictures of India have urged Prime Minister ", "Narendra Modi", " to take steps to stop producers from releasing films, primarily meant for ", "theatres", ", on OTT platforms. \n", "\n", "In a letter to the prime minister, the exhibitors' section of the association said producers, who having signed contracts with single screens and multiplexes, should not be allowed to release their films on over-the-top (OTT) sites, as it would add to the financial woes of ", "cinema", " hall owners. \n", "\n", "Single screens and multiplexes had since mid-March stopped screening in the wake of the COVID-19 pandemic. \n", "\n", "According to sources in the Bengali film industry, a number of producers have lined up their ventures for release on OTT platforms. \n", "\n", "\"Few producers for their personal benefit are releasing movies on foreign OTT platforms... This will be a threat to entire film industry,\" the letter said. \n", "\n", "More than 9,000 single screens and multiplexes might go out of business, and employees could lose jobs, if the trend continues, the association said in its letter. \n", "\n", "\"Movies are first released in theatres... goes to the OTT platforms after 60 days. But in this difficult time when all the theatre owners are supporting you and keeping their halls closed, why and how, without maintaining the status quo, few (production) houses can go ahead (with release)?\" the exhibitors said in their letter to the PM. \n", "\n", "Moreover, the government will lose on revenue earned from cinema halls, the letter said. \n", "\n", "Ratan Saha, the chairman of the EIMPA exhibitors' section, said, \"Releasing a film on OTT by skipping the conventional distribution route will mean that no one is going to watching it again, if screened in cinema halls. \n", "\n", "\"In West Bengal alone, the trend can deal a body blow to at least 225 single screen theatres. Several employees in multiplexes will be rendered jobless. We will follow up on our request through our contacts in Delhi in the next few days.\" \n", "\n", "Earlier, the ", "Multiplex Association of India", ", in a statement, had made a similar request to film producers, artistes and content creators. \n", "\n", "\"We urge all studios, producers, artistes and other content creators to kindly respect the exclusive theatrical window, which has been a time-tested industry practice, agreed to by all stakeholders, not just in India but even globally for several decades,\" it said. \n", "\n", "EIMPA, in response, had pledged its support to the multiplex association. \n", "\n", "\"This is the time to support each other so that we all can emerge stronger, whenever we make a comeback, Saha said. \n", "\n", "A film director, who did not wish to be named, said it was necessary to strike a balance so that everybody is benefited. \n", "\n", "\"We share their (exhibitors') concerns. Under present circumstances, it is not possible to ask a producer to indefinitely hold back a film, which had been completed before the pandemic. At the same time, we don't want to spoil the joy of watching movies in theatres. We have to strike a balance,\" he said.\n"]], "tags": ["multiplexes", "Narendra Modi", "Single screens", "Multiplex Association of India", "theatres", "Cinema"]},
{"heading": [["Media, entertainment sector revenue could take 16 pc hit in FY21: Crisil"]], "sub_heading": [["​​The industry would take a hit of around 18 per cent in revenue from advertisement that accounts for nearly 45 per cent of total income, while the subscription earning that  contributes 55 per cent will be relatively resilient with a likely decline of 14 per cent, Crisil said in a report. "]], "time": [["Last Updated: May 11, 2020, 06.42 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: The ", "media", " and entertainment sector is expected to witness 16 per cent decline in revenue for FY21, due to fall in advertisement and subscription ", "income", " in the wake of coronavirus-induced lockdown, rating agency ", "Crisil", " said. \n", "\n", "The industry would take a hit of around 18 per cent in revenue from advertisement that accounts for nearly 45 per cent of total income, while the subscription earning that contributes 55 per cent will be relatively resilient with a likely decline of 14 per cent, Crisil said in a report. \n", "\n", "Overall, the industry is expected to have a turnover of around Rs 1.3 lakh crore this fiscal, it added. \n", "\n", "\"The ongoing economic slowdown, made worse by the COVID-19 pandemic, is set to cull Indian media and ", "entertainment industry", "'s revenue by 16 per cent - or Rs 25,000 crore - to Rs 1.3 lakh crore this fiscal,\" it said. \n", "\n", "In FY20, the media and entertainment industry is expected to have a revenue of Rs 1.55 lakh crore with a CAGR growth of 9 per cent, while in FY19, it had reported almost 10 per cent growth to Rs 1.42 lakh crore. \n", "\n", "\"The sharp drop in revenues will impair the debt metrics of the industry, while balance sheet strength and time to recovery will determine the overall ", "impact", " on credit profiles,\" the rating agency said in a statement. \n", "\n", "While advertisement revenue, which correlates strongly with economic growth, will take a hit as India's GDP growth hurtles towards a multi-decade low this fiscal owing to the extended lockdown to contain the pandemic, it said, adding that \"weak economic conditions had kept advertisement revenue muted even last fiscal\". \n", "\n", "\"The overall revenue loss of Rs 25,000 crore for the industry will translate to significantly lower profits for companies despite cost-cutting measures,\" it added. \n", "\n", "The analysis is based on 78 media and entertainment companies rated by Crisil, it added. \n", "\n", "\"Overall ad revenue will plummet 18 per cent this fiscal, with the impact varying across segments. In digital, it will continue to grow but at a slower pace. All the traditional segments - television (TV), print, radio, out-of-home media, and films, in the order of impact from low to high - will see a significant decline,\" Crisil Ratings Senior Director Sachin Gupta said. \n", "\n", "TV, print and digital are the top three segments in terms of advertisement revenue. \n", "\n", "The resilience of the digital segment is driven by increasing use of devices and applications. \n", "\n", "\"For TV, impact on ad revenue will also be because of lack of new content on popular channels and postponement of major sporting events such as the ", "Indian Premier League", ". For newspapers, longer recovery time for key advertiser-industries such as automobiles, real estate and e-commerce would keep ad spend muted,\" it said. \n", "\n", "The top three segments for subscription revenue are TV, print and cinema, of which, TV continues to be healthy even during the lockdown. \n", "\n", "Newspapers have faced distribution challenges in certain areas leading to a temporary blip in the circulation revenue. But a sharp fall in box office collections will curtail subscription revenue, it added. \n", "\n", "\"Given the sharp reduction in revenues, debt protection metrics will certainly weaken this fiscal for media and entertainment companies. The large ones will surmount the stress given their ample liquidity and strong financials. But smaller players could see a sharp impact on their credit profiles as revenues decline and liquidity gets squeezed,\" Crisil Ratings Director Nitesh Jain. \n", "\n", "Multiplexes", " that have had strong credit profiles will see credit pressure aggravating because of longer road to recovery, he added.\n"]], "tags": ["Media", "entertainment industry", "Crisil", "multiplexes", "income", "indian premier league", "impact"]},
{"heading": [["No Fresh Content: Operators seek pay channel fee waiver"]], "sub_heading": [["The local cable operators (LCOs) in Maharashtra have sought a complete waiver of or a steep discount on general entertainment and sports pay channel fee as there's no broadcast of fresh content for the last two months."]], "time": [["Last Updated: May 19, 2020, 08.45 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: The ", "local cable operators", " (LCOs) in Maharashtra have sought a complete waiver of or a steep discount on general entertainment and sports pay channel fee as there's no ", "broadcast", " of fresh content for the last two months. In letter to NP Singh, president of the ", "Indian Broadcasting Foundation", " (IBF), the ", "Maharashtra Cable Operators Foundation", " (MCOF) has asked for a four month waiver or discount, starting from April till July.\n", "\n", "“All the channels have been recycling programmes for close to two months. Further, no one is in a position to assure as to when fresh programmes will be aired. Same is the case with sports and movie channels, which will be slower in offering fresh content as compared to GECs (general entertainment channels) and other genres,” Arvind Prabhoo, president of MCOF wrote in the letter. ET has reviewed a copy of the letter.\n", "\n", "MCOF believes that if the broadcasters don’t reduce or waive off the price of these channels -predominantly priced between Rs 10 – 19 per month – the subscribers might discontinue these on their own. Also, as multi-system operators (MSOs) continue to pressurise the LCOs to pay upfront fee monthly even when the subscribers are unable to pay, the operators, who are the last-mile link to the consumers, will be forced to do so.\n", "\n", "Prabhoo said that the situation can be reviewed in mid-July and a suitable decision can be taken based on ground realities. MCOF also highlighted that the operators too will be sacrificing their marketing fee. The cable operators are also dealing with collection problems. Prabhoo said, the monthly collection of cable TV services have dipped by almost 60% across the country due to the nationwide lockdown.\n", "\n"]], "tags": ["maharashtra cable operators foundation", "broadcast", "local cable operators", "fee waiver", "Indian Broadcasting Foundation"]},
{"heading": [["Radio industry seeks Rs 300 crore for survival"]], "sub_heading": [["In April alone, the revenue of the entire industry had shrunk to Rs 34 crore, from Rs 198 crore in April 2019. Compared to a profit before tax of Rs 18 crore in April 2019, the industry as a whole suffered a loss (before tax) of Rs 104 crore."]], "time": [["Last Updated: May 20, 2020, 07.06 AM IST"]], "publisher": [["ET Bureau"]], "article": [["MUMBAI: The private FM industry on Tuesday sent an ", "SOS", " to Union information and broadcasting minister Prakash Javadekar seeking an immediate relief package of Rs 300 crore to ward off the crisis staring at the industry.\n", "\n", "In her letter, Anurradha Prasad, president of the ", "Association of Radio Industries of India", " (AROI), requested the government to consider an economic survival package for FM ", "radio industry", ", to keep the sector alive.\n", "\n", "“We have watched closely with hope the economic packages announced by the finance minister over the past week. However, we are deeply pained to note that none of these measures has any effect, whatsoever, on the private ", "FM radio", " sector,” Prasad wrote.\n", "\n", "This is the third time, the association has requested help from Javadekar.\n", "\n", "Earlier, on May 12, AROI had sent a letter to Javadekar, highlighting the fact that the industry stands to lose over Rs 600 crore by end of September after advertising revenues nosedived post the Covid-19 outbreak and the consequent nationwide lockdown.\n", "\n", "In April alone, the revenue of the entire industry had shrunk to Rs 34 crore, from Rs 198 crore in April 2019. Compared to a profit before tax of Rs 18 crore in April 2019, the industry as a whole suffered a loss (before tax) of Rs 104 crore.\n", "\n", "“The trend has continued into May 2020 and is likely to spill well into the second quarter. We are looking at a cumulative loss of Rs 600 crore till September 2020, and may be more beyond,” Prasad had written in her previous letter.\n", "\n", "Prasad has also pointed out that the FM industry, over the next 12 years, is expected to pay around Rs 15,000 crore to the government in the form of entry fee, licence fee, migration fee and GST.\n", "\n", "\n", "\n", "\n", "In an earlier communication, Prasad had also written to Prime Minister Narendra Modi seeking his intervention.\n", "\n", "Currently, there are 371 private FM stations across 107 cities, out of which a large number are dependent on government advertising. Out of these, 31 are operated by micro, small & medium enterprises (MSMEs).\n", "\n", "AROI has been seeking a one year waiver from paying annual fees and charges to the government as well as Prasar Bharati and ", "Broadcast Engineering", " Consultants India Limited (BECIL). The association has also requested reduction of GST from the current level of 18% to 5% at most.\n", "\n", "The radio players also want restoration of government advertising on FM Radio and clearance of all pending dues as soon as possible.\n", "\n", "Among other demands are – full waiver of the minimum guarantee (2.5% of one time entry fee) till end of licence period, and two year extension in the licence period, which is 15 years, at present.\n", "\n"]], "tags": ["association of radio industries of india", "SOS", "Radio industry", "FM radio", "Broadcast Engineering"]},
{"heading": [["Industry body PHDCCI urges govt to use entire annual Ad budget to help media cos"]], "sub_heading": [["The request is part of PHD Chamber of Commerce & Industry’s research report presented to minister of information and broadcasting Prakash Javadekar. As per PHDCCI, the economic slowdown, made worse by the Covid-19 pandemic, is set to pull down the Indian media and entertainment (M&E) industry’s revenues by 16%, or Rs 25,000 crore this fiscal."]], "time": [["Last Updated: May 25, 2020, 07.06 AM IST"]], "publisher": [["ET Bureau"]], "article": [["Mumbai: Industry body PHDCCI has urged the government to use its entire annual budget for advertising to help media companies which are struggling to survive because of the disruption caused by the ", "coronavirus", " crisis.\n", "\n", "The request is part of PHD Chamber of Commerce & Industry’s research report, ‘Outlook of Media and Entertainment Industry in the COVID Scenario’, presented to minister of information and broadcasting ", "Prakash Javadekar", ".\n", "\n", "As per PHDCCI, the economic slowdown, made worse by the Covid-19 pandemic, is set to pull down the ", "Indian media", " and entertainment (M&E) industry’s revenues by 16%, or Rs 25,000 crore this fiscal. The report says that one of the major impacts of Covid-19 pandemic on the Rs 1.3 lakh crore sector has been the instability caused and a decline in advertising revenue across all media segments— radio, TV, print and outdoor.\n", "\n", "\n", "\n", "“We urge the government to make a conscious effort towards ensuring full utilisation of its advertising budget in the financial year,” said Mukesh Gupta, chairman, media & entertainment committee, PHDCCI. He said the move, apart from supporting the industry, will also help the government receive its due credit by “effectively publicising” numerous reforms and initiatives undertaken towards nation building.\n", "\n", "“We request the government to direct all other ministries, DAVP (now Bureau of Outreach and Communication), state governments, PSUs, etc. to clear all outstanding payments of the entire media industry, which is a significantly large amount,” said DK Aggarwal, president, PHDCCI.\n", "\n", "ET had earlier reported that BOC owes Rs 1,500-1,800 crore to the media industry for campaigns and publicity already carried out over the last several years. The print industry is waiting for the government to clear dues of Rs 800 crore.\n", "\n", "The chamber has also suggested that PSUs, corporates and industry stakeholders should make an effort to connect with their consumers using effective advertising campaigns. As per the industry body, the government’s move can provide much-needed relief to the M&E sector which is grappling with cash crunch and job cuts.\n", "\n", "Aggarwal said that as a goodwill gesture, the government must pay salaries for lockdown period for employees who are registered with the ", "Employees' State Insurance", " Corporation. Other suggestions for industry revival include a special package for outdoor media, reducing GST rates for electronic and outdoor media to 5%, and an efficient government hand-holding for the print sector.\n", "\n", "\n"]], "tags": ["indian media", "Prakash Javadekar", "coronavirus", "Indian media industry", "Employees' State Insurance"]},
{"heading": [["Media one of the most adversely affected sectors due to COVID-19: PHDCCI report"]], "sub_heading": [["Media has been one of the most adversely affected sectors due to the COVID-19 pandemic with a significant decline in advertisement revenues, a research report of the PHD Chamber of Commerce and Industry said on Saturday."]], "time": [["Last Updated: May 23, 2020, 10.52 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Media has been one of the most adversely affected sectors due to the COVID-19 pandemic with a significant decline in ", "advertisement revenues", ", a research report of ", "the PHD Chamber of Commerce and Industry", " said on Saturday.\n", "\n", "The report was submitted to Information and Broadcasting Minister ", "Prakash Javadekar", ", by Dr D K Aggarwal, President, Sanjay Aggarwal, Senior Vice President, Mukesh Gupta, Chairman - Media and Entertainment Committee, PHDCCI.\n", "\n", "Media has been one of the most badly affected sectors due to the COVID-19 pandemic, the report said.\n", "\n", "\"The ", "print", " media has lost significantly in circulation and also suffered huge advertisement revenue loss.\n", "\n", "\"Electronic media also lost heavily in advertisement revenues, the outdoor media got all orders cancelled owing to no traffic on roads due to lockdown and the ", "events business", " drew a blank as there were no events allowed in this period,\" the PHD Chamber of Commerce and Industry said in the report titled \"Outlook of Media and Entertainment Industry in the COVID Scenario\".\n", "\n", "The COVID-19 pandemic has caused mass disruptions to the nation's economy, its trade, industry and the lives of citizens, the PHD Chamber of Commerce and Industry said.\n", "\n", "There is no industry or sector of the economy that has been left unaffected by this wave, it said.\n", "\n", "PHD Chamber of Commerce and Industry appreciates the government for undertaking continuous reform measures to support industry, trade and economy to break free from the grip of COVID-19 crises, said Dr D K Aggarwal, President PHDCCI.\n", "\n", "COVID-19 has created opportunities and the Chamber urges the minister to undertake immediate reform measures based on the stated recommendations, the PHDCCI statement said.\n", "\n", "The report suggests that one of the major impacts of COVID-19 on the media and entertainment industry is the instability caused and the downfall in the advertising revenues across all media segments, it said.\n", "\n", "Radio, ", "television", ", print, outdoor (OOH) out-of-home media have seen a significant decline in the advertising revenue, said Aggarwal.\n", "\n", "This falling advertising revenue trends are expected to pose a significant threat to the industry as advertising is a prime source of revenue for the media, the PHDCCI said.\n", "\n", "\"We urge the government to make a conscious effort towards ensuring full utilisation of its annual advertising budget in the respective financial year. This deliberate move will help the government receive its due credit by effectively publicising the numerous effective and efficient reforms and initiatives undertaken by the government towards nation-building and at the same time will also ensure that the media sail through these tough times with inflows of revenue,\" said Gupta.\n", "\n", "PSUs, corporates and industry stakeholders should also make a conscious connect with their consumers by reaching out to them through effective advertising campaigns.\n", "\n", "\"We urge the government to direct all other ministries, DAVP, state governments, PSUs to clear all outstanding payments of the entire media industry, which is a significantly large amount,\" Aggarwal said.\n", "\n", "This move will provide the much-needed relief to the industry, which has played a pivotal role in creating jobs and spreading awareness during the crisis of COVID-19, and yet has been grappling with cash crunch and are unable to pay the salaries to their employees, who have been the frontline warriors, he said.\n", "\n", "As a goodwill gesture and keeping the importance of the media industry's role in these critical times, the development of economy as well as socio-political fields, the government must pay salaries for the lockdown period for those employees of media who are registered with the Employees' State Insurance Corporation, Aggarwal said.\n", "\n", "\"While the media and entertainment sector is currently grappling with various challenging issues, with the economic activities returning to normalcy, we are assured that eventually with the allowance of 100 per cent FDI in the media and entertainment industry and effective hand holding by the government, the industry will bounce back and continue to provide to each citizen the much-needed information and entertainment,\" he said. \n", "\n"]], "tags": ["the phd chamber of commerce and industry", "print", "events business", "Television", "Prakash Javadekar", "Advertisement revenues", "Radio"]},
{"heading": [["Covid impact: BookMyShow trims business, 270 hit by layoffs & furloughs"]], "sub_heading": [["The company has been forced to downsize due to the “unfavourable environment,” said Ashish Hemrajani, chief executive of BookMyShow, in an email to employees that was also posted on its website."]], "time": [["Last Updated: May 29, 2020, 10.22 AM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW DELHI: ", "Online ticket", " booking company ", "BookMyShow", " has laid off or furloughed 270 employees, making it the latest entrant in a list of well-funded ", "consumer internet companies", " to have fired workers in the wake of the economic crisis due to the Covid-19 pandemic. \n", "\n", "The company has been forced to downsize due to the “unfavourable environment,” said Ashish Hemrajani, chief executive of BookMyShow, in an email to employees that was also posted on its website.\n", "\n", "“Today, we are at the stage where I have to share with you, the uncomfortable, unfortunate yet inevitable downsizing exercise that we have to take due to the unfavourable environment…,” Hemrajani said in the email. \n", "\n", "Out of 1,450 employees at BookMyShow in India and globally, about 270 employees across various functions and teams will be impacted through this exercise, he added. “This includes those who will be put on furloughs, along with those who we will have to part ways with, at least, as of now,” he said.\n", " \n", "The company, which was valued at about $800 million during its last funding round in 2018 and which counts the likes of SAIF Partners, TPG Growth and Accel Partners as investors, did not provide a breakup of the number of employees who had been fired, and those put on furlough. \n", "\n", "BookMyShow joins the likes of home-grown ride-hailing major Ola, hospitality chain Oyo Hotels & Homes, food delivery majors Zomato and Swiggy, and B2B ecommerce company Udaan – among the most high-profile consumer internet companies to have raised millions of dollars in funding – to slash employee numbers. \n", "\n", "Hemrajani said employees that have been laid off will be provided severance pay of two months’ salary irrespective of their tenure or as per notice period, whichever is higher. They will also receive medical insurance cover, along with their nominated family members, until September 30. Those furloughed will continue to remain employed with BookMyShow and will be eligible for all medical insurance, gratuity and other benefits as per their employment standards, he said. \n", "\n", "“The company has cut all other expenses and renegotiated with vendors, partners and landlords and after exhausting all other cost-saving measures, we have taken this decision as a last resort,” Hemrajani said in the email.\n", "\n"]], "tags": ["BookMyShow Layoffs", "Consumer internet companies", "online ticket", "BookMyShow", "covid impact", "BookMyShow trims business", "BookMyShow business", "layoffs & furloughs"]},
{"heading": [["Relief package has overlooked entertainment industry: Film bodies write to FM"]], "sub_heading": [["Experts have estimated Indian film industry will lose an estimated Rs 2,500 crore, with theatres expected to reopen only by August. "]], "time": [["Last Updated: May 25, 2020, 09.38 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: With COVID-19 cases spiking everyday in Mumbai and film shooting unlikely to resume soon, film bodies have written to the centre, asking for its intervention in helping the industry tide through the crisis. The federation of Western India Cine Employees that represents associations covering 32 different crafts of the workers and technicians of the media and entertainment industry, wrote to ", "Finance", " minister ", "Nirmala Sitharaman", " on Saturday, \"The media and entertainment industry is among the highest revenue generating industries and plays an important role in the Indian economy. It is very sad that the industry has been overlooked by the government. We have sent numerous correspondences to the PM and I&B ministry for providing aid to hundreds of workers and technicians associated with the industry who are categorised as daily wage earners, but have not received any help from the government.\"\n", "\n", "BN Tiwari, President of Federation of Western Indian Cine Employees told ET that as film, TV and web show shoots are not likely start till the end of June or first week of July, and daily wage earners – spot boys, stuntmen, makeup artists, light men and more who have been out of work since lockdown are the worst hit.\n", "\n", "Producer bodies such as Producers' Guild of India, actors such as Amitabh Bachchan and Salman Khan, and production houses such as Yashraj Films have donated towards ", "COVID Relief fund", " to provide monetary aid to 35,000 film crew members members and a month’s ration essentials. \"However, the industry is vast and the daily wage workers count is huge. Many are yet to get any relief,\" the letter pointed out.\n", "\n", "Tiwari added that while discussions to resume work has been going on with government officials, it is not likely that shooting will begin soon. \n", "\n", "\"The idea that shooting can be done in green zones will never work, as people in those areas will never allow that. More than 150 serials and 100 web series are being made. Taking everyone to green zones is not feasible...The condition in Mumbai is getting worse. We have a huge section that depends on daily wages, and many of them have physical disability,\" Tiwari said.\n", "\n", "\"If permissions are given to carry out such post-production activities of these projects, which can be done in closed studios with minimum workforce, it would be a great relief to the producers who have invested a lot. Post-production work includes activities such as editing, dubbing, sound recording, music recording, special/visual effects, can begin,\" he added.\n", "\n", "I&B ministry started talks with film bodies recently, and is exploring options of having a common SOP for shooting across States. \n", "\n", "A delegation of film makers had also met Maharashtra CM ", "Uddhav Thackeray", " recently over the concerns.\n", "\n", "Tamil Nadu, Telangana and Karnataka have started \"limited shooting activities\" since last week, under strict guidelines, which include \"no shooting of wedding scenes, designated seating areas with 6-ft distance between them, compulsory use of three-layered medical masks by all professionals.\" \n", "\n", "Contactless temperature checks of the unit every morning, presence of doctor and nurse on set for three months since resumption of shoots are among the other guidelines being followed.\n", "\n", "Experts have estimated Indian film industry will lose an estimated Rs 2,500 crore, with theatres expected to reopen only by August. \n", "\n"]], "tags": ["Yash Raj Films", "Uddhav Thackeray", "I&B", "Nirmala Sitharaman", "Covid relief fund", "finance"]},
{"heading": [["Radio Mirchi is the best Lockdown Entertainment Partner with 40 Million listeners, states IRS survey"]], "sub_heading": [[]], "time": [["Last Updated: May 21, 2020, 02.35 PM IST"]], "publisher": [["Mediawire"]], "article": [["  ", "  ", "  ", "  ", "  ", "  ", "  ", " ", " "]], "tags": []},
{"heading": [["DD to shift out of DD kendra for two days after death of a staff member"]], "sub_heading": [["Among the last assignments he had covered, included recording bytes of railway board chairman and civil aviation officials last week."]], "time": [["Last Updated: May 28, 2020, 11.13 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The country's ", "national broadcaster Doordarshan", " will transmit its news bulletins and ground report shows from its central production centre for two days, instead of its regular studios in Doordarshan Kendra in Mandi house. The decision was made after a lighting assistant working with DD news passed away on Wednesday. His report today showed he was COVID-19 positive.\n", "\n", "According to those in know of the matter, a 53-year-old employee of DD news who was working as a video journalist\n", "passed away on Wednesday, minutes after he complained of breathing difficulties, and was taken to a private hospital in Shalimar Bagh. His samples were sent to a lab and the results said he was COVID-19 positive. The employee, according to his colleagues, was regularly attending press conferences called by the government and was on field most days till May 21. \n", "\n", "Among the last assignments he had covered, included recording bytes of railway board chairman and civil aviation officials last week.\n", "\n", "The shifting of the transmission was being done to disinfect the studios of the news broadcaster, and also sanitise all the equipment being used, an official said.\n", "\n", "An internal email said, \"it has been decided to shift the transmission of DD News for two days from 6 am on May 29. The TV broadcasting schedule involves an Hindi and English live bulletin every two hours. Scroll and flashes s for DD News and ", "DD India", " will be telecast from CPC. ", "DDG Engineering", " may do the needful for the transmission arrangements from 6 am onwards from ", "CPC", " Khelgaon.\" \n", "\n", "All section heads may direct all shift staff to report for duty at CPC. Officials said the move is just a precautionary protocol to sanitize the studios - DD has around seven, spread across the Kendra and CPC.\n", "\n", "A staffer in DD said off late more reporters and camera persons associated with Doordarshan were on the field, covering COVID-19 related stories. \"We all have Arogya Setu and it has been showing a lot orange in the last few days. All asymptomatic people concerned with news gathering are coming to office. A lot of us have been unknowingly coming in contact with COVID-19 patients.\"\n", "\n", "Anguished colleagues of the deceased lighting assistant said it was important the national broadcaster came up with an insurance plan for both its contractual and payroll employees. \"A year ago, a colleague died in a maoist blast. We work under risky situations. There should at least be some assurance of a proper compensation,\" a reporter with ", "Prasar Bharati", " said.\n", "\n", "The email also asked the camera section may depute camerapersons to be deployed in studio of CPC in this both shifts, and ensure availability of paper for printing of bulletins. \"DDG Engineering may kindly note that the YouTube streams of DD news, DD India, PMO youtube and Namo YouTube from the existing Newsroom,\" it said.\n", "\n"]], "tags": ["Prasar Bharati", "national broadcaster doordarshan", "ddg engineering", "CPC", "DD India"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["IBM", "ET Catalyse", "et catalyse virtual 04", "lockdown", "coronavirus", "digital world", "Deepali Naair"]},
{"heading": [["Indian millennials more anxious about health, finances than global counterparts"]], "sub_heading": [["A comparative analysis of impact of Covid-19 on consumer sentiments in 15 countries reveals that Indians are more concerned about their physical well-being, health of their family members, making upcoming payments and as a result are delaying large purchases."]], "time": [["Last Updated: Jun 01, 2020, 07.41 AM IST"]], "publisher": [[", "]], "article": [["NEW DELHI: Millennial Indians are “more anxious” about their health and “financially insecure” than their counterparts in 14 countries over the impact of Covid-19, as per a joint report by TV viewership monitoring agency Broadcast Audience Research Council (BARC) India and Nielsen, a consumer analytics firm.\n", "\n", "In its ninth edition of “Crisis consumption on TV, smartphones and audiences”, the report says that a comparative analysis of impact of Covid-19 on consumer sentiments in 15 countries reveals that Indians are more concerned about their physical well-being, health of their family members, making upcoming payments and as a result are delaying large purchases.\n", "\n", "Documenting the impact of easing of lockdown globally, the report says that lifting of lockdown has shown a decline in TV viewership in UK, India, Australia and France. In India, the total TV viewership is 15 % higher than the Pre-Covid period. The viewership has gradually declined since its peak in week 13 (starting March 28)”, reads the report. While in UK, TV viewing has gradually declined, the TV viewership in France and Australia has “flattened”, reads the report.\n", "\n", "Covering the global landscape of viewers, the report says that more than 50% Americans continue to be optimistic about lives post Covid-19. Around 70 percent teens and 56 % of the 55 year old plus believe that things will return to normalcy in US within six months.\n", "\n", "Stating that advertising has revived in India, the report says that overall advertising volume on TV has grown in the last two weeks by 16%. However, it is 23 % lower than pre-Covid time period (January)\n", "\n", "It adds that there is a three percent increase and five percent increase in brands/variants in week 20. Also, new brands have increased by 14% in week 20 compared to previous weeks. These include Vivo V19, Apple iPhoneSe and ", "Cadbury", "’s 5 star. The report also says that online shopping has revived.\n", "\n", "Elaborating on advertising patterns, the report says that most categories have increased volume of advertising levels in the last two weeks, especially soft drinks and air coolers.\n", "\n", "While top advertisers have remained consistent, 40 more advertisers have increased their spends in week 20 (May 16-22). These 40 advertisers include: ", "Reliance Industries Limited", ", Airtel, Dabur, Amazon, Netflix, Byju’s, ", "Dell", ", Pepsico, Hamdard etc.\n", "\n", "Chronicling the consumer behaviour in India (May 16-22), the report says that while the average time spent in watching TV is over four hours (7 % higher than pre-Covid), the total number of channels being watched is decreasing, thanks to gradual easing of lockdown. West Bengal and Andhra Pradesh/Telangana are the only states which have witnessed a decline in TV viewership as opposed to TV consumption during pre-Covid (January 11 to 31). All other states have shown higher TV consumption.\n", "\n", "Non-primetime viewership continues to operate higher than pre-Covid at 47 percent in week 20 (week starting May 16) while primetime viewership is 13 % lower, courtesy no original programming by channels.\n", "\n", "News and movies after peaking to 21 % and 29 % shares have stabilised while the TV viewership by children has grown to nine percent in week 20.\n", "\n", "Shri Krishna, by DD National, is the most watched show during primetime (in week 20) in North India.\n", "\n", "Analysing the increased consumption of movies and originals, the report says that Tiger Shroff starrer “Baaghi 3” topped the movies section in “unique audiences” followed by Taapsee Pannu’s “Thappad”\n", "\n", "In the list of original series, “Mastram” produced by Prabhleen Kaur Sandhu of Almighty Motion Picture has topped the list “in unique audience” followed by the critically acclaimed “Paatal Lok”.\n", "\n", "Viewing minutes of all languages in general entertainment have grown except for Marathi, Gujarati and Bengali while viewing minutes of Assamese and Punjabi have grown both non-primetime and primetime.\n", "\n", "Except for Urdu, viewership of news has grown across on languages in both primetime and non-primetime. Among English sub-genres, news and movies have shown the highest growth in terms of viewership.\n", "\n", "Also, duration and viewership of mythology programming has increased across hindi and regional languages. On use of smartphones, the report says that Indians continue to use their smartphones more for social networking, education, video conferencing and gaming than they were during initial weeks of lockdown.\n", "\n", "News consumption on smartphones has remained stable over the past few weeks. After seeing huge peaks in various weeks, there is gradual drop seen in TV viewership and smartphone consumption last week, says the report.\n", "\n"]], "tags": ["Apple Inc.", "Reliance Industries Limited", "amazon video", "cadbury", "Dell"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["Angel Broking", "ET Catalyse", "Abhishek Gupta", "coronavirus", "et catalyse virtual 03", "Shefali Khalsa", "Prabhakar Tiwari", "Edelweiss Tokio", "SBI General Insurance"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []}
]