[
{"heading": [["ICICI Bank cuts interest rate on saving deposits by 25 bps"]], "sub_heading": [["The private sector lender has cut interest rate on all deposits of less than Rs 50 lakh to 3 per cent, a reduction of by 25 bps as against the existing 3.25 per cent. "]], "time": [["Last Updated: Jun 02, 2020, 08.58 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "ICICI Bank", " on Tuesday said it has cut ", "interest rate", " on saving deposits by 25 basis points (bps). The new rates will come into effect from Thursday, it said in a regulatory filing. \n", "\n", " The ", "private sector lender", " has cut interest rate on all deposits of less than Rs 50 lakh to 3 per cent, a reduction of by 25 bps as against the existing 3.25 per cent. \n", "\n", " Likewise, for deposits of Rs 50 lakh and above, the account holders will earn interest of 3.50 per cent, down from 3.75 per cent currently. \n", "\n", " Currently, banks have ample ", "liquidity", ", and a comparatively less demand for loans due to the lockdown has created a asset-liability mismatch, which has put pressure on interest outgo against customers' deposits. \n", "\n", " Earlier in May, the country's largest lender SBI had cut the interest rates on fresh retail term deposits and on renewal of maturing deposits by up to 40 bps across tenors. \n", "\n", " ", "SBI Chairman Rajnish Kumar", " has already said that in the current scenario, interest rates are going to reduce. \n", "\n", " \"The reduction in interest rates will be for both borrowers and depositors,\" Kumar said recently.\n"]], "tags": ["interest rate", "private sector lender", "SBI Chairman Rajnish Kumar", "Liquidity", "ICICI bank"]},
{"heading": [["Forced lending to cripple banks; NPAs to soar by up to 600 bps in 2 yrs: Fitch"]], "sub_heading": [["The impact of forced lending on banks' impaired-loan ratios can be between 200 and 600 bps, Fitch said."]], "time": [["Last Updated: May 28, 2020, 10.29 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: With incremental bank ", "lending", " making up the bulk of the government's nearly Rs 21 lakh crore stimulus package, lenders face significant ", "asset quality", " challenges which can increase their dud loan ratios by up to 6 percentage points over the next two years, warns a report.\n", "\n", "The impact of forced lending on banks' impaired-loan ratios can be anywhere between 200 and 600 basis points (bps), depending on the severity of stress and banks' individual risk exposures and the higher regulatory provisions, ", "Fitch", " Ratings said in the report on Thursday.\n", "\n", "The agency, however, did not offer a break-up of the NPAs between the state-run and private sector banks.\n", "\n", "The stimulus measures include extension of the 90-day moratorium on recognition of impaired ", "loans", " to 180 days, in addition to several relaxations in bank lending limits, including allowing banks to fund interest on working capital loans.\n", "\n", "\"These measures will put a heavy onus particularly on state-run banks which already have very weak balance sheets to bail out the affected sectors, due to their quasi-policy role, considering that much of the so-called stimulus measures is in the form of new loans,\" the report said.\n", "\n", "The nationwide lockdown from March 25 to contain the spread of the COVID-19 pandemic, which has killed nearly 4,800 and infected 1.58 lakh in the country so far, has taken a severe toll on businesses, supply chains and individual incomes.\n", "\n", "\"We assume that both consumer demand and manufacturing are likely to remain tepid until the rising cases of new coronavirus patients are brought under control.\n", "\n", "\"The stress is occurring across sectors, but MSMEs and retail are likely to emerge as higher risks due to both stressed industrial activity and rising unemployment,\" it added.\n", "\n", "On the likely ", "NPA", " pains, the report said \"impaired-loans recognition will now take longer, and the more relaxed and forced lending norms means rising balance-sheet risks, despite their heightened risk aversion and the state-run banks are more at risks due to their already weak earnings and limited capital buffers.\"\n", "\n", "State-run banks account for a bulk of the NPAs, with some of them like IDBI Bank reporting more than a third of total loans as ", "non-performing assets", ". Being system leaders, they also have a much higher percentage of loans under moratorium than private sector peers.\n", "\n", "\"There is also a risk that banks may now extend credit to even structurally weak borrowers with dimmer recovery prospects, due to a one-year moratorium on registering fresh insolvencies amid weaker future incomes,\" Fitch said.\n", "\n", "Delays in resolution will potentially exacerbate future losses once risks manifest over FY21 and FY22, it added.\n", "\n", "\"We believe that capital support is critical for state-run banks given their heightened risks to solvency from future losses, and their inability to raise fresh equity on their own due to their sharply discounted equity valuations. Several of them also have the added challenge of executing mergers and integrating other weaker banks,\" the report said.\n", "\n"]], "tags": ["lending", "loans", "Fitch", "NPA", "asset quality"]},
{"heading": [["Digital payment volumes on NPCI channels rebound in May"]], "sub_heading": [["Transaction volumes recorded on channels such as Unified Payments Interface (UPI), Immediate Payment System (IMPS), Bharat Bill Payment System and National Electronic Toll Collection (NETC) inched towards pre-covid levels signifying a slow revival in commercial activities and early signs of consumer appetite to spend."]], "time": [["Last Updated: Jun 01, 2020, 05.03 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Digital payments volumes recorded on major National Payments Corporation of India operated channels rebounded in May after the volumes had plummeted in April when the nationwide lockdown to control the spread of the ", "coronavirus", " pandemic had caused the economy to come at a near standstill.\n", "\n", "Transaction volumes recorded on channels such as Unified Payments Interface (", "UPI", "), Immediate Payment System (", "IMPS", "), Bharat Bill Payment System and National Electronic Toll Collection (", "NETC", ") inched towards pre-covid levels signifying a slow revival in commercial activities and early signs of consumer appetite to spend.\n", "\n", "Experts suggest that the revival of volumes could be on the back of graded reopening of commerce, including e-commerce services, and improved adoption of digital payments by consumers.\n", "\n", "Data released by ", "NPCI", " on its social media handles showed a total of 123 crore transactions worth Rs.2.18 lakh crore processed on UPI in May; up 24% in volumes and 45% in value from the transactions processed in April. In March, a total of 125 crore transactions worth Rs.2.06 lakh crore was recorded on the popular payment service.\n", "\n", "“The overall digital transactions in our country had also dropped during lockdown, primarily due to restrictions imposed on non-essential sectors and people having to stay indoors and not having enough spending power,” said Harshil Mathur, CEO Razorpay. “But now, with the situation starting to slightly ease out in parts of the country, we are seeing a spike in transactions in the last few days, particularly in e-commerce.”\n", "\n", "Similarly, IMPS also recorded a rebound in transaction volumes and value. A total of 16.6 crore transactions worth Rs.1.69 lakh crore was processed in May on the channel used for bank to bank transfer of bigger ticket size funds. This is about 36% growth in both volume and value of transactions recorded on the channel from April.\n", "\n", "Interestingly the channel that recorded sharpest revival in volumes was NETC-powered Fastag. With graded opening of highways, the contactless toll payment service recorded five-fold monthly jump in volume and value recording 5.5 crore transactions worth Rs.1142 crore in May. Transactions had plummeted nearly eight times in April as against March.\n", "\n", "Online bill payment system BBPS too recorded a healthy revival in numbers. Users paid a total of 1.6 crore bills worth Rs.2178 crore through the service in May, up 30% in volume and 60% increase in value of transactions from April.\n", "\n"]], "tags": ["upi", "covid", "NETC", "Google Pay", "imps", "Digital Payment", "coronavirus", "paytm", "NPCI"]},
{"heading": [["RBI slaps Rs 4 crore penalty on Citibank NA and Rs 1.45 crore on three other banks for flouting rules"]], "sub_heading": [["The regulator said the penalty on Citibank was for not adhering to the directions related to customer credentials."]], "time": [["Last Updated: May 29, 2020, 08.56 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA: The ", "Reserve Bank of India", " has slapped Rs 4 crore penalty on Citibank NA and Rs 1.45 crore on three urban cooperative banks for flouting ", "banking rules", ".\n", "\n", "The regulator said the penalty on Citibank was for not adhering to the directions related to customer credentials. It said that the lender overlooked its directions on obtaining declaration from customers about credit facilities enjoyed with other banks, granting non-fund based facilities to non-constituent borrowers, verifying data available in ", "CRILC", " database and obtaining ", "No-Objection Certificate", " (NOC) from lending banks at the time of opening current accounts, and submission of compliance to risk assessment findings.\n", "\n", "“This action is based on deficiencies in regulatory compliance and is not intended to pronounce upon the validity of any transaction or agreement entered into by the bank with its customers, “ RBI said Friday.\n", "\n", "Earlier, the regulator had sent a notice to the bank asking to show cause as to why penalty should not be imposed for failure to comply with the directions issued by RBI. “After considering the bank’s reply to the notice, oral submissions made during the personal hearing and examination of additional submissions, RBI concluded that the aforesaid charges of contravention with the provisions of the Act and non-compliance with RBI directions warranted imposition of monetary penalty,” it said.\n", "\n", "In parallel, RBI has levied Rs 60 lakh on Bharat Co-operative Bank (Mumbai), Rs 45 lakh on Thane’s TJSB Sahakari Bank and Rs Rs 40 lakh on Ahmedabad’s ", "Nagar Urban Co-operative Bank", " for flouting the asset classifications rules.\n", "\n", "On Thursday, Bank of India and two other lenders were penalised for rule violation.\n", "\n"]], "tags": ["banking rules", "reserve bank of india", "CRILC"]},
{"heading": [["BBB recommends Ashwini Bhatia for post of SBI MD"]], "sub_heading": [["The Banks Board Bureau has also recommended names of M V Rao and P P Sengupta for the post of managing director of Central Bank of India and Indian Overseas Bank, respectively.  While Rao will replace Central Bank of India MD Pallav Mohapatra who will retire in February next year. "]], "time": [["Last Updated: May 31, 2020, 01.41 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The ", "Banks Board Bureau", " (", "BBB", ") on Saturday recommended names of ", "Ashwini Bhatia", ", ", "M V Rao", " and ", "P P Sengupta", " for the post of managing director of three state-owned lenders -- ", "State Bank of India", ", Central Bank of India and Indian Overseas Bank, respectively. Bhatia is currently serving as deputy managing director (DMD) at ", "SBI", ", while Rao is executive director with ", "Canara Bank", ". \n", "\n", "The bureau members interfaced with 20 candidates from nationalised banks on May 30 for the position of managing director in State Bank of India and the position of MD and CEO of Indian Overseas Bank and Central Bank of India, an official statement said. \n", "\n", "Bhatia will be appointed in place of P K Gupta who superannuated on March 31, while Rao will replace Central Bank of India MD Pallav Mohapatra who will retire in February next year. \n", "\n", "Sengupta, currently DMD SBI, will replace Indian Overseas Bank MD and CEO Karnam Sekar, who retires on June 30. \n", "\n", "With this exercise, the government has completed the process of appointment of head of PSU banks for the current fiscal. \n", "\n", "The decision on the appointment will be taken by the Appointments Committee of the Cabinet headed by Prime Minister Narendra Modi. \n", "\n", "BBB, the headhunter for state-owned banks and financial institutions, is headed by former Department of Personnel and Training Secretary B P Sharma. \n", "\n", "The Prime Minister, in 2016, approved the constitution of BBB as a body of eminent professionals and officials to make recommendations for appointment of whole-time directors as well as non-executive chairpersons of public sector banks (PSBs). \n", "\n", "It was also entrusted with the task of engaging with the board of directors of all PSBs to formulate appropriate strategies for their growth and development. \n", "\n", "Besides, it was asked to frame strategy discussion on consolidation based on requirement. The government wanted to encourage bank boards to restructure their business strategy and also suggest ways for their consolidation and merger with other banks.\n"]], "tags": ["Canara Bank", "State Bank of India", "p p sengupta", "M V Rao", "BBB", "Ashwini Bhatia", "SBI", "banks board bureau"]},
{"heading": [["PNB cuts repo-linked lending rate by 40 bps to 6.65%"]], "sub_heading": [["For senior citizen, it is offering a higher interest rate of 75 bps over applicable card rate for all maturities on domestic deposits up to Rs 2 crore. "]], "time": [["Last Updated: Jun 01, 2020, 08.39 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: ", "Punjab National Bank", " (PNB), the country's second-largest state-owned lender, on Monday said it has reduced its repo-linked lending rate (RLLR) by 40 basis points (bps) to 6.65 per cent from 7.05 per cent. The bank's marginal cost of funds-based lending rate (", "MCLR", ") has also been revised downwards by 15 bps across all tenors. \n", "\n", " The lender has cut its saving fund deposit rate by 50 bps with a maximum of 3.25 per cent, effective July 1, a release said. \n", "\n", " It has further reduced its term deposit rates in various maturities bucket with a maximum rate of 5.50 per cent for deposits of specified maturities, effective Monday. \n", "\n", " For senior citizen, it is offering a higher interest rate of 75 bps over applicable card rate for all maturities on domestic deposits up to Rs 2 crore. \n", "\n", " Last week, Bank of India (", "BOI", ") and ", "UCO Bank", " had cut their external benchmark lending rate (EBLR), which is linked to the ", "repo rate", " by 40 bps. \n", "\n", " While BOI has revised its EBLR to 6.85 per cent, UCO Bank slashed its repo-based lending rate to 6.90 per cent. \n", "\n", " The reduction in RLLR by lenders follows the Reserve Bank of India's recent move to cut repo rate by 40 bps to 4 per cent from 4.40 per cent.\n"]], "tags": ["Repo rate", "Uco Bank", "Punjab National Bank", "boi", "mclr"]},
{"heading": [["IBC deferral plan and absence of loan rejig put banks in a fix"]], "sub_heading": [["Unlike the meltdown of 2008-09, Covid-19 has impacted a far higher number of industries."]], "time": [["Last Updated: May 29, 2020, 08.38 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Banks are in a quandary over the resolution of stress among ", "corporate borrowers", " as they find themselves caught between the government’s proposal to suspend the ", "bankruptcy", " code for a year and the Reserve Bank of India’s reluctance to allow a one-time ", "loan restructuring", " in the absence of adequate information and data. \n", "\n", "Legal experts and some of the resolution professionals are learnt to have sent feelers to senior government officials that deferring the admission of cases under the ", "Insolvency", " and Bankruptcy Code (", "IBC", ") would not only prevent orderly resolution in the banking system, but could also be viewed as a retrograde step, two senior bankers told ET.\n", "\n", "According to banking circles, neither the government nor the regulator may approve a loan restructuring scheme without enough checks and balances — particularly, after the experience of loan rejigs carried out between 2009 and 2013 when many undeserving corporates took advantage of the offer. \n", "\n", "Bank CEOs in their meetings with ", "RBI", " have proposed a midway path, where they will make balance-sheet provisioning for the unsustainable portion of the debt without tagging the account as a non-performing asset (NPA). This, they believe, would minimise misuse of the facility.\n", "\n", " \n", "\n", "“In fact the need for a loan restructuring will be particularly felt if IBC, which is the only sensible resolution option, is deferred. But the government is yet to change the law. On the other hand, RBI, which views one-time restructuring as a serious regulatory measure, is likely to wait for a clearer picture to emerge. A loan restructuring would enable a bank to disburse fresh loans and changing the entire outstanding to match the borrower’s cash-flow in the post-pandemic business environment,” said an industry source. At present, any change in the key terms of a loan — rate of interest, tenor, and principal — amounts to ‘restructuring’ that requires categorising the account as an NPA and providing for the entire amount. \n", "\n", "“Banks are proposing a partial provisioning — of only the unsustainable debt which cannot be serviced given the borrower’s reduced earnings. This would protect the bank’s books while the borrower preserves its credit score and reputation by staying out of the NPA list. Also, it may call for some tweaking of the earlier regulatory guidelines as any such restructuring would have to be done with the same promoter,” said a banker. (The unsustainable debt can be partly converted into equity and balance replaced with long-dated bonds with a lower coupon rate. The difference between the unsustainable debt and the net present value of the new instruments is roughly the haircut that lenders take in restructuring the loan.)\n", "\n", "Some of the IBC experts have suggested that the government should at least allow the corporate debtor to file for bankruptcy while others feel the IBC option should be kept open for financial creditors, operating creditors as well as the borrowing company. \n", "\n", "“The IBC suspension announcement also came as a surprise to many within RBI. Even if in case there is a rethink or delay by the government (in suspending the IBC), there is no reason to disallow a one-time loan restructuring,” said a banking source.\n", "\n", "A restructuring scheme for MSMEs is in place for this year. Under the circumstances, the government and the regulator may take a while before allowing banks to take a haircut for bigger corporates. However, unlike the meltdown of 2008-09, Covid-19 has impacted a far higher number of industries.\n", "\n"]], "tags": ["corporate borrowers", "insolvency", "loan restructuring", "RBI", "IBC", "Bankruptcy"]},
{"heading": [["SBI ready with micro market plan, soft launch on June 1"]], "sub_heading": [["State Bank of India (SBI) is all set to activate its micro market vertical from June to raise its stake with the bottom-of-the-pyramid borrowers, and it has asked SBI Life Insurance chief executive Sanjeev Nautiyal to head the initiative."]], "time": [["Last Updated: May 29, 2020, 12.25 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA: India’s biggest financier is stooping to conquer.\n", "\n", "State Bank of India", " (SBI) is all set to activate its micro market vertical from June to raise its stake with the bottom-of-the-pyramid borrowers, and it has asked ", "SBI Life Insurance", " chief executive Sanjeev Nautiyal to head the initiative.\n", "\n", "The country's largest lender is going ahead with its plan to launch the specialised cell for small borrowers despite rising odds against that line of lending in the aftermath of the Covid-19 outbreak. About 7,500 rural branches of SBI will be at the vanguard of this initiative.\n", "\n", "SBI chairman ", "Rajnish Kumar", " said that the bank would do a soft launch on June 1.\n", "\n", "The last-mile connect would be SBI's response even as opportunities in both wholesale and retail loan markets shrink, with the economy set to contract. SBI’s group chief economic advisor Soumya Kanti Ghosh predicted the economy to contract 6.8% in FY21.\n", "\n", "The state-owned lender has already formed a vertical -- Financial Inclusion & Micro Market (FIMM) -- to handle its ", "microfinance business", ". Deputy managing director KV Haridas, who has been in charge of FIMM until now, will be retiring on May 31.\n", "\n", "ET had first highlighted SBI’s micro market strategy on March 12.\n", "\n", "“The bank already enjoys over one-third of the market share in both the home loan and car loan segments. Now it has decided to concentrate on the micro market,” a senior SBI official said.\n", "\n", "While state-owned lenders have been in the business of lending to self-help groups for nearly three decades, SBI would be the first to foray into the collateral free micro loans to street vendors, zari workers and tailors, which was popularised by Muhammad Yunus of Bangladesh. About one-fourth of Indian ", "microfinance", " market of Rs 2.22 lakh crore is controlled by ", "Bandhan Bank", ".\n", "\n", "However, SBI is yet to put in place a collection mechanism, which is the key to success in microfinance. It plans to use its existing business correspondent partners to begin with.\n", "\n", "While economic activities remain subdued due to lockdown, banks are trying to up the ante to in the districts where the spread of the virus was negligible or could be restricted.\n", "\n", "Until the second week of May, 56% of the country’s districts were in green and orange zones. The balance 44% was classified as a red zone, which included areas that faced significant operational curbs.\n", "\n", "Rating firm ", "ICRA", " said that most of the bigger microfinance firms and small finance banks have more than half of their portfolio in the green and orange zones, where turnaround is expected to be faster and collections higher than in the red zone.\n", "\n"]], "tags": ["Rajnish Kumar", "microfinance", "Bandhan Bank", "SBI Life Insurance", "state bank of india", "icra", "microfinance business"]},
{"heading": [["Retail credit drops to record low during lockdown: SBI economists"]], "sub_heading": [["Retail credit declined by 2.5 per cent, the lowest level since 2008, from when the data series started, it said, expecting that the decline will continue as Maharashtra has extended the lockdown till June 30. "]], "time": [["Last Updated: Jun 01, 2020, 04.38 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: The COVID-19 ", "pandemic", " and the ", "lockdown", " have made Indian consumers risk-averse if one were to go by data showing a growth in deposits and ", "retail credit", " plummeting to its lowest level since 2008, economists at ", "SBI", " said. On the deposit growth front, it has been a mixed bag, but the extension of the lockdown for a fifth time will ensure that the savings continue to surge, the economists said in a note. \n", "\n", " Consumer confidence is a deeply-cherished aspect by policy makers because it is the primary driver of growth in the Indian economy for many years now. Even during the ", "COVID-19", " pandemic, there has been a lot of commentary about the need to revive confidence and consumer demand. \n", "\n", " Retail credit declined by 2.5 per cent, the lowest level since 2008, from when the data series started, it said, expecting that the decline will continue as Maharashtra has extended the lockdown till June 30. \n", "\n", " The increase in cash credit during the fourth lockdown is more than Rs 52,000 crore, the economists said, pointing out that this can be because of accrued interests in moratorium turning into loans. \n", "\n", " On the deposits front, there was a surge of Rs 4.83 lakh crore during the first lockdown and Rs 3.62 lakh crore in the second lockdown, which is indicative of \"significant risk aversion in consumer spending\", the note said. \n", "\n", " As the country went into a third lockdown, there may have been a feeling of the lockdowns continuing and the pent up demand for purchases ensured that there was a fall of Rs 1.02 lakh crore in the total deposit base, it said, adding that the same was more than covered up with a Rs 2.38 lakh crore surge during the fourth lockdown that ended on Sunday. \n", "\n", " \"With Indian going into Lockdown 5, we believe such consumer savings will continue to surge,\" the note said. The note also had the economists wondering if the Indian consumer is turning more \"frugal\" in the lockdowns. \n", "\n", " The note also warned that while the moratoriums provides some relief to banks from an asset quality perspective, a \"prolonged slump\" in the economy will make the lenders more vulnerable. \n", "\n", " The note also rued that unlike the experience with the global financial crisis after 2008, the government expenditure to fuel spending by the people is lesser during the current ones and directed more at indirect measures. \n", "\n", " The combined fiscal deficit of the Centre and states will come at 13 per cent of the GDP for FY2021, it said.\n"]], "tags": ["Retail Credit", "lockdown", "SBI", "pandemic"]},
{"heading": [["Banking sector needs recapitalisation of Rs 4 lakh crore: Uday Kotak"]], "sub_heading": [["The banking sector has loans of Rs 100 lakh crore and a capital of Rs 11 lakh crore to 12 lakh crore while the banking losses are about Rs 3 lakh crore to 4 lakh crore, said CII President-Designate Uday Kotak."]], "time": [["Last Updated: Jun 02, 2020, 07.08 PM IST"]], "publisher": [["ANI"]], "article": [["NEW DELHI: Industry leaders said on Tuesday that the banking and financial sectors need structural reforms to propel ", "economic growth", " as the country aspires to become self-reliant in the face of ", "coronavirus", " crisis and enters the 'Unlock Phase 1.'\n", "\n", "The banking sector has loans of Rs 100 lakh crore and a capital of Rs 11 lakh crore to 12 lakh crore while the banking losses are about Rs 3 lakh crore to 4 lakh crore, said CII President-Designate ", "Uday Kotak", ".\n", "\n", "\"Banks are in the business of banking but they are unable to lend. The banking sector needs ", "recapitalisation", " of Rs 3 lakh crore to 4 lakh crore,\" he said while addressing the 125th annual session of the Confederation of Indian Industry (CII).\n", "\n", "Kotak said the government, the industry in general and the financial sector are bearing the brunt of Covid-19 pandemic.\n", "\n", "State Bank of India (SBI) Chairman Rajnish Kumar said the country needs to invest heavily in agriculture and infrastructure sectors. \"Nearly 50 per cent of the population is dependent on agriculture but the investment is very minimal,\" he said.\n", "\n", "Chairman of Piramal Group Ajay Piramal said the financial sector has lost 40 per cent market capitalisation in the past one year. The government, banks and regulators need to work together to turnaround the situation.\n", "\n", "\"For Atma Nirbhar Bharat, we need to create demand and then look at the opportunities worldwide. But if we take one year for policy implementation, then achieving the goal will be difficult,\" he said.\n", "\n", "Chairperson of Biocon Ltd Kiran Mazumdar Shaw said India spends only one per cent of GDP on healthcare.\n", "\n", "\"If we increase the spending on healthcare, it may be the next IT sector of India. Healthcare has large employment opportunities and huge export opportunities as well. We need incentives like the IT sector was given in past.\"\n", "\n", "In his address during the morning, CII President Vikram Kirloskar said the prolonged ", "lockdown", " has dealt a huge blow to India's growth story. He was confident that the Indian industry will help the country overcome the crisis.\n", "\n"]], "tags": ["Uday Kotak", "covid", "recapitalisation", "Economic growth", "lockdown", "coronavirus", "Kotak Mahindra Bank"]},
{"heading": [["The poor bring more business to banks in April"]], "sub_heading": [["Loans to the economically weaker sections in April was nearly 40% higher than loans to big corporates, indicating low credit demand for investments while also pointing to the need for borrowings to keep the poor going at a time when economic activities came to a virtual standstill."]], "time": [["Last Updated: Jun 02, 2020, 07.22 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: Loans to the economically weaker sections in April was nearly 40% higher than loans to big corporates, indicating low credit demand for investments while also pointing to the need for borrowings to keep the poor going at a time when economic activities came to a virtual standstill. Even as overall bank credit contracted by Rs 1.1 lakh crore in April, many segments such as loans to weaker sections, large corporates, NBFCs and retail trade were in the positive territory.\n", "\n", "But significantly, loans to weaker sections under '", "priority sector", "' at Rs 12,381 crore were 40% higher than loans to large corporates at Rs 8,846 crore, according to the data released by ", "the Reserve Bank of India", " on sectoral deployment of bank credit. A bulk of the increase in such loans could be due to the relief package announced by the government in March.\n", "\n", "Among the various measures under the package, finance minister ", "Nirmala Sitharaman", " announced an increase in loans from Rs 10 lakh to Rs 20 lakh to 63 lakh self-help groups (SHGs) under ", "the National Livelihood Mission", ". Self-help groups qualify as a 'weaker section' according to the Reserve Bank of India definition. Besides, women beneficiaries up to Rs 1 lakh per borrower and overdraft of upto Rs 10,000 per account for PM Jan Dhan Yojana account holders and small and marginal farmers among others, also qualify as 'weaker sections'.\n", "\n", "There is a likely pick up in loan demand under these heads as a loss of livelihood due to the lockdown is likely to have pushed them to resort to borrowings. Even as economic activity had come to a standstill in April after a nationwide lockdown was announced, some industries like power and petroleum did borrow to meet working capital needs.\n", "\n"]], "tags": ["priority sector", "Pradhan Mantri Jan Dhan Yojana", "The Reserve Bank of India", "Nirmala Sitharaman", "the national livelihood mission"]},
{"heading": [["Economy needs support from PSBs: Union Bank chief"]], "sub_heading": [["The number of PSBs has come down after amalgamation of several lenders, and their ability to lend has increased manifold, Union Bank of India MD and CEO Rajkiran Rai G said."]], "time": [["Last Updated: May 29, 2020, 02.16 PM IST"]], "publisher": [["PTI"]], "article": [["KOLKATA: The country's economy, which has been hit by the ", "COVID-19 outbreak", ", needs support from the public sector banks (PSBs) to boost credit growth, an official said on Friday.\n", "\n", "The number of PSBs has come down after amalgamation of several lenders, and their ability to lend has increased manifold, Union Bank of India MD and CEO Rajkiran Rai G said.\n", "\n", "Recently, Oriental Bank of Commerce and United Bank of India were merged into Punjab National Bank, ", "Syndicate Bank", " into ", "Canara Bank", ", ", "Allahabad Bank", " into ", "Indian Bank", " and Andhra and Corporation banks into Union Bank of India.\n", "\n", "He said the lenders will be able to meet the expectations of the business community.\n", "\n", "Speaking at a webinar session organised by the BCCI, Rai said that there will be a shift of credit growth in favour of the PSBs, adding that depositors will expect an interest rate of 5.5 per cent.\n", "\n", "According to him, the issues of the depositors cannot be overlooked, and more stress will have to be given on the liability side to retain customers.\n", "\n", "Kotak Mahindra Bank whole-time director and president Gaurang Shah said the retail, a low-cost liability base, is key sustenance factor of the banks.\n", "\n", "Ajay Kanwal, MD and CEO of ", "Jana Small Finance Bank", " said around 65 per cent of micro-finance borrowers felt the COVID-19 impact to a large extent.\n", "\n", "He said customers at the bottom of the pyramid are most vulnerable and the right kind of support should be extended to them.\n", "\n"]], "tags": ["Canara Bank", "Indian Bank", "syndicate bank", "allahabad bank", "jana small finance bank"]},
{"heading": [["India lenders’ woes may be worse than thought, Moody’s says"]], "sub_heading": [["“A deeper and more prolonged credit crunch would constrain” gross domestic product growth further, and that “in turn would increase the pressure on financial institutions’ balance sheets,” according to the ratings company."]], "time": [["Last Updated: Jun 02, 2020, 05.32 PM IST"]], "publisher": [["Bloomberg"]], "article": [["\n", "Moody’s Investors Service said stress among ", "Indian lenders", " may be “deeper and broader” than it thought, adding more risks to the already battered economy.\n", "\n", "“A deeper and more prolonged credit crunch would constrain” gross domestic product growth further, and that “in turn would increase the pressure on ", "financial institutions", "’ balance sheets,” according to the ratings company. It made the comments in a statement Monday, when it cut India’s sovereign rating by one step to the lowest investment grade.\n", "\n", "The downgrade comes days after India’s central bank said it expects the economy will contract for the first time in more than four decades. India already has the world’s worst bad loan pile, and Moody’s said subdued economic growth is likely to further weaken asset quality and the health of banks and non-bank financial institutions.\n", "\n", "Moody’s downgraded the long-term ratings on ", "HDFC Bank Ltd.", " and State Bank of India, among others Tuesday, following the sovereign rating cut. The rater said that worsening liquidity woes at local shadow lenders will pose a risk to financial system stability.\n", "\n", "It doesn’t expect the credit crunch in the sector to be resolved quickly.\n", "\n", "Moody’s also kept its negative outlook on the country’s sovereign ratings, citing mutually-reinforcing risks from stresses in the economy and the financial system that could lead to a more severe and prolonged erosion in India’s fiscal strength. Its global peers -- S&P Global Ratings and ", "Fitch Ratings", " -- have a stable outlook on the nation’s sovereign debt grade.\n", "\n", "“The fact that Moody’s has maintained its negative outlook even after the downgrade does not bode very well,” said Teresa John, economist at ", "Nirmal Bang Equities Pvt", ". “While we don’t believe a downgrade below investment grade is imminent, a change in outlook by S&P and Fitch will increase the risk materially.”\n", "\n", "\n"]], "tags": ["moody s investors service", "Fitch Ratings", "financial institutions", "Indian lenders", "HDFC Bank Ltd.", "nirmal bang equities pvt"]},
{"heading": [["Extension of moratorium on loan repayment to affect liquidity conditions of NBFCs: Icra"]], "sub_heading": [["Most NBFCs carried adequate on-balance sheet liquidity as of March 2020, which, along with access to funding lines, would be sufficient to meet their three-month requirements, according to the report by rating agency Icra. "]], "time": [["Last Updated: Jun 02, 2020, 06.56 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: The extension of moratorium on loan repayments till August by ", "the Reserve Bank of India", " will impact non-banking financial companies' (NBFCs) collections and affect their liquidity conditions, says a report. In March, ", "RBI", " had announced a three-month moratorium on loan repayments due between March 2020 and May 2020. Last month, the central bank further extended the moratorium by three months. \n", "\n", " Most NBFCs carried adequate on-balance sheet liquidity as of March 2020, which, along with access to funding lines, would be sufficient to meet their three-month requirements, according to the report by rating agency Icra. \n", "\n", " \"However, the extension of moratorium till August 2020 could adversely impact their collections than the previously anticipated levels,\" its vice president and sector head (financial sector ratings) A M Karthik said in the report. \n", "\n", " About 30-75 per cent NBFCs' asset under management (AUM) is under repayment moratorium though not all lenders have extended a moratorium to NBFCs. \n", "\n", " Also, the moratorium is not applicable for market instruments, which account for about 35-40 per cent of the outstanding borrowings, the report said. \n", "\n", " While fresh sanctions from lenders including financial institutions (SIDBI, NABARD, ", "NHB", ") are in various stages of approval, the liquidity profile of NBFCs, especially lower rated and small entities, could witness headwinds in the event of any delays in securing fresh funding and as RBI permits them to offer a further three-month moratorium period to their borrowers, the rating agency said. \n", "\n", " It said NBFCs are estimated to have close to Rs 6-6.5 lakh crore of long-term debt maturities in the current fiscal. Non-convertible debenture (", "NCD", ") maturities of non-banks are estimated at about Rs 2.6 lakh crore while bank loan maturities are estimated to be about 3 lakh crore in 2020-21. \n", "\n", " This apart, commercial paper (CP) maturities over the period May 2020 -March 2021 is about Rs 1.2 lakh crore. \n", "\n", " \"Of the total NCD maturities of NBFCs in FY21, lower rating categories (A+ and lower, excluding entities in default) is only about 11-12 per cent. Targeted funding to these entities would help them weather near-term headwinds,\" Karthik said. \n", "\n", " Icra further said the extension of moratorium would also negatively impact loan sell-down volumes, which emerged as the key funding avenue for NBFCs since the third quarter of 2018-19,with banks being the largest investor segment in this category. \n", "\n", " Loan sell-down volumes, which remained healthy at about Rs 1.9-2.0 lakh crore over the last two fiscals, would be significantly impacted in the current fiscal, further exacerbated by asset quality concerns amidst rising uncertainties caused by the contracting economic activity, the report said.\n"]], "tags": ["The Reserve Bank of India", "hv anu anu", "RBI", "NHB", "NCD"]},
{"heading": [["Bank of India sees impact on recoveries, profitability due to COVID-19"]], "sub_heading": [["The impact of COVID-19 is different in different territories, based on its severances and category of zone such as Red, Orange or Green, Bank of India said in a disclosure to bourses."]], "time": [["Last Updated: Jun 01, 2020, 10.20 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Bank of India", " on Monday said its recoveries may get affected in the second quarter due to moratorium on ", "loan repayments", " while profitability may get impacted in June and September quarters due to the lockdown of economic activities because of ", "coronavirus", " pandemic. The impact of ", "COVID-19", " is different in different territories, based on its severances and category of zone such as Red, Orange or Green, Bank of India said in a disclosure to bourses. \n", "\n", " Market regulator Sebi last month had asked companies to make detailed disclosures about the impact of coronavirus pandemic on their businesses. \n", "\n", " Reiterating that banking has been allowed as an essential services during lockdown since late March, the banker said the outbreak of COVID-19 pandemic had impacted credit and recovery segments. \n", "\n", " \"Though there was an impact on recovery, loan default risk has been largely minimized on account of grant of moratorium on repayment of loans and other measures to reduce the interest burden by ", "Reserve Bank of India", " (RBI). \n", "\n", " \"Due to postponement of repayment of principle and interest from 1st March 2020 to 31st August 2020, our recoveries may get affected in Q2 onwards. Due to this revenue and provisioning of the bank may get affected for later quarters,\" it said in the disclosure. \n", "\n", " However, with the measures being taken by the central government and various state governments, position is expected to improve. \n", "\n", " On profitability, Bank of India said it may get impacted during the first and second quarter of this fiscal due to lockdown of economic activities. \n", "\n", " Hopefully, profitability will improve during second half of the current financial year subject to restoration of normal economic activity, it added. \n", "\n", " On its capital and financial resources, the bank said that it is not foreseeing any capital and liquidity constrains on account of impact of COVID-19. \n", "\n", " The lender also informed that there is no liquidity constraints because of the timely measures taken by the RBI and government. \n", "\n", " \"Bank is having sufficient liquidity to honour its debts and other financial arrangements. The RBI has also opened its window to provide liquidity to MSME and other borrowers. Further, the bank is also continuously mentioning its asset liability management position and other requirement. \n", "\n", " Bank of India said demand for product/services may improve during the second half of the current financial year subject to restoration of normal. \n", "\n", " Bank of India shares closed 9.68 per cent higher at Rs 34.55 on BSE.\n"]], "tags": ["bank of india", "reserve bank of india", "coronavirus", "loan repayments"]},
{"heading": [["PSBs restart the pending post-merger work after lockdown"]], "sub_heading": [["Some of the top executives, who were stranded due to lockdown, have begun taking up their new roles and redrawing strategies at head offices, people familiar with the matter said. However, the realignment and rationalisation of branches are yet to begin, even as field general manager offices started functioning to push credit growth in line with the government objectives."]], "time": [["Last Updated: Jun 02, 2020, 11.23 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Kolkata: State-run ", "bank mergers", " are getting a new life after being in suspended animation for two months. With the lockdown being lifted, ", "Punjab National Bank", ", Union Bank of India, ", "Canara Bank", " and ", "Indian Bank", " have begun the pending post-merger relocation and organisational realignment exercise.\n", "\n", "Some of the top executives, who were stranded due to lockdown, have begun taking up their new roles and redrawing strategies at head offices, people familiar with the matter said.\n", "\n", "However, the realignment and rationalisation of branches are yet to begin, even as field general manager offices started functioning to push credit growth in line with the government objectives.\n", "\n", "“We have kept the disruption to the minimum by retaining officials at same or nearby centres as far as possible. Where there is merger of zones, there is certain relocation necessary. Now it will definitely gain momentum with opening up of flights,” said Padmaja Chunduru, chief executive at Indian Bank. However, she said that the organizational restructuring begun even through the Covid period.\n", "\n", "PNB, Union Bank, Canara Bank and Indian Bank have turned bigger following the big bank merger involving amalgamation of 10 banks into four effective from April 1. These banks with their larger balance sheet may be capable of lending big but they would be able to exercise their full potential until the post-merger rearrangements become operational on ground.\n", "\n", "Some of the realignments could not be completed as the country went into lockdown since March 24 to tackle the Covid-19 pandemic. The exercise may take longer than expected as banks have been working with minimum strength since lockdown. The IT-integration is another area where banks are facing challenges due to skeletal staff.\n", "\n", "“Organizationally, challenges are more from operating branches, ensuring staff safety and customer service,” Chunduru said, adding that the interoperability system of bank transactions is implemented and bank customers are getting the benefit of it.\n", "\n", "Indian Bank will now be under 14 field general managers overseeing 78 zones with “the FGMs are already handling their zones virtually. The bank, after its merger with Kolkata-based Allahabad Bank, has divided the east and the northeast markets into two and assigned FGMs to oversee them.\n", "\n", "PNB, on the other hand, has made Kolkata its zonal head office following its merger with Oriental Bank of India and Kolkata-based United Bank of India. Kolkata zone will be headed by a chief general manager.\n", "\n", "“The new FGM offices in PNB have become functional from today,” said a senior bank official.\n", "\n", "\"The economy now needs the support of public sector banks. Capability of lending by public sector banks is quite high after the amalgamation,” Union Bank of India chief executive Rajkiran Rai had said a couple of days back at a webinar.\n", "\n", "Andhra Bank", " and Corporation Bank got merged into Union Bank of India, while Syndicate Bank was merged into Canara Bank, as per the mega merger plan.\n", "\n"]], "tags": ["Canara Bank", "Indian Bank", "andhra bank", "Barclays Africa Group", "bank mergers", "Punjab National Bank"]},
{"heading": [["One move at a time by Rahul Singh, CIO-Equities, Tata Mutual Fund"]], "sub_heading": [[]], "time": [["Last Updated: May 19, 2020, 12.50 PM IST"]], "publisher": [["Mediawire"]], "article": [["  ", "  ", "  ", "  ", "  ", "  ", "From the CIO Desk - Issue 15", "   ", " ", " Media Contact:", " Heena Uttamchandani, Corporate Communication, huttamchandani@tataamc.com", " ", " "]], "tags": []},
{"heading": [["Coronavirus impact: NBFCs urge RBI to allow draw-down from reserves for provisioning"]], "sub_heading": [["\"We urge upon RBI to consider, as a one-time measure, to allow NBFCs to draw-down from their Reserves and adjust towards additional Expected Credit Losses provision requirement, in excess of provision calculated as per normal Probability of Default and Loss Given Default,\" Finance Industry Development Council, a representative body of assets and loan financing NBFCs, said in a letter to RBI Governor Shaktikanta Das. "]], "time": [["Last Updated: May 15, 2020, 06.26 PM IST"]], "publisher": [["PTI"]], "article": [["Mumbai: Non-banking financial companies (NBFCs) on Friday requested the ", "Reserve Bank of India", " (", "RBI", ") to allow them to draw-down from their reserves for making additional provision for expected losses due to COVID-19 pandemic. ", "NBFCs", " appropriate pro Statutory and Other Reserves, and utilization of these reserves is governed by the statute requiring its creation. \n", "\n", "\"We urge upon RBI to consider, as a one-time measure, to allow NBFCs to draw-down from their Reserves and adjust towards additional Expected Credit Losses (ECL) provision requirement, in excess of provision calculated as per normal Probability of Default (PD) and Loss Given Default (LGD),\" Finance Industry Development Council (FIDC), a representative body of assets and loan financing NBFCs, said in a letter to RBI Governor ", "Shaktikanta Das", ". \n", "\n", "NBFCs are required to comply with ", "Indian Accounting Standards", " (IndAS). The Institute of Chartered Accountants of India (ICAI) has advised NBFCs to measure the impact of COVID-19 on the portfolio quality in the form of PD and LGD with adverse impact on the business of the borrowers or debtors due to COVID-19 on one hand and prudential regulatory actions to sustain the economy such as loan repayment holidays and reduction in interest rates. \n", "\n", "As per IndAs norms, that are applicable in respect of ECL measurement and disclosure in the financial statements, the NBFCs are required to make additional provisioning in terms of ICAI advisory and it will surely make a severe dent on the profitability and net worth of the respective NBFCs particularly considering the impact of COVID-19 on the vulnerable sections of society, FIDC said. \n", "\n", "A one-time draw-down from reserves would enable the NBFCs to shore-up their balance sheet strength by reporting a more fortified ECL provision cover against their likely increase in delinquent loans and remain eligible to access equity/debt capital when situation normalizes, the letter read. \n", "\n", "The sector has asked the RBI to consider permitting any provisions made as per ECL, in respect of the standard assets, to be reckoned with for the purpose of tier II capital. \n", "\n", "The industry also requested the RBI to increase the ceiling for considering standard asset provision for calculation of capital adequacy to 2.5 per cent from 1.25 per cent. \n", "\n", "FIDC has urged the RBI to allow NBFCs a one-time window for restructuring of all loans.\n"]], "tags": ["Indian Accounting Standards", "coronavirus impact", "Shaktikanta Das", "reserve bank of india", "RBI", "NBFCs"]},
{"heading": [["By default: Coronavirus threatens to derail retail boom for Indian lenders"]], "sub_heading": [["Indian banks are facing a jump in coronavirus-related defaults on credit card dues, personal and vehicle loans."]], "time": [["Last Updated: May 15, 2020, 07.14 PM IST"]], "publisher": [["Reuters"]], "article": [["MUMBAI: Indian ", "lenders", " are facing a jump in coronavirus-related defaults on ", "credit card", " dues, personal and vehicle loans, forcing them to set aside hundreds of millions of dollars and take steps like asking sales staff to track down borrowers who have vanished.\n", "\n", " A near two-month nationwide lockdown to halt the spread of COVID-19 has clobbered India's retail financial segment, seen as the last bastion for a banking industry that had already raked up more than $120 billion in bad loans and is ranked the third-worst among 13 major world economies in asset quality.\n", "\n", " The provisions for the bad loans are set to significantly shrink profits of privately owned lenders this financial year, while state-owned ", "banks", " will need yet more government funds to survive, analysts say.\n", "\n", " Non-repayment of credit card and personal loans has surged in the last few weeks, according to several senior bankers and industry insiders, increasing the troubles of lenders already struggling with soured loans to larger corporates, and potentially slowing down the country's recovery from the crisis.\n", "\n", " \"The situation is so bad that even people who can pay are not paying up or are delaying their payments and all of this will snowball into a big problem,\" said a banker in the retail division of a private bank.\n", "\n", " ICICI Bank, India's second-biggest private sector bank whose lending is nearly two-thirds retail focused, reported a quarterly profit last week that fell way short of analyst estimates after it set aside 27.25 billion rupees ($362 million) for the ", "coronavirus", ". Its shares fell after the results.\n", "\n", " Banks such as RBL and IndusInd may be hit harder as a weaker deposit franchise makes them more vulnerable.\n", "\n", " \n", "\n", " Public and private sector banks grew their retail lending rapidly over the past five-six years as India's economy expanded and consumption increased.\n", "\n", " Retail lending was not only more profitable - rates on credit cards could be as much as 36% annually compared to the 9%-12% that banks typically charge corporates - it also helped banks reduce their exposure to the cyclical risks of industrial businesses.\n", "\n", " Since 2015, retail lending has grown at an annual average of nearly 15%, at least twice that of corporate lending, as Indians' purchases of overseas trips to gadgets and automobiles were bankrolled by the lenders.\n", "\n", " Even before the coronavirus struck, that surge drew caution from the banking regulator, which warned over the last few years that lenders were being too aggressive in the retail segment. But the warnings were ignored by the banks, and by non-banking financial companies (NBFCs), also known as \"shadow banks\".\n", "\n", " Shadow banks account for nearly 20% of total loans in India and typically lend to individuals in the informal sector who find it difficult to secure loans from a bank. The hit from the virus has been particularly severe on them. \n", "\n", " Suman Chowdhury, chief analytical officer at ratings agency Acuite Ratings & Research, said he estimated only a fifth of borrowers from shadow banks have paid up in April and May, and expects the same at their next due date as individuals try to conserve cash.\n", "\n", " If the norms for bad loans-classification aren't relaxed by the central bank in the coming months, such loans at shadow banks will double in the next six months, he added.\n", "\n", " \n", "\n", " India's economy has ground to a standstill amid the lockdown, that, according to several rating agencies and analysts, will lead to the economy contracting in the year ending in March. \n", "\n", " As revenues dwindle, companies are rushing to cut costs, leading to a spike in job losses that bankers fear will result in more defaults. \n", "\n", " The Centre for Monitoring Indian Economy, an independent think-tank, estimates that during March and April nearly 114 million Indians lost their jobs.\n", "\n", " Loan recoveries have also been hamstrung by hundreds of thousands of migrant workers leaving cities as work dried up.\n", "\n", " \"Many are not traceable now and it is proving to be very challenging,\" a senior executive at a leading ", "NBFC", " said, adding that people from the firm's sales team were being moved in dozens to focus on debt recovery.\n", "\n", " Collections have also dropped due to a moratorium on loan repayments allowed till end-May by the central bank. If that moratorium is not extended, bad loan ratios could spike sooner, analysts said.\n", "\n", " At 9.5% of total banking assets in 2018, India's bad loan ratio was worse than even Italy's and Portugal's, according to Indian credit ratings firm CARE, which cited World Bank data.\n", "\n", " Prime Minister ", "Narendra Modi", "'s government and bankers expect that ratio could double to 18%-20% by March 2021, which would push lenders deep into the red and threaten the viability of some state lenders, necessitating fresh capital infusions. \n", "\n", " The government has already pumped in close to $50 billion over the last five years into state-run banks, the worst hit by the bad loan problem. Till early last month it was considering investing at least $2.7 billion to $3.3 billion more, but the sum is now likely to go up significantly, sources said.\n", "\n", " \"With financial markets in a tailspin, the responsibility to fund new capital needs to be squarely borne by the government and/or the central bank,\" said Ketki Bhagwati, a veteran banker and senior advisor to U.S. think-tank the Atlantic Council.\n", "\n", " \"Otherwise India's banking sector will never fully recover.\"\n", "\n"]], "tags": ["lenders", "Narendra Modi", "NBFC", "default", "banks", "coronavirus", "credit card"]},
{"heading": [["Tata Mutual Fund Newsletter: From the CIO's Desk - May 2020"]], "sub_heading": [[]], "time": [["Last Updated: May 18, 2020, 02.40 PM IST"]], "publisher": [["Mediawire"]], "article": [["  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", " ", " ", " Media Contact:", " Heena Uttamchandani, Corporate Communication, 9821009003, huttamchandani@tataamc.com", " ", " "]], "tags": []},
{"heading": [["Microfinance lenders aim at repayment collection, restoring credit cycle amid rising stress"]], "sub_heading": [["Microfinance leaders fear extended moratorium may increase stress and derail their robust credit discipline. "]], "time": [["Last Updated: May 26, 2020, 06.41 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Microfinance firms", " and small finance banks are desperately looking to boost repayment collection to revive cash flow and resume loan disbursement to restore normalcy in ", "credit cycle", " even as ", "the Reserve Bank of India", " extended moratorium on payment till August 31 for borrowers under stress.\n", "\n", "The prime concern expressed by microfinance leaders now is that the extended moratorium might increase stress and derail the robust credit discipline that they nurtured over the years. \n", "\n", "\"It's a disaster,\" said a chief executive of an ", "MFI", ". \"Many of the borrowers may not able to service loans after the six month of repayment holiday.\"\n", "\n", "Merely about 15% borrowers have shown willingness to start repayment till the third week of May, people familiar with the matter said. Repayment rates were down to 12% till the end of April, according to Sa-Dhan, an industry body. \n", "\n", "\"Since rural economic activities are up and running since May 4, we would give moratorium only to those who are facing difficulties in repayment. We will start disbursement and collections from June 1,\" said Udaya Kumar Hebbar, managing director at CreditAccess Grameen, India's largest MFI by loan outstanding. \n", "\n", "CreditAceess had offered moratorium to all its borrowers till May 31.\n", "\n", "Even for other non-bank lenders such as vehicle financiers, collection efficiency would still be sub-par, and hence, asset-liability management remains an important issue beyond August, Motilal Oswal Financial Services said in a note. \n", "\n", "Lenders across the spectrum are now trying to discourage customers to take moratorium.\n", "\n", "\"Moratorium comes at a cost, so we would be fully transparent with our clients helping them take the optimal decision. The industry is also keen to provide credit to our regular repayment customers to rebuild their livelihoods,\" said Manoj Nambiar, chairman at ", "Microfinance Institutions Network", ", a self-regulator for NBFC-MFIs.\n", "\n", "A back of the envelope calculation shows that if Rs 10,000 was the loan outstanding at the end of February, an additional interest of about Rs 900 would be accrued by August 31 when the moratorium ends (if interest rate is 22% and if a borrower takes moratorium for five months). \n", "\n", "About 48% of the bottom of the pyramid borrowers have reported total loss of income while 84% said they would not be able to make repayment in the next few months, according to a survey done by Sa-Dhan.\n", "\n", "It said 54% of clients have benefited from various financial and economic packages of the government, with the number of clients in urban areas benefiting from such initiatives remaining below 30%.\n", "\n", "\"We will start regular loan disbursement to our existing customers and resume repayment collection from those who are willing. We will extend moratorium to those who are willing to get it,\" said K Paul Thomas, managing director of Kerala-based ESAF Small Finance Bank.\n", "\n", "\"Sustenance of the industry depends on how efficiently funds flow in the days to come,\" said P Satish, executive director of Sa-Dhan. \"While the present situation has created a high liquidity stress, the industry has always bounced back on the face of adversity. Adaptation and investment on technology will play a pivotal role for the industry in the new normal scenario,” he said.\n", "\n"]], "tags": ["MicroFinance Institutions Network", "mfi", "NBFC", "RBI moratorium", "The Reserve Bank of India", "credit cycle", "microfinance firms"]},
{"heading": [["Nine NBFCs surrender certificate of registration"]], "sub_heading": [["The certificate of registration is granted by the RBI. With surrendering the certificates, the companies cannot transact the business of a non-banking financial institution. In another statement, the central bank said it has cancelled the certificate of registration of 14 non-banking financial companies (NBFCs). "]], "time": [["Last Updated: May 19, 2020, 03.18 PM IST"]], "publisher": [["PTI"]], "article": [["Mumbai: Nine NBFCs, including ", "Reliance Net", " and ", "Nischaya Finvest Private Limited", ", have surrendered their certificate of registration, the ", "Reserve Bank of India", " said on Tuesday. ", "Penrose Mercantiles", " Ltd, ", "Manohar Finance India Ltd", ", ", "Chandelier Tracon Pvt Ltd", ", and Sanghi Hire Purchase Ltd are among the ", "NBFCs", " which have surrendered their certificates. \n", "\n", "The certificate of registration is granted by the RBI. \n", "\n", "With surrendering the certificates, the companies cannot transact the business of a non-banking financial institution. \n", "\n", "In another statement, the central bank said it has cancelled the certificate of registration of 14 non-banking financial companies (NBFCs). \n", "\n", "Primus Capital Private Limited", " (Formerly known as Rapid Growth Capital Services Private Limited), Bharat Finance and Industries Limited, Signature Finance Private Limited, Dee Bee Leasing and Hire Purchase Pvt Ltd, Jindal Finlease Pvt Ltd, and B L S Investments Pvt Ltd, are among the NBFCs whose certificate of registration were cancelled by the RBI.\n"]], "tags": ["chandelier tracon pvt ltd", "penrose mercantiles", "reserve bank of india", "manohar finance india ltd", "primus capital private limited", "nischaya finvest private limited", "Reliance Net", "NBFCs"]},
{"heading": [["Successful implementation of support measures for NBFI will be key: Fitch"]], "sub_heading": [["In a statement Fitch said, NBFIs will continue to face considerable risks to their asset quality and liquidity even as the economy reopens gradually and banks - the major source of incremental NBFI funding - will remain cautious in the face of looming asset quality pressure."]], "time": [["Last Updated: May 20, 2020, 04.07 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Fitch Ratings", " on Wednesday said support measures announced by the government for ", "non-banking finance companies", " seek to ease borrower strain and boost funding conditions for NBFIs, but successful implementation will be the key.\n", "\n", "In a statement Fitch said, NBFIs will continue to face considerable risks to their ", "asset quality", " and liquidity even as the economy reopens gradually and banks - the major source of incremental NBFI funding - will remain cautious in the face of looming asset quality pressure.\n", "\n", "The government last week announced a Rs 75,000 crore support package for NBFIs.\n", "\n", "This includes a Rs 30,000 crore special ", "liquidity scheme", " for non-banking finance companies, housing finance companies and micro-finance institutions that are finding it difficult to raise money in debt markets and also a Rs 45,000 crore partial credit guarantee scheme 2.0 for those with low credit rating to help them extend a loan to individuals and MSMEs.\n", "\n", "Fitch said Indian non-bank financial institutions' (NBFI) funding and liquidity will continue to face pressure despite a pick-up in loan collections.\n", "\n", "\"Additional support initiatives announced by the Indian government last week could help to address some earlier policy gaps, but successful implementation will be key and India has a mixed record on this front,\" Fitch said.\n", "\n", "It expects collections for the next few months to continue to fall well short of pre-coronavirus repayment schedules even though NBFI loan receipts should improve from April's depressed levels as coronavirus-related curbs are gradually eased.\n", "\n", "\"The government's latest measures seek to ease borrower strain and boost funding conditions for NBFIs. A fully guaranteed Rs 3 trillion (USD40 billion) loan scheme for micro, small and medium enterprises aims to encourage lenders to continue funding these more-vulnerable entities, while a modest NBFI debt guarantee plan could help smaller but creditworthy non-bank lenders,\" it added.\n", "\n", "Fitch said the success of these schemes will rest on implementation details that are yet to be released as well as lowering the risk aversion among banks as they are the key intermediaries in the sector.\n", "\n", "\"Pandemic-related liquidity support measures to date have had limited success in improving funding conditions for the NBFI sector,\" it added.\n", "\n", "Fitch took negative action on rated Indian NBFI portfolio in late March to reflect the sector's vulnerability to a coronavirus-related downturn. Since then, loan collections have taken a hit amid the extended economic shutdown.\n", "\n", "Fitch-rated NBFIs have retained sufficient funding access consistent with their rating levels over the period, and recent developments are net positive for the sector.\n", "\n", "\"However, conditions remain fragile, and Fitch will continue to monitor underlying developments closely as we look to address the Negative Watches on our Indian NBFI ratings over the coming months,\" the statement added. \n", "\n"]], "tags": ["Fitch Ratings", "liquidity scheme", "MSME", "asset quality"]},
{"heading": [["Amidst liquidity crunch due to Covid, businesses face risk of frauds, round tripping and evergreening of loans: PwC report"]], "sub_heading": [["Unstable cashflows and low reserves, coupled with a restricted ability to seek additional debt or equity financing, can create immense pressure on businesses to divert funds between entities for non-permissible or surreptitious purposes, said the PwC report titled ‘Rethinking Fraud and Economic Crime.’"]], "time": [["Last Updated: May 27, 2020, 02.54 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: Tight liquidity could see scenarios of fund diversion, round tripping and evergreening of loans in a desperate bid by some companies to beat the ", "economic headwinds", " from the Covid-19 crisis, a ", "PwC report", " said.\n", "\n", "Unstable cashflows and low reserves, coupled with a restricted ability to seek additional debt or equity financing, can create immense pressure on businesses and companies will see increased risk of fund diversion between entities for non-permissible or surreptitious purposes, said the PwC report titled ‘Rethinking ", "Fraud", " and Economic Crime.’\n", "\n", "Already several banks, investors and even regulators have started monitoring companies for fraud or corporate governance lapses.\n", "\n", "“While the risk of round tripping is agnostic to the size of a company, there is generally a higher risk among the listed entities including their associates due to additional pressures of being public or companies or groups having high debt burden. Lenders have put in monitoring mechanisms to check end use of funds apart from including more stringent conditions on utilisation of the funds and reporting,” said Gaganpreet Singh Puri, leader, forensic services, ", "PwC India", ".\n", "\n", "Many banks are roping in investigators to monitor stressed accounts to check end use of funds fearing some promoters and companies may be “creating illusions” to show false business activity.\n", "\n", "In the past, some Indian promoters and companies have managed to beat the law by creating conduits or shell companies to siphon off or divert money that technically cannot be defined as related entities.\n", "\n", "The report adds that the liquidity pressure on companies could lead to not only ‘evergreening’ of loans or showing loans as ‘current’ to secure additional funding from lenders but a few promoters could also indulge in personal profiteering or siphoning off funds.\n", "\n", "Many lenders suspect that some companies and promoters may move funds using undisclosed bank accounts and banking channels and then route collections or business receipts to the undisclosed bank accounts.\n", "\n", "“In recent times there has also been an increase in instances of mandating forensic or special audits on a pro-active basis around governance and usage of these funds,” said Puri.\n", "\n", "ET had on May 20 written that ", "Bank of Baroda", " is looking to rope in an external agency to monitor 33 NBFCs it has lent money.\n", "\n", "Monitoring agencies would be assessing the asset quality, cash holdings, likely siphoning off of funds if any, flag non-business transactions among a host of others requirements.\n", "\n", "As per the PwC report even bribery and corruption could increase in the coming months. Due to the changed contours of business interactions, the modus operandi for bribery and corruption would change, mandating an update to policies and procedures, the report said.\n", "\n", "Going ahead some of the regulators could also initiate investigations in cases where they observe red flags. Regulators may direct companies to provide independent investigation reports or drive their own investigations into corporate failures, alleged misadventures and ethical shortfalls of people in charge of governance. It will also not be unreasonable to expect heightened cooperation between various regulatory agencies, both domestic and international (owing to travel restrictions), on matters related to enforcement or investigation of cases that get picked up for inquiry,” the PwC report added.\n", "\n", "\n"]], "tags": ["PwC report", "Fraud", "bank of baroda", "PWC India", "economic headwinds"]},
{"heading": [["NCLT approves IL&FS stake sale in GIFTCL to Gujarat government"]], "sub_heading": [["The order said that IL&FS had sought that an amount of Rs 61.84 lakh is excluded as resolution process costs incurred for meeting various expenditures, other applicable taxes from the sale proceeds of the applicant's shareholding in GIFTCL to the Gujarat government. "]], "time": [["Last Updated: May 27, 2020, 07.34 PM IST"]], "publisher": [["PTI"]], "article": [[" ", "The National Company Law Tribunal", " has approved crisis-hit IL&FS to selling its stake in Gujarat International Finance Tec-City Company (", "GIFTCL", ") to the ", "Gujarat government", ". IL&FS has 50 per cent stake in GIFTC. \n", "\n", " The Gujarat government has agreed to pay a positive equity value of 100 per cent of the IL&FS stake in GIFTCL, by which, the positive equity value of over Rs 32.70 crore will come to IL&FS, according to an ", "NCLT", " order.\n", "\n", " The order said that IL&FS had sought that an amount of Rs 61.84 lakh is excluded as resolution process costs incurred for meeting various expenditures, other applicable taxes from the sale proceeds of the applicant's shareholding in GIFTCL to the Gujarat government. \n", "\n", " The NCLT also permitted IL&FS to withdraw a sum of Rs 3 crore from the escrow account opened to keep sale consideration for meeting the additional process resolution costs that may arise, after approval by ", "the Board of Directors", " appointed by the tribunal. \n", "\n", " \"In view of the relief sought by the applicant, this bench hereby approved that sale of shares of GIFTCL held by IL&FS to Governor of State of Gujarat/Gujarat Urban Development Company Limited shall be free and clear from all encumbrances, liens, security interest and third party claims (including any statutory or tax claims) upon receipt of sale consideration from GUDC,\" it said. \n", "\n", " That sale consideration payable to IL&FS excluding resolution process costs will be credited into a designated Escrow Account intimated by the applicant and such funds will be maintained as interest bearing fixed deposits, the order added. \n", "\n", " The National Company Law Appellate Tribunal (NCLAT) had permitted green entities to continue in accordance with the resolution framework subject to the supervision of the Justice (Retd.) D K Jain. \n", "\n", " Since GIFTCL has been classified as a \"Green\" entity, IL&FS commenced the resolution process of GIFTCL.\n"]], "tags": ["GIFTCL", "the national company law tribunal", "the board of directors", "IL&FS stake sale", "nclt", "Gujarat government"]},
{"heading": [["Harsh Agarwal, Head  Alternative Strategies, Tata Asset Management"]], "sub_heading": [[]], "time": [["Last Updated: May 28, 2020, 11.10 AM IST"]], "publisher": [["Mediawire"]], "article": [["  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", "  ", " ", " "]], "tags": []},
{"heading": [["SoftBank-Bharti JV eyes up to $750 million fund-raise"]], "sub_heading": [["SB Energy, renewable energy arm of SoftBank, has mandated Bank of America Merrill Lynch and Barclays to help raise $500-$750 million in SBG Cleantech — it’s 80:20 joint venture with Bharti, multiple people aware of the development said."]], "time": [["Last Updated: May 29, 2020, 11.32 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: SoftBank-backed renewable energy firm ", "SBG Cleantech", " is set to reach out to financial and strategic investors to raise capital to fund its ongoing and pipeline projects in India and the US.\n", " \n", "SB Energy, the renewable energy arm of ", "SoftBank", ", has mandated ", "Bank of America", " Merrill Lynch and Barclays to help raise $500-$750 million in SBG Cleantech, it's 80:20 joint venture with Bharti, multiple people aware of the development said.\n", " \n", "Formal outreach to potential investors – global utilities, infrastructure-focused PE funds, pension and sovereign wealth funds (SWFs) – will start in the coming weeks, they said. \n", " \n", "On offer is the JV's entire global portfolio, except Japan where SoftBank’s renewable projects are owned by a separate entity.\n", " \n", "Confirming the development, a Softbank spokesperson told ET, “SB Energy is exploring potential co-investment partnerships to accelerate growth of its leading renewable energy platform.” Reiterating its commitment to the venture, the person said, “SoftBank is fully committed to its long-term ownership of SB Energy and has no plans to divest the business.” \n", " \n", "Mails to Bharti did not generate a response till press time Thursday. \n", " \n", "SBG Cleantech predominantly has operating assets in India but also has assets across the US, Latin America and Middle East through acquisitions and bidding.\n", "\n", "The company claims to have 7.7-gigawatt pipeline of projects in India and will reach its 20-gigawatt target within the next five years. Currently, as per the management, it has nearly 2 GW operating renewable energy capacity in the country, 2 GW under construction, and additional 3,700 MW under “active development” with contracts in hand.\n", "\n", "As on December 2019, the joint ventures partners had made equity financing of $737 million in SBG Cleantech with around $590 million coming from Softbank alone. \n", "\n", "Another $1.2 billion of equity was required then for the pipeline and operational projects to get completed.\n", "\n", "The latest exercise comes after efforts to on-board a marque investor failed as did plans of a bond issuance said people in the know.\n", "\n", "ET had in its January 9 edition reported that SoftBank was in talks with SWFs in the Middle East and Asia, some of whom are limited partners (LPs) of SoftBank Vision Fund, besides Silicon Valley-based technology giants that are big buyers of clean energy for an investment, and was even open to selling a majority stake in the venture. This was part of an ongoing review as parent SoftBank was facing record losses and liquidity pressures.\n", "\n", "SB Energy CEO Raman Nanda had at that time told ET, “As part of business strategy, we review all options to raise external capital, including strategic investments, from time to time.” He had insisted there was absolutely no plan to exit the business even as SoftBank founder ", "Masayoshi Son", " subsequently announced a $40 billion asset sale programme across his technology-telecoms platforms.\n", "\n", "People with direct knowledge on the matter said Softbank had then broad-based those conversations and even approached Brookfield and Actis in India. The discussions fell through predominantly on valuation mismatch, they said. \n", "\n", "According to industry peers, the company’s near-$1-billion leverage in operating projects could be a handicap in attracting investments. “On an average, the debt-Ebitda ratio of most renewable companies are 5.5 times,” CEO of a rival clean energy firm said on condition of anonymity. “In SB Cleantech’s case, it is around eight times. Their high cost structures could prove to be a challenge.”\n", "\n", " \n", "\n", "\n", "\n", "In 2015, amid much fanfare, SoftBank had teamed up with Bharti Enterprises and Taiwan’s Foxconn Technology Group to form a 70:10:20 alliance to build solar and wind parks and subsequently start manufacturing panels in India to promote Prime Minister Narendra Modi’s push for clean energy and Make in India initiatives. Together they were to invest $20 billion over a 10-year period to set up 20,000 MW, or 20 GW, of clean energy projects, subject to certain conditions. Later, Foxconn exited without investing at all and it became a 80:20 venture.\n", "\n", "The company’s plan to fix tariffs in dollars by negotiating differentiated dollar power purchase agreements (PPAs) and demand for a central guarantee to buy electricity from its plants did not find favour with the government. This came as a setback to Son’s proposal to invest a staggering $1trillion by 2030. \n", "\n", "In India, the company has aggressively chased central government projects participating in auctions by Solar Energy Corporation of India (SECI) and NTPC to bulk its portfolio. It recently won two 600 MW each from state-run NHPC and SECI at Rs 2.55/kwh and Rs 2.50/kwh as renewable prices show a continuous decline. Its partnership with NHPC is aimed at providing affordable, round-the-clock renewable energy in a hybrid combination of solar and hydro. \n", "\n", "In the US, too, the company is looking at a gigawatt of solar parks out of the 1.7 GW platform that it acquired in 2019.\n", "\n", "The Covid-19 pandemic has impacted rollout plans for most solar players in India, including SBG Cleantech, as supplier shutdowns in China have impacted deadlines.\n", "\n", "\n"]], "tags": ["SBG Cleantech", "Bharti JV", "bank of america", "Softbank", "Masayoshi Son"]},
{"heading": [["PNB Housing Finance takes over Vipul Ltd Project after default"]], "sub_heading": [["The lender had sent a notice to the Bombay Stock Exchange listed developer in February, demanding repayment of the loan given against its project Aarohan Residences in Gurgaon."]], "time": [["Last Updated: May 29, 2020, 10.17 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: ", "PNB Housing", " Finance Limited said it has taken possession of about 19 acres of land and 138 unsold units of a Gurgaon-based project owned by ", "Vipul Ltd", " following a default by the developer on a Rs 377 crore loan. \n", "\n", "“The borrower failed to repay the amount, and we have taken constructive possession of the property on May 20,” PNB Housing Finance said in a notice to the developer, a copy of which was seen by ET.\n", "\n", "The lender had sent a notice to the Bombay Stock Exchange listed developer in February, demanding repayment of the loan given against its project ", "Aarohan", " Residences in ", "Gurgaon", ". It had also threatened to take over the company’s management and project under the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act if Vipul failed to make full payment within two months.\n", "\n", "Both Vipul and PNB Housing Finance did not respond to queries emailed by ET.\n", "\n", "The lender had approached the Delhi High Court in March and the court had subsequently directed Vipul to pay Rs 25 crore by month-end.\n", "\n", "Immovable assets that have been attached include 19.24 acre land of Aarohan Residences project on Gurgaon’s Golf Course Road and 138 unsold units of the project. \n", "\n", "Vipul caters to both residential and commercial segments in markets such as Ludhiana, Bhubaneshwar and Faridabad, besides Gurgaon, and has a portfolio of more than 10 million square feet of delivered properties.\n", "\n", "The developer’s account was classified as non-performing since January, after it failed to pay loan instalments. Thereafter, the lender directed Vipul not to sell flats in the project.\n", "\n", "“There was an NCLT (National Company Law Tribunal) case against the builder. One of its foreign joint venture partners had also moved NCLT, apart from FIRs (first information reports) against it for fraud,” said a bank official, requesting anonymity. “Yet, it had been paying on time, until a few months ago.”\n", "\n", "In January, the NCLT admitted Vipul for insolvency proceedings. \n", "\n", "However, PNB Housing Finance was not among the four financial creditors who had approached the NCLT at that time. \n", "\n", "Later, the National Company Law Appellate Tribunal set aside the insolvency proceedings, as the company claimed it had reached a settlement with the creditors. The appellate tribunal, however, said the insolvency proceedings could be resumed if the company failed to clear its dues.\n", "\n"]], "tags": ["PNB Housing", "PNB Housing Finance Ltd", "Gurgaon", "Aarohan", "Vipul Ltd"]},
{"heading": [["Finance Ministry appoints PR Jaishankar managing director of IIFCL"]], "sub_heading": [["The appointment comes after the Bank Boards Bureau (BBB), the headhunter for state-run banks and financial institutions, recommended Jaishankar on March 15. The post lied vacant for three years before the appointment."]], "time": [["Last Updated: May 29, 2020, 12.02 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["The ministry of finance appointed ", "PR Jaishankar", " as the managing director of the ", "India Infrastructure Finance Company Ltd", " (IIFCL) for three years. \n", "\n", "The appointment comes after the Bank Boards Bureau (BBB), the headhunter for state-run banks and financial institutions, recommended Jaishankar on March 15. The post lied vacant for three years before the appointment.\n", "\n", "Jaishankar served as the executive director of the National Housing Bank prior to this. His latest posting was approved by the appointments committee of the cabinet headed by Prime Minister ", "Naredra Modi", ".\n", "\n", "The ministry also appointed Harsha Bangari as deputy managing director (DMD) of Exim Bank. She was the bank’s chief general manager (CGM) before this.\n", "\n", "While VSV Rao, executive director of IFCI has been appointed as DMD for Small Industries Development Bank of India for three years, the CGM of National Bank for Agriculture and Rural Development, Sunil Kumar Bansal, will take over as DMD of IFCI.\n", "\n", "\n"]], "tags": ["pr jaishankar", "Naredra Modi", "Exim Bank of China", "Vishista Seva Vibhushanaya", "India Infrastructure Finance Company Ltd"]},
{"heading": [["Home Credit India lays off 1800 employees"]], "sub_heading": [["\"The unprecedented coronavirus pandemic has affected every aspect of our life. It has impacted each one of us, our families, our customers, partners and businesses. These trying circumstances have compelled us to revisit and re calibrate our business strategy keeping sustainability and business continuity in mind,\" the company said in a statement."]], "time": [["Last Updated: May 29, 2020, 10.30 AM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Consumer loan finance firm ", "Home Credit India", " on Thursday said it has reduced its headcount by 1,800 employees due to slowdown caused by COVID-19 crisis.\n", "\n", "\"The unprecedented coronavirus pandemic has affected every aspect of our life. It has impacted each one of us, our families, our customers, partners and businesses. These trying circumstances have compelled us to revisit and re calibrate our business strategy keeping sustainability and business continuity in mind,\" the company said in a statement.\n", "\n", "\"Unfortunately, this includes reducing the size of our team to meet the demands of these exceptionally challenging times. After careful deliberations, we have taken the difficult decision to reduce our headcount by 1,800 employees in India,\" it said.\n", "\n", "It is a tough decision and as an organization and the company will try to help the impacted people in getting new opportunities, it said. \n", "\n", "For the next 12 months, it said, Home Credit India's talent acquisition team will actively support these employees.\n", "\n", "\"We are confident that we shall come through these unfavourable times to achieve our goals of driving credit penetration and ", "financial inclusion", " through solutions that are simple, transparent, and accessible to all,\" it added.\n", "\n", "Earlier this month, many companies including ", "Indiabulls Home Finance", ", ", "HDB Financial Services", ", Uber, Ola and Swiggy have laid off employees as coronavirus pandemic hit the business.\n", "\n"]], "tags": ["Home Credit layoffs", "Home Credit India layoffs", "Home Credit India", "HDB Financial Services", "Home Credit India news", "latest Home Credit India updates", "Financial inclusion", "indiabulls home finance"]},
{"heading": [["PFC board clears RS Dhillon's appointment as CMD from June 1"]], "sub_heading": [["Dhillon's appointment as Chairman and Managing Director will be with effect from the date of assumption of charge of the post on or after June 2020. He would hold the post till the date of his superannuation (May 31, 2023) or until further orders,"]], "time": [["Last Updated: May 29, 2020, 04.03 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: State-run ", "Power Finance Corporation", " (PFC) on Friday announced the appointment of ", "Ravinder Singh Dhillon", " as Chairman and Managing Director from June 1 following superannuation of ", "Rajeev Sharma", " this month. The board of ", "PFC", " in its meeting held on Friday approved the appointment of Dhillon as CMD of the company in pursuance of an order of the Power Ministry issued in this regard on April 7, 2020, the power sector financier said in a statement. \n", "\n", " Dhillon's appointment as Chairman and Managing Director will be with effect from the date of assumption of charge of the post on or after June 2020, it said. \n", "\n", " He would hold the post till the date of his superannuation (May 31, 2023) or until further orders, the company said. \n", "\n", " Incumbent CMD Rajeev Sharma is attaining superannuation on May 31, 2020, after a glorious career spanning close to four decades, the company said. \n", "\n", " He has been instrumental in PFC's transformation as one of India's largest financial and lending institutions in the power sector and the fourth largest profit-making CPSE on a consolidated basis. \n", "\n", " Dhillon is presently serving as Director( Projects) in the PFC and has more than 35 years of experience in various areas of the power sector. \n", "\n", " An Electrical Engineer with post-graduation in Power Systems from IIT Delhi, he had worked with ", "Bharat Heavy Electricals", " Ltd and Central Electricity Authority prior to joining the PFC. \n", "\n", " In the PFC, he has worked in various capacities for over 25 years, handling ", "Project Appraisal, Business Development", ", Stressed Assets Revival and Monitoring of projects. \n", "\n", " Dhillon was associated as Director in development of Mundra Ultra Mega Power Project.\n"]], "tags": ["ravinder singh dhillon", "Power Finance Corporation", "Rajeev Sharma", "Bharat Heavy Electricals", "PFC", "project appraisal, business development"]}
]