[
{"heading": [["No evidence yet of coronavirus transmission onboard plane: IndiGo CEO"]], "sub_heading": [["Ronojoy Dutta's comments against the backdrop of instances of some passengers, who had taken flights after resumption of domestic air services on May 25, testing positive for coronavirus."]], "time": [["Last Updated: Jun 02, 2020, 10.23 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Emphasising that airlines are clearly the safest mode of transportation, ", "IndiGo", " CEO Ronojoy Dutta on Tuesday said there is no evidence yet of ", "coronavirus", " infection getting transmitted among passengers onboard an aeroplane.\n", "\n", "His comments against the backdrop of instances of some passengers, who had taken flights after resumption of domestic air services on May 25, testing positive for coronavirus.\n", "\n", "\"Those people had the virus before they got on to the aeroplane. What is noteworthy is that they have done the tracing after that. There is no evidence of transmission onboard there... that is a very encouraging sign on the safety of airline travel,\" he said during an earnings call.\n", "\n", "According to him, airlines are clearly the safest mode of transportation and there is no evidence yet of contamination on an aircraft.\n", "\n", "\"You can come in contaminated but so far there is no evidence of passing it on to a fellow passenger,\" he noted.\n", "\n", "Amid concerns over the ", "coronavirus pandemic", ", aviation regulator ", "DGCA", " has asked airlines to ensure that to the extent possible, ", "middle seat", " in flights should be kept empty.\n", "\n", "In this regard, Dutta said the airline would keep the middle seat empty wherever it can and \"where we have to fill the middle seat, we will have the extra protective gown\".\n", "\n", "To a query about possible hedging of fuel prices, he said it would be a dumb idea and that airlines adjust to ups and downs in fuel prices.\n", "\n", "\"I can't overemphasise what a dumb idea it will be for an airline to hedge fuel prices. I looked at it from different angles and it is not a good idea... we looked at hedging and we talked about it at the board level and we said no,\" he noted.\n", "\n"]], "tags": ["ceo ronojoy dutta", "middle seat", "coronavirus pandemic", "coronavirus", "coronavirus transmission on plane", "IndiGo", "DGCA"]},
{"heading": [["COVID-19 effect: DGCA extends deadline for IndiGo, GoAir to replace unmodified PW engines to August 31"]], "sub_heading": [["On Monday, the regulator said: \"We took a call a couple of days back and instructed both the airlines. Both taken together about 60 engines are yet to be replaced and the obvious reason was COVID-19 impact and the resultant lockdowns.\" "]], "time": [["Last Updated: Jun 01, 2020, 12.29 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Indian aviation regulator DGCA on Monday extended the deadline for ", "IndiGo", " and GoAir to replace all the 60 unmodified Pratt and Whitney (PW) engines on their A320neo planes from May 31 to August 31, as supply chain has been impacted due to the novel coronavirus-induced lockdown. The PW engine-powered A320 neo planes in IndiGo and GoAir fleets have been facing glitches both mid-air and on-ground since their induction way back in 2016. \n", "\n", "On January 13, ", "the Directorate General of Civil Aviation", " (DGCA) had said the unmodified PW engines do contain an \"unsafe condition, which is prone to undesirable outcomes\" and therefore, need to be dispensed with. \n", "\n", "On Monday, the regulator said: \"We took a call a couple of days back and instructed both the airlines. Both taken together about 60 engines are yet to be replaced and the obvious reason was COVID-19 impact and the resultant lockdowns.\" \n", "\n", "Supply chains and production lines got impacted due to the COVID-19 pandemic and in turn, disturbed the process, it added. \n", "\n", "\"Keeping all this in view, we have extended the deadline by three months; up to 31st of August 2020. Also, we instructed that for current times, aircraft with both engines modified should be flown and this should not be difficult as the curtailed operations are likely to last for some more time,\" the regulator said. \n", "\n", "Four Air Turn Back (ATB)/Inflight Shut Down (", "IFSD", ") events were witnessed on ", "Airbus", " A320Neo aircraft operated by Indigo in a week during October 2019 due to the failure of third stage ", "LPT", " (low pressure turbine) blades.\n"]], "tags": ["LPT", "The Directorate General of Civil Aviation", "airbus", "IndiGo", "ifsd"]},
{"heading": [["AirAsia India offers 50,000 seats without base fare to doctors amid pandemic"]], "sub_heading": [["Under the RedPass initiative, AirAsia India will give away 50,000 seats without any base fare on flights across its domestic sectors to doctors as a gesture of gratitude for their commendable efforts in support of the nation, the airline said in release. "]], "time": [["Last Updated: Jun 01, 2020, 05.15 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: No-frills airline ", "AirAsia India", " on Monday said it is offering 50,000 seats without charging base fare to the ", "doctor community", " who, along with other ", "frontline workers", ", are working to save lives amid the coronavirus ", "pandemic", ". \n", "\n", " \"As a mark of respect to our doctors and in recognition of the admirable values they have displayed through the last few months, we at AirAsia India wanted to express our gratitude for their tireless efforts in keeping the nation safe and healthy,\" Air Asia India Chief Commercial Officer Ankur Garg said. \n", "\n", " Under the RedPass initiative, AirAsia India will give away 50,000 seats without any base fare on flights across its domestic sectors to doctors as a gesture of gratitude for their commendable efforts in support of the nation, the airline said in release. \n", "\n", " However, airport fees, charges and statutory taxes will be borne by the traveller, it said. \n", "\n", " To avail the offer, doctors can submit their contact details and desired sector and date of travel between July 1 and September 30 with their registration number or ID as proof on its website, the airline said adding that the applications can be submitted by June 12. \n", "\n", " Besides these base free passes, they would also be given special privileges like priority boarding at the airport. The RedPass would be valid for a one way flight for the successful applicant doctors on the AirAsia India domestic network, the airline said in the release.\n"]], "tags": ["AirAsia India news", "AirAsia India", "doctor community", "pandemic", "frontline workers"]},
{"heading": [["Factors like lockdown in metro cities need to be addressed before resuming international flights: Hardeep Singh Puri"]], "sub_heading": [["Within India, most international flights operate from the metro cities where travellers arrive from the neighbouring cities and states, he said. "]], "time": [["Last Updated: Jun 01, 2020, 06.54 PM IST"]], "publisher": [["PTI"]], "article": [["Several factors like the lockdown in metro cities and the ban imposed by various countries on the entry of foreigners need to be addressed before resuming international passenger flights in India, Civil Aviation Minister ", "Hardeep Singh Puri", " said on Monday. Domestic services were suspended in India due to the coronavirus-induced lockdown and resumed after a gap of two months on May 25. Scheduled international passenger flights continue to remain suspended in the country. \n", "\n", "\"Numerous citizens have been approaching us to restart ", "international flights", ". Several factors need to be addressed. Many international destinations are not allowing incoming ", "passenger traffic", ", except for their own citizens or diplomats,\" Puri said on Twitter. \n", "\n", "Within India, most international flights operate from the metro cities where travellers arrive from the neighbouring cities and states, he said. \n", "\n", "\"Our metro cities were under various degrees of lockdown which are beginning to be lifted. Some of them are still allowing only limited flights to operate,\" the minister noted. \n", "\n", "Airports in West Bengal, Andhra Pradesh, Maharashtra, Telangana and Tamil Nadu have been allowed to handle a restricted number of daily flights as these states do not want a huge influx of flyers amid the rising number of COVID-19 cases. \n", "\n", "The minister said: \"MHA (Ministry of Home Affairs) guidelines for lockdown 5.0 have further opened up inter & intra-state travel, and will facilitate calibrated reopening of the sector. As we move towards the critical mass of 50-60% operation of domestic flights, our ability to resume international operations will also improve.\" \n", "\n", "Indian carriers operated a total of 3,370 ", "domestic passenger flights", " till May 31 -- 428 on May 25, 445 on May 26, 460 on May 27, 494 on May 28, 513 on May 29 and 529 on May 30. \n", "\n", "During the pre-lockdown period, Indian airports handled around 3,000 daily domestic flights, aviation industry sources said. \n", "\n", "In February, around 4.12 lakh passengers travelled daily through domestic flights in India, according to the Directorate General of Civil Aviation (DGCA) data.\n"]], "tags": ["Hardeep Singh Puri", "Domestic passenger flights", "coronavirus", "passenger traffic", "covid lockdown", "international flights"]},
{"heading": [["501 domestic flights carrying 44,593 passengers operated on Sunday: Hardeep Singh Puri"]], "sub_heading": [["Indian carriers operated a total of 3,370 flights till May 31 -- 428 on May 25, 445 on May 26, 460 on May 27, 494 on May 28, 513 on May 29 and 529 on May 30. "]], "time": [["Last Updated: Jun 01, 2020, 12.06 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: A total of 501 ", "domestic flights", " carrying 44,593 ", "passengers", " operated in the country on May 31, Civil Aviation Minister ", "Hardeep Singh Puri", " said on Monday. Domestic services were suspended in India due to the coronavirus-induced lockdown and resumed after a gap of two months on May 25. \n", "\n", "Indian carriers operated a total of 3,370 flights till May 31 -- 428 on May 25, 445 on May 26, 460 on May 27, 494 on May 28, 513 on May 29 and 529 on May 30. \n", "\n", "\"Domestic operations on 31st May 2020 (Day 7) till 2359 hrs. Departures 501. 44,593 passengers handled. Arrivals 502. 44,678 passengers handled,\" Puri tweeted on Monday. \n", "\n", "1590988547000", "\n", "\n", " A departure is counted as a flight during the day. \n", "\n", " During the pre-lockdown period, ", "Indian airports", " handled around 3,000 daily domestic flights, aviation industry sources said. \n", "\n", " In February, around 4.12 lakh passengers travelled daily through domestic flights in India, according to ", "Directorate General of Civil Aviation", " (DGCA) data. \n", "\n", " Airports in West Bengal, Andhra Pradesh, Maharashtra, Telangana and Tamil Nadu have been allowed to handle a restricted number of daily flights as these states do not want a huge influx of flyers amid the rising number of COVID-19 cases. \n", "\n", " While domestic services resumed in Andhra Pradesh on Tuesday, they restarted in West Bengal on Thursday.\n"]], "tags": ["Hardeep Singh Puri", "passengers", "Indian airports", "directorate general of civil aviation", "domestic flights"]},
{"heading": [["692 domestic flights flew on Monday, operations picking up pace: Hardeep Singh Puri"]], "sub_heading": [["Indian carriers operated a total of 4,062 flights till June 1 -- 428 on May 25, 445 on May 26, 460 on May 27, 494 on May 28, 513 on May 29, 529 on May 30, 501 on May 31 and 692 on June 1. "]], "time": [["Last Updated: Jun 02, 2020, 04.53 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi, Jun 2 () ", "Domestic air travel", " in the country is picking up the pace as 692 flights carrying 64,651 passengers operated on June 1 against 501 flights with 44,593 flyers the day before, Civil Aviation Minister ", "Hardeep Singh Puri", " said on Tuesday. Domestic services in India were suspended in March due to the ", "coronavirus", " lockdown and resumed on May 25. \n", "\n", "\"Jump in the number of flyers from 44,593 on 31 May to 64,651 on 1st June is a welcome sign that our domestic operations are picking pace. Departures 692,\" Puri said on ", "Twitter", ". \n", "\n", "Indian carriers operated a total of 4,062 flights till June 1 -- 428 on May 25, 445 on May 26, 460 on May 27, 494 on May 28, 513 on May 29, 529 on May 30, 501 on May 31 and 692 on June 1. \n", "\n", "During the pre-lockdown period, Indian airports handled around 3,000 daily ", "domestic flights", ", ", "aviation industry", " sources said. \n", "\n", " In February, around 4.12 lakh passengers travelled daily through domestic flights in India, according to ", "Directorate General of Civil Aviation", " (DGCA) data. \n", "\n", " Airports in West Bengal, Andhra Pradesh, Maharashtra, Telangana and Tamil Nadu have been allowed to handle a restricted number of daily flights as these states do not want a huge influx of flyers amid the rising number of COVID-19 cases. \n", "\n", " While domestic services resumed in Andhra Pradesh on May 26, they restarted in West Bengal two days later. International passenger flights continue to remain suspended in the country.\n"]], "tags": ["Hardeep Singh Puri", "Twitter", "directorate general of civil aviation", "domestic flights", "New Delhi Railway station", "coronavirus", "aviation industry", "domestic air travel"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["A320neo", "IndiGo", "goair", "DGCA"]},
{"heading": [["IndiGo to phase out 120 A320 ceos in 2 years; working with partners for better prices"]], "sub_heading": [["InterGlobe Aviation, the parent firm of IndiGo, reported a net loss of Rs 871 cr and won't dole out dividend."]], "time": [["Last Updated: Jun 02, 2020, 10.27 PM IST"]], "publisher": [["PTI"]], "article": [["IndiGo", " will phase out 120 A320 ceo planes, which have high maintenance costs, in the next two years as well as experiment with new network and revenue models as the country's largest domestic carrier tackles headwinds due to the ", "coronavirus", " pandemic.\n", "\n", "Keeping a close tab on various costs, the airline is also in discussions with partners for working out better prices and terms, senior officials said on Tuesday soon after it reported a net loss of Rs 871 crore in the three months ended March.\n", "\n", "\"We will be reducing our unit costs even further, making our fleet more efficient, ensuring our capacity is right sized to the market and experimenting with new network and revenue models,\" IndiGo CEO Ronojoy Dutta said in an earnings call.\n", "\n", "Amid the challenging environment, Dutta emphasised that in these times, the focus must shift from profitability and growth to managing cash and liquidity.\n", "\n", "\"To preserve cash, we are not looking to pay any dividend this year. We will continue to take steps to shore up our liquidity... We are in the process of revising full year capacity guidance,\" he said.\n", "\n", "Dutta said that 120 A320 ceos would be going out of the airline's fleet in the next two years and new neo aircraft would be taken.\n", "\n", "According to him, the maintenance costs for classic ceos are high and the airline is going to return them as rapidly as possible.\n", "\n", "At the end of March, IndiGo had 262 aircraft including 123 A320 ceos, 100 A320 neos, 14 A321 neos and 25 ATRs. It operated a peak of 1,674 daily flights, including international ones, during the March quarter.\n", "\n", "\"We are keeping a sharp eye on maintenance costs of ceos,\" he said, adding that the airline was in negotiations with suppliers for a fairly substantial cost reduction.\n", "\n", "IndiGo CFO ", "Aditya Pande", " said the company has taken various steps to reduce costs and improve liquidity.\n", "\n", "\"We are also looking to raise finance against unencumbered assets of IndiGo which could be additional source of liquidity,\" Pande said.\n", "\n", "There have been 5-25 per cent salary cut across the organisation, except for certain employees with lower pay grade and all merit-based salary increments have been deferred, among other measures, he added.\n", "\n", "\"We are looking at every element of cost and working with partners to work out better prices and terms... we have reached out to suppliers for favourable credit terms,\" he said and stressed that lease rentals were not being deferred.\n", "\n", "According to him, these measures would result in additional liquidity of Rs 3,000 to 4,000 crore over nine months.\n", "\n", "\"Around 40 per cent of the costs are fixed... within that we expect on a full year basis we will be able to save 25 per cent on our total employees costs. That is the goal we are working on,\" he noted.\n", "\n", "While noting that there is a lot of pent up demand, Dutta said, there is also a lot of dampening effect on revenue due to customer fear, weak economy and restrictions in various states. Corporate demand is also low.\n", "\n", "\"We are very anxious to start international flights,\" he said.\n", "\n", "To a query on possible consolidation in the domestic airline industry, Dutta said IndiGo has no plans for buying or selling.\n", "\n", "\"We don't want to buy any airline or sell our airline to anyone. What happens around us. I don't know, I don't want to speculate on that at all. We are clearly on go alone strategy,\" he said.\n", "\n", "About the airline, Dutta said it has a healthy balance sheet, energised workforce, efficient fleet, very strong cost position, strong market position in India and in neighbouring countries.\n", "\n", "Domestic flights resumed operations after two months on May 25, while international services still remain suspended amid the lockdown to curb spreading of coronavirus infections. \n", "\n"]], "tags": ["Aditya Pande", "indigo revenue model", "InterGlobe Aviation", "coronavirus", "IndiGo"]},
{"heading": [["90% passengers feel air travel safe mode of transport, says Bengaluru airport survey"]], "sub_heading": [["The higher safety perception associated with air travel and airports have been improving through the weeks owing to various safety measures implemented at the airport, says BIAL."]], "time": [["Last Updated: Jun 02, 2020, 05.14 PM IST"]], "publisher": [["ET Bureau"]], "article": [["BENGALURU: ", "Voice of Pax", ", a survey conducted by ", "Bangalore International Airport Limited", " (BIAL) to understand passenger perception and expectation on ", "air travel", " amid Covid-19 pandemic, has revealed 90% of passengers considered air travel much safer compared to the other modes.\n", "\n", " According to the findings, 87% participants also felt airports are safer compared to train and bus stations. The higher safety perception associated with air travel and airports have been improving through the weeks owing to various safety measures implemented at the airport, the BIAL said in a press release. \n", "\n", " The survey is being held in five phases. During the three concluded phases, more than 3500 passengers were covered using a systematic random sampling methodology, chosen from a database of over 150,000 previous passengers from across age, profession, group size, frequency of flying and sector of flying, the press release added.\n", "\n", " A fourth of the respondents said they intend to take a flight in the next one month after reopening. About 19% appeared to be undecided about their intent to travel. However, the comfort levels associated with air travel progressively increased to 24%, after the conclusion of the third phase. Work related travel was cited as the most important reason for their travel intent at 60%, while personal was the next at 30%.\n", "\n"]], "tags": ["Bangalore International Airport Limited", "lockdown", "Air travel", "voice of pax"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["airline companies", "coronavirus", "middle seat vacant", "aviation regulator", "DGCA"]},
{"heading": [["Keep middle seats vacant to extent possible: DGCA tells airlines"]], "sub_heading": [["However, if a flyer has been allotted the middle seat due to a high passenger load \"then additional protective equipment like wrap-around gown of the Ministry of Textile approved standards\" must be provided to that passenger in addition to three-layered face mask and face shield, said the DGCA order."]], "time": [["Last Updated: Jun 01, 2020, 08.25 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Aviation regulator ", "DGCA", " on Monday asked ", "airlines", " to keep ", "middle seats", " vacant to the extent possible in the wake of the ", "coronavirus", " outbreak.\n", "\n", "However, if a flyer has been allotted the middle seat due to a high passenger load, \"then additional protective equipment like wrap-around gown of the Ministry of Textile approved standards\" must be provided to him or her in addition to a three-layered face mask and face shield, a DGCA order, accessed by PTI, said.\n", "\n", "While hearing a petition on whether to keep middle seats in flights vacant or not, the Supreme Court on May 25 had said that the ", "Directorate General of Civil Aviation", " (DGCA) was free to alter its norms in the interest of public health and safety of passengers \"rather than of commercial considerations\".\n", "\n", "Citing the Supreme Court observation, the DGCA in its order on Monday said, \"The airlines shall allot the seats in such a manner that the middle seat/seat between two passengers is kept vacant if the passenger load and seat capacity permits the same.\"\n", "\n", "\"However, members of the same family may be allowed to sit together,\" it added. India resumed its domestic passenger flights from May 25 after a gap of two months due to the coronavirus-induced ", "lockdown", ".\n", "\n", "As the passenger load in flights has been around 50 per cent since May 25, airlines are unlikely to face much problem in complying with the DGCA order.\n", "\n", "For example, 44,593 passengers travelled in 501 domestic flights in India on Sunday, translating into an average of around 90 passengers in each plane.\n", "\n", "Since an average narrow body plane in India has 180 seats in 3*3 configuration, it means it has 60 middle seats and as many window and aisle seats, indicating that up to 120 passengers can be seated while keeping middle seats vacant.\n", "\n", "The DGCA order said airlines must provide a safety kit to each passenger. It shall include a three-layered surgical mask, a face shield and adequate amount of sanitiser in either a sachet or a bottle.\n", "\n", "\"The embarkation or disembarkation shall be sequential and passengers shall be advised by airlines to follow the instructions and not to rush to the entry or exit gate. The airline shall ensure orderly entry or exit of the passengers,\" the DGCA stated.\n", "\n", "Indian carriers operated a total of 3,370 flights till May 31 -- 428 on May 25, 445 on May 26, 460 on May 27, 494 on May 28, 513 on May 29 and 529 on May 30.\n", "\n", "International commercial passenger flights continue to remain suspended in the country.\n", "\n", "The novel coronavirus has infected more than 1.9 lakh people and killed around 5,300 people in India till now.\n", "\n", "When asked about the aforementioned DGCA order, Air India and IndiGo said they will adhere to all DGCA instructions and guidelines.\n", "\n", "\"We are complying with the DGCA order, by keeping the middle-seat free when load permits. We are also supplying appropriate personal protective equipment to our passengers and crew, to ensure a safe flying experience,” an IndiGo spokesperson said.\n", "\n", "A Vistara spokesperson said it is reviewing the DGCA order and will incorporate amendments.\n", "\n", "\"We continue to make every effort to ensure the health and safety of our customers and staff,\" the spokesperson said.\n", "\n"]], "tags": ["directorate general of civil aviation", "lockdown", "airlines", "coronavirus", "middle seats", "DGCA"]},
{"heading": [["Logistics costs set to rise as freighters hike tariffs"]], "sub_heading": [["Truckers have increased tariffs by up to 80%, said people aware of the matter. Blue Dart has implemented a 25% emergency situation surcharge (ESS). "]], "time": [["Last Updated: Apr 14, 2020, 11.12 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Mumbai: ", "Truckers", " and transporters are increasing prices by as much as 80% and ", "freighter", " operators are adding surcharges for transportation of goods as they grapple with regulatory challenges, shortage of manpower and a huge slump in supply.\n", "\n", "This will increase logistics costs for companies and likely in products as well, industry executives said.\n", "\n", "Truckers have increased tariffs by up to 80%, said people aware of the matter. Blue Dart has implemented a 25% emergency situation surcharge (ESS). Air India said it will increase freight charges by 90% per kilo if it doesn’t have sufficient cargo to ferry.\n", "\n", "“Truck rentals have shot up for essential items such as fruits and vegetables despite a waiver of toll fee, motor vehicle taxes and some other incentives such as deferment of EMIs on truck loans,” said SP Singh, a senior fellow at the Indian Foundation of ", "Transport", " Research and Training.\n", "\n", "Ashok Walunj, a director at the Agriculture Produce Market Committee in Maharashtra, said most truckers get to ferry cargo only one way and return with empty trucks. He said the increase in Maharashtra is only 20%.\n", "\n", "Manpower shortage is another reason. Up to 1.5 million of 5 million truck drivers in India are not coming to work.\n", "\n", "Last week, India’s transport ministry officials had a meeting with trucking associations to take stock of their problems. Among other things, transporters have demanded that truckers who have to drive in these conditions should be given an insurance cover of over Rs 25 lakh, said Bal Malkit Singh, a senior member of All India Motor Transport Congress, a lobbying body. \n", "\n", "On Sunday, a directive from the home ministry said all transport of essential and non-essential goods should be allowed unhindered if the driver has a licence; empty trucks should be allowed to pass; local authorities should facilitate the movement of workers from their homes to hubs and vehicles; MSMEs dealing in essential items should be allowed to function without any obstacle and so should warehouse and cold storage facilities.\n", "\n", "SR Sharda, executive director at logistics company Safexpress, said while this increase will taper off once the lockdown curbs are eased, it will still increase logistics costs by 25%, likely leading to an increase in prices of essentials.\n", "\n", "“Even after the lockdown is lifted, we will be grappling with limited manpower, short supply due to lower production in factories and lower demand due to an overall negative sentiment and slowdown,” he said.\n", "\n", "The 21-day countrywide lockdown implemented by the government on March 25 created a logjam of vehicles across the country. Most transporters were stopped by the police and were unable to ship essentials. This led to a temporary shutdown of warehouses.\n", "\n", "A directive from the home ministry eased the problems for transporters to an extent. But logistics companies continue to face issues, especially in transporting to states such as Punjab and Uttar Pradesh, said Abhik Mittra, managing director of Spoton Logistics.\n", "\n", "A spokesperson at Blue Dart confirmed it is levying an ESS fee of 25% for its contracted customers. On the retail desk, however, it is offering a 25% discount, he said, adding this would benefit smaller companies, including those making masks and personal protective equipment.\n", "\n", "State-run carrier Air India, which is ferrying essentials across the country and from China, said it would increase its per kilo tariff to Rs 475 from Rs 250 for freighter flights from Hong Kong and Shanghai if there was insufficient cargo.\n", "\n", "\n", "\n"]], "tags": ["Logistics Cost", "Indian Foundation of Transport Research", "freighter", "transport", "Truckers"]},
{"heading": [["Turbulence ahead: Middle seat muddle gets a new wrap"]], "sub_heading": [["The muddle over the middle seat got more complicated as the Directorate General of Civil Aviation ordered airlines to either try and keep middle seats vacant or, insist that middle seat passengers wear ‘wraparound gowns’ apart from other protective gear. Making the exercise even more muddled is the requirement that those gowns meet textile ministry standards."]], "time": [["Last Updated: Jun 02, 2020, 07.35 AM IST"]], "publisher": [["ET Bureau"]], "article": [["Welcome aboard on Flight XYZ of ABC Air… those on window and aisle seats please proceed, those on middle seats please wait for the in-flight crew to check your wraparound gowns. Strange? Yes. But may soon be true.\n", "\n", "The muddle over the ", "middle seat", " got more complicated as ", "the Directorate General of Civil Aviation", " (", "DGCA", ") ordered airlines to either try and keep middle seats vacant or, insist that middle seat passengers wear ‘wraparound gowns’ apart from other protective gear. Making the exercise even more muddled is the requirement that those gowns meet textile ministry standards.\n", "\n", "“If middle seat/seat between two passengers is occupied due to passenger load, then ", "additional protective equipment", " like ‘wraparound gown’ (ministry of textiles-approved standards) shall be provided to the individual... in addition to... three-layer face mask and face shield,” the order read.\n", "\n", "\n", "\n", "\n", "Airlines are not pleased, to say the least. Speaking off record, executives said these orders are designed more to make the DGCA look good than passengers safer. “It is a completely illogical diktat for optics. Nowhere else in the world do they require such a thing. Do they have any data that suggests middle seat passengers are more exposed or getting infected?” said an airline insider, who did not want to be identified. \n", "\n", "“It is pretty sloppy thinking,” said another executive of an airline on the condition of anonymity.\n", "\n", "These orders came in the wake of a ", "Supreme Court", " ruling that ordered airlines to keep middle seats vacant on the next lot of flights that are bringing back Indians stranded abroad, starting June 6.\n", "\n", "The aviation regulator, which had asked airlines in March to keep middle seats vacant in flights, allowed middle seat occupancy when flights resumed in May.\n", "\n", "\n", "\n", "Airlines were allowed to allot middle seats after authorities concluded that it is difficult to maintain social distancing (of at least six feet) between passengers inside the aircraft. Another argument was that in-flight air-conditioning cleans interior air every two to three minutes, making the spread of virus difficult. However, there may be hope down the line. Senior officials said the court order on keeping middle seats empty was on the basis of facts presented by the petitioner. “The government will contest the order and present before court accurate facts in the next hearing,” said an official, off record. Till that happens, get ready to don the gown.\n", "\n"]], "tags": ["middle seat", "Supreme Court", "The Directorate General of Civil Aviation", "additional protective equipment", "DGCA"]},
{"heading": [["Middle seat PIL: HC asks Centre, DGCA on infected pax data"]], "sub_heading": [["Solicitor General Tushar Mehta and Additional Solicitor General Anil Singh told the court DGCA had issued a circular on May 31 asking air carriers to try to keep the middle seat on flights vacant and provide \"wraparound gowns\" to passengers who are allotted such seats. "]], "time": [["Last Updated: Jun 02, 2020, 07.48 PM IST"]], "publisher": [["PTI"]], "article": [["Mumbai: ", "The Bombay High Court", " on Tuesday sought to know from the Union government and the Directorate General of Civil Aviation if it has any data on persons who traveled amid the ", "COVID-19 lockdown", ", tested negative before the travel and then were found infected with the virus. A division bench of Justices S J Kathawalla and S P Tavade was hearing a petition filed by an ", "Air India pilot", ", Deven Kanani, who claimed the airline was not keeping the middle seat vacant in flights bringing back stranded people to India. \n", "\n", "Solicitor General Tushar Mehta and Additional Solicitor General Anil Singh told the court ", "DGCA", " had issued a circular on May 31 asking air carriers to try to keep the middle seat on flights vacant and provide \"wraparound gowns\" to passengers who are allotted such seats. \n", "\n", "The bench then posed a query and asked if there was any case where a passenger, who was not infected by the virus, travelled by air and was later found positive. \n", "\n", "The court posted the matter for further hearing on Thursday. \n", "\n", "As per the plea, ", "Air India", " was in violation of the guidelines laid down in a circular dated March 23 issued by the Centre to prevent spread of COVID-19. \n", "\n", "Air India's counsel ", "Abhinav Chandrachud", " had last week told the court the March 23 circular was superseded with a new circular issued by the government on May 22 while permitting domestic flights to operate from May 25. \n", "\n", "Chandrachud had said the new circular does not say that the middle seat needs to be kept empty. \n", "\n", "The high court had last week, however, noted that the May 25 circular, prima facie, applied to the domestic flights and not the Vande Bharat international flights operated by Air India. \n", "\n", "The high court had then directed Air India and DGCA to clarify its stand. \n", "\n", "Air India later approached the Supreme Court which, while allowing the national carrier to keep operating its scheduled flights with the middle seats filled till June 5, observed that the government should be more worried about the health of the citizens than the health of commercial airlines.\n"]], "tags": ["middle seat in flight", "Air India", "Air India pilot", "abhinav chandrachud", "Mumbai High Court", "The Bombay High Court", "DGCA"]},
{"heading": [["TVS arm deploys 1,000 ‘corona warriors’ to transport essentials"]], "sub_heading": [["​​The company is currently operating from 65 locations across the country (covering almost every State) and has deployed over 1000 ‘Corona Warriors’ (employees and drivers engaged in the lockdown time) supporting the logistics activities. The execution team is provided with ‘Covid Kavach’ - a protective PPE kit besides fully trained to maintain social distancing norms."]], "time": [["Last Updated: Apr 15, 2020, 10.55 PM IST"]], "publisher": [["ET Bureau"]], "article": [["TVS Supply Chain Solutions, a end-to-end Supply ", "Chain Management Services", " company and part of the $8.5 bn TVS group, is engaging with its customers to manage the movement of essential services and goods during this nationwide ", "lockdown", ". \n", "\n", "The company is currently operating from 65 locations across the country (covering almost every State) and has deployed over 1000 ‘", "Corona Warriors", "’ (employees and drivers engaged in the lockdown time) supporting the logistics activities. The execution team is provided with ‘", "Covid", " Kavach’ - a protective ", "PPE", " kit besides fully trained to maintain social distancing norms.\n", "\n", "TVS SCS", " is already working with the Government of Karnataka in managing health care equipment services and spares- in all Primary Health Centers, ", "Community Health Centers", ", Taluk, District and Government Hospitals. This covers critical healthcare equipment including ICU equipment and ventilators. \n", "\n", "The company is also closely engaging with other state governments and private health care organizations to replicate these services. TVS SCS is also closely working with organisations for importing the PPE kits into India that are required by the healthcare sector as well as the organisations who are procuring these in large numbers.\n", "\n", "Says, R. Shankar, CEO, TVS Supply Chain Solutions, India, “During this critical lockdown period, we are proactively reaching out to organisations who are dealing with food, drug and other essential commodities to be able to meet their immediate logistics demands including transportation. We are leveraging our technology enabled control tower’s assistance to monitor and manage vehicles for inter and intra state movements with the least hurdles. Besides, the ‘Covid Kavach’ – a PPE kit - instils confidence to drivers and others in the entire ecosystem to be able to engage safely and provide the most critical service to customers across the length and breadth of the country without any interruption. \n", "\n", "Shankar further added, “Being a specialised provider in first mile and last mile connectivity, we are working with a few ventilator manufacturers to be able to manage their inbound and outbound supply chain. On the other hand, TVS SCS through its global sourcing capabilities, is procuring PPE Kits from Asian markets to send it to our Global customers. We have already started importing these kits for Indian customers.” \n", "\n"]], "tags": ["covid", "PPE", "corona warriors", "tvs scs", "chain management services", "lockdown", "community health centers"]},
{"heading": [["Logistics sector to lose Rs 50,000 crore due to lockdown; relief package needed: Industry body ICC"]], "sub_heading": [["\"With the lockdown extended to May 3, the cumulative loss estimate is as high as Rs 50,000 crores with the highest loss coming from the Aviation Sector, followed by the Roadways, in terms of lost Toll Taxes and Goods wasted on the road due to a sudden lockdown, grinding to a halt fully loaded trucks,\" ICC said. "]], "time": [["Last Updated: Apr 16, 2020, 08.46 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Estimating losses to the logistics sector at about Rs 50,000 crore due to the coronavirus lockdown, industry body ", "ICC", " on Thursday demanded a relief package for the industry, including priority lending and lower taxes. The growing logistics sector in India is looking at mounting losses, with the ", "aviation", " sector taking the biggest hit, the ", "Indian Chamber of Commerce", " (ICC) said in a statement. \n", "\n", " \"With the lockdown extended to May 3, the cumulative loss estimate is as high as Rs 50,000 crores with the highest loss coming from the Aviation Sector, followed by the Roadways, in terms of lost Toll Taxes and Goods wasted on the road due to a sudden lockdown, grinding to a halt fully loaded trucks,\" ICC said. \n", "\n", " Though the government has allowed movement of both essential and non-essential goods, the situation is not so easy at the ground level, it said. ", "Container", " freight stations, inland container depots, warehouses and port terminals, which are all notified as essential services, are getting choked due to slow evacuation of containers and cargo, it added. \n", "\n", " \"Moreover quarantining of ships for 2 weeks at high seas with delayed berthing is also adding to the chaos. Given the capital intensive nature of the industry, the standing cost of assets is very high, running into crores of rupees. A lifeline needs to be extended to the industry,\" the chamber said. \n", "\n", " It sought relief measures like digital permits and packaged food service from NHAI for drivers after every 50 kms and complete waiver of ", "EMI", " obligations for at least 6 months till earnings normalise. \n", "\n", " Demanding treatment of logistics industry as priority sector for lending -- sanctioned soft loans and existing loans be rolled over at a lower rate, it also stressed the need for auto renewal of national movement permits till September 2020. \n", "\n", " Besides, it sought a reduction in GST for the sector to lower than 12 per cent and waiver of revenue share and lease rental payable by PPP operators to government partners till September 2020 as well as waiver of minimum performance obligations of private operators till September 2020. \n", "\n", " ICC also stressed the need for a government-sponsored health insurance cover for all employees of the sector and extension of construction period of ongoing PPP projects by 6 months to 1 year, besides allowing of GST input credit for such projects.\n"]], "tags": ["Container", "emi", "ICC", "Aviation", "Indian Chamber of Commerce"]},
{"heading": [["NHAI constructs 4,000 km roads in FY20, its highest ever"]], "sub_heading": [["The construction pace as noticed in last years has seen a steady growth with 3,380 Km construction in the FY 2018-19, the authority said. "]], "time": [["Last Updated: Apr 07, 2020, 10.48 AM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW ", "DELHI", ": The ", "National Highways Authority of India", " (NHAI) has constructed close to 4,000 km of roads in FY20, its highest ever ", "construction", " in a single fiscal, a government statement said on Monday. “NHAI has accomplished construction of 3,979 km of national ", "highways", " in the financial Year 2019-20,” the authority said in a statement. \n", "\n", "The construction pace as noticed in last years has seen a steady growth with 3,380 Km construction in the FY 2018-19, the authority said. “Continuing the same trend with the development of 3,979 km of national highways during FY 2019-20, NHAI has achieved an all-time high construction since its inception in 1995,” it added.\n", "\n"]], "tags": ["National Highways Authority of India", "infrastructure", "construction", "highways", "Delhi"]},
{"heading": [["Transport ministry meets truckers to resolve issues"]], "sub_heading": [["Transport minister Nitin Gadkari had asked officers earlier this week to reach out to truckers. India has been under a nationwide lockdown since March 25 to curb the spread of the Covid-19 outbreak."]], "time": [["Last Updated: Apr 10, 2020, 11.40 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The ", "transport ministry", " held a review meeting with trucker associations in the country on Friday to take stock of problems faced in moving goods across the country during the lockdown. Transport minister ", "Nitin Gadkari", " had asked officers earlier this week to reach out to ", "truckers", ". India has been under a nationwide ", "lockdown", " since March 25 to curb the spread of the ", "Covid-19 outbreak", ".\n", "\n", "“We wanted to understand their concerns and are working to see that their movement is facilitated,” a transport ministry official told ET.\n", "\n", "Transport associations have demanded that the government should help build confidence among drivers to come back to work and ensure this through publicity in the media, said a person present at the meeting.\n", "\n", "Meanwhile, truck associations have also demanded that the government should extend Rs 25-50 lakh insurance to drivers affected by Covid-19. “We have received an in-principle approval from the government and we are expecting an announcement on the same any time now,” the person said.\n", "\n", "ET reported on April 7 that only 10-15% of the 8 million truck fleet was operational at the moment, which has affected the movement of essential commodities.\n", "\n"]], "tags": ["Transport ministry", "Nitin gadkari", "lockdown", "Truckers"]},
{"heading": [["NHAI looks to restart 50-60% projects"]], "sub_heading": [["Officials said work is likely to restart on highways and expressways where labour is stationed in camps at project sites. They said these projects may include the Delhi-Mumbai Expressway, which is likely to get permission from the local administrations in Haryana and Rajasthan by this week."]], "time": [["Last Updated: Apr 16, 2020, 11.18 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["The ", "National Highways Authority of India", " (NHAI) is looking to resume construction work by next week on 50-60% of the big-ticket highway projects that were stalled due the Covid-induced nationwide lockdown. Officials said work is likely to restart on highways and expressways where ", "labour", " is stationed in camps at project sites.\n", "\n", "They said these projects may include the Delhi-Mumbai ", "Expressway", ", which is likely to get permission from the local administrations in Haryana and Rajasthan by this week.\n", "\n", "The other corridors where work is expected to resume include the Amritsar-Jamnagar Expressway,Dwarka Expressway, and Trans Haryana North-South Expressway. \n", "\n", "“Around 50-60% of projects should resume next week onwards,” a government official told ET. “So far as availability of labour is concerned, we have them available at project sites.... steel plants, refineries are running, so there should be no concern on raw material.” \n", "\n", "Since some cement plants have stopped operations in the lockdown period, there can be a shortage going forward. But, the official said, there are enough stocks in the pipeline and on project sites for work to resume. \n", "\n", "Market watchers ET spoke with said the government must prioritise projects that are linked with industrial clusters to ensure efficient management of the supply chain. \n", "\n", "“Two key areas where the government should look at while restarting work on highway projects is, first, how economically important the project is and, second, whether labourers are present at the project site,” said Arindam Guha, partner and lead-government and public sector at Deloitte India.\n", "\n", " \n", "\n", "Once the cement manufacturing companies see an uptick in construction activity, they should also get back in action, and availability of raw material should not be a concern, Guha said. \n", "\n", "The guidelines issued by the home ministry on Wednesday allow work to resume on construction projects within the limits of municipal corporations and municipalities where workers are available on site and no workers are required to be brought in from outside. \n", "\n", "ET was the first to report on April 8 that the road construction sector was likely to get a breather, with the government planning to allow construction activity to resume at large project sites post April 14. \n", "\n", "The government is banking on infrastructure projects to kick-start the economic activity in the country.\n", "\n", "“We also need to see that contractors are lying idle, we will try and get a maximum number of projects going,” the official quoted above said. \n", "\n", "There is also an urgency to resume road construction work given that road repairs and construction can not be done during the monsoon season that lasts from June to September in the country.\n", "\n", "\n"]], "tags": ["National Highways Authority of India", "mumbai", "Expressway", "Dwarka", "Delhi", "labour"]},
{"heading": [["NHAI likely to compensate toll operators for losses due to suspension of toll charges"]], "sub_heading": [["The government is considering to compensate toll operators for the losses incurred in the wake of suspension of toll charges on national highways, an official said on Tuesday."]], "time": [["Last Updated: Apr 14, 2020, 10.29 PM IST"]], "publisher": [["PTI"]], "article": [["The government is considering to compensate ", "toll", " operators for the losses incurred in the wake of suspension of toll charges on national highways, an official said on Tuesday. The government on March 25 had temporarily suspended toll collections on national highways to ease emergency services in view of the coronavirus outbreak. \n", "\n", "\"NHAI (National ", "Highways Authority of India", ") is likely to make payments to toll operators for the losses incurred during the period,\" an official said. \n", "\n", "Road Transport and Highways Minister ", "Nitin Gadkari", " said that the NHAI may be directed to compensate the losses incurred. \n", "\n", "\"In view of COVID-19, it has been ordered to temporarily suspend the collection of toll at all toll plazas across India,\" Road Transport and Highways Gadkari had announced last month. \n", "\n", "This will not only reduce inconvenience to emergency services but also save critical time, the minister has said. \n", "\n", "The NHAI had rolled out the ", "electronic toll collection", " programme across India in December on its over 500 toll plazas while doubling toll charges from the vehicles entering ", "FASTag", " lanes without the tag. \n", "\n", "In order to give prime importance to existing FASTag users, dissuade defaulters and further encourage adoption of FASTags by national highway commuters, vehicles without FASTags entering the FASTag lane were being charged double the toll fee, and last month over Rs 20 crore were collected from 20 lakh vehicles encroaching FASTag lanes across India. \n", "\n", "About two crore FASTags have been issued through multiple Point of Sale (PoS) locations. FASTag transaction by the NHAI last month had crossed four million per day. \n", "\n", "In order to further increase digital collection of user fee via FASTag at national highways fee plazas, NHAI had also waived off the FASTag cost of Rs 100 for NHAI FASTag. \n", "\n", "Rating agency ", "ICRA", " had earlier said that amid the nationwide lockdown on account of coronavirus outbreak, the toll collection on national highways will see a dip of about 3 per cent in the current fiscal.\n"]], "tags": ["electronic toll collection", "Highways Authority of India", "Nitin gadkari", "icra", "FASTag", "toll"]},
{"heading": [["Covid-19: NHAI to stop collecting toll across national highways during lockdown"]], "sub_heading": [["In a letter issued to NHAI, the ministry of road transport and highways said  that “commercial and private establishments shall be closed down for a period of 21 days with effect from  March 25 for containment of Covid-19 epidemic in the country,” further asking the authority to therefore comply with the orders."]], "time": [["Last Updated: Mar 25, 2020, 09.54 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The ", "National Highways Authority of India", " (NHAI) will stop toll collecting toll across National highways in the country during the 21 days' nationwide ", "lockdown", " announced on Tuesday owing to the Covid-19 outbreak. \n", "\n", "The move comes after the authority sought opinion from the ministry of road transport and highways in this regard on Wednesday. \n", "\n", "In a letter issued to NHAI on Wednesday evening, the ministry of road transport and highways said that the ", "Ministry of Home Affairs", "’ order on March 24 stated that “commercial and private establishments shall be closed down for a period of 21 days with effect from 25.03.2020 for containment of Covid-19 epidemic in the country,” further asking the authority to therefore comply with the orders.\n", "\n", "ET reported on March 25 that toll collection across around 530 toll plazas on National highways in the country had halved in just the past week. \n", "\n", "Several parts of the country had been gradually locking down over the last week as Covid-19 cases rose in the country. \n", "\n", "Prime Minister ", "Narendra Modi", " in his address to the country on Tuesday announced a nationwide lockdown for 21 days beginning March 25, even as essential services were allowed to operate. \n", "\n", "The directive from the Ministry of Home Affairs issued soon after the PM’s address said that all transport services including rail, road, and air, would remain suspended during the period of lockdown. Transportation of essential goods, fire, law and order, and emergency services were exempted. \n", "\n", "In some cases, where toll is operated by a private player, the government will have to compensate the loss of revenue to operators, as Covid-19 can classify under the force majeure clause of concession or contract agreement as per rules laid by Finance Ministry, which essentially saves the performing party from the consequences of events beyond their control. \n", "\n"]], "tags": ["National Highways Authority of India", "Narendra Modi", "covid", "lockdown", "ministry of home affairs"]},
{"heading": [["Truckers: Ease movement else we'll stop operations"]], "sub_heading": [["A leading transporters association has written to transport minister Nitin Gadkari, saying its members may stop operating if the authorities do not facilitate the movement of drivers and trucks during the nationwide lockdown imposed to battle the Covid-19 outbreak."]], "time": [["Last Updated: Apr 24, 2020, 07.37 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: A leading transporters association has written to ", "transport minister", " Nitin Gadkari, saying its members may stop operating if the authorities do not facilitate the movement of drivers and trucks during the nationwide ", "lockdown", " imposed to battle the ", "Covid-19 outbreak", ".\n", "\n", "The ground reality is not in consonance with the guidelines issued by the ministry of home affairs for partial lifting of the lockdown from April 20, which is thwarting the movement of trucks and drivers, the All Indian Transporters’ Welfare Association said in the letter to Gadkari. “The supply chain can never become live in the present state of affairs,” AITWA national president Mahendra Arya said in the letter, reviewed by ET.\n", "\n", "The association pointed out that all states were interpreting the relaxation guidelines in their own way and there are no common practices or protocols being followed.\n", "\n"]], "tags": ["Nitin gadkari", "Transport Association", "lockdown", "Transport minister"]},
{"heading": [["World’s biggest lockdown brings trucks to a standstill"]], "sub_heading": [["Daily movement of trucks has collapsed to less than 10% of normal levels, according to All India Motor Transport Congress, an umbrella body of goods vehicle operators representing about 10 million truckers. Road transport accounts for about 60% of freight traffic in India and 87% of its passenger traffic, according to Road ministry."]], "time": [["Last Updated: Apr 07, 2020, 01.13 PM IST"]], "publisher": [["Bloomberg"]], "article": [["\n", "\n", "The world’s biggest ", "lockdown", " has brought transportation of goods in India to a near halt, even though the central government has exempted the sector from restrictions to halt the spread of ", "coronavirus", ".\n", "\n", "Daily movement of ", "trucks", " has collapsed to less than 10% of normal levels, according to All India Motor Transport Congress, an umbrella body of goods vehicle operators representing about 10 million truckers. Road transport accounts for about 60% of freight traffic in India and 87% of its passenger traffic, according to the Ministry of Road Transport and Highways.\n", "\n", "Trucking has emerged as a major choke-point in global supply chains for everything from food to medical supplies as governments take stringent steps to contain the pandemic, restricting the movement of vehicles and people to drive them. The collapse in India, where Prime Minister Narendra Modi imposed a three-week lockdown on the nation’s 1.3 billion people March 25, is a harbinger of the damage the measures are wreaking on the economy amid forecasts the country could see its first contraction in at least two decades.\n", "\n", "“Though the government has allowed movement of both essential and non-essential goods, the situation is very different at the ground level,” said Naveen Kumar Gupta, secretary general of AIMTC, the largest grouping of transporters in India.\n", "\n", "The transport of goods by road was included as one of the essential services exempt from restrictions but the government is making frequent clarifications, causing confusion on the ground, according to the organization’s president, Kultaran Singh Atwal. That’s just made worse by the time it takes for the latest directives to trickle down to officials enforcing the rules, he said.\n", "\n", "One haulage company that’s a member of AIMTC had 20 trucks stranded in northern India, according to Gupta. Officials were stopping the vehicles at every checkpoint just a few kilometers apart. They were only allowed to cross the provincial border when the owner went to see the officials in person and showed them several government circulars and notifications, he said.\n", "\n", "A spokesman for the transport ministry couldn’t immediately comment.\n", "\n", "There are some signs of improvement, though. The movement of trucks at ports is easing after efforts taken to restore operations and maintain critical cargo shipments, Gupta said. Traffic to and from ports is about 50% of normal levels, he said, though labour constraints could be a future setback.\n", "\n", "The decline in road transport is another major major drain on fuel demand in the world’s third biggest oil market, which has already been hit by the collapse in air travel. Diesel and gasoline sales in March by India’s three biggest state-run fuel retailers shrank by an estimated 26% and 17%, respectively, and the lockdown only came into effect at the end of the month. Jet fuel sales plunged 33%.\n", "\n", "Limited freight activities will drag diesel demand to a 15-year low of 680,000 barrels per day in April, according to Senthil Kumaran, an oil markets consultant at Facts Global Energy. “The nationwide lockdown has completely halted industrial activities, thereby resulting in a sharp pullback in freight movements country-wide,” he said.\n", "\n", "One of the major problems facing truckers is loading and unloading because of a shortage of labour, according to AIMTC. And with the lockdown shutting highway food establishments and workshops, truckers can’t get the services they need even if they are on the road.\n", "\n", "“So, even if you allow movement of goods, the supply chain cannot be restored to full normalcy,” Gupta said. “Piecemeal opening of supply chain will not work.”\n", "\n", "\n", "\n", "\n", "\n"]], "tags": ["coronavirus impact on goods transportation", "lockdown", "coronavirus news", "coronavirus", "trucks", "india lockdown"]},
{"heading": [["Road developers to incur Rs 3,700 cr toll revenue losses in Mar-Jun: Crisil"]], "sub_heading": [["Crisil said the extended lockdown to contain the COVID-19 pandemic, which has stalled traffic on the ground as in the air, is expected to heap enormous losses on infrastructure industries but roads and highways would rebound faster despite sharp losses this quarter. "]], "time": [["Last Updated: May 07, 2020, 02.58 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Highway developers", " and toll operators are likely to incur toll revenue losses of about Rs 3,700 crore during March-June this year, while ", "NHAI", " will lose Rs 2,200 crore in toll fee, ", "Crisil Research", " said on Thursday. However, it said that the road and highways sector would rebound faster despite sharp losses this quarter. \n", "\n", "\"On its part, the roads and highways sector will see developers/ toll operators incurring toll revenue losses of Rs 3,450-3,700 crore during March-June, the estimate suggests. The ", "National Highways Authority of India", " (NHAI) will lose Rs 2,100-2,200 crore in toll over this period,\" Crisil Infrastructure Advisory said during a tele-conference on \"Impact of the Pandemic on the Transport Sector and Mitigants thereof\". \n", "\n", "It said the extended lockdown to contain the ", "COVID-19 pandemic", ", which has stalled traffic on the ground as in the air, is expected to heap enormous losses on infrastructure industries but roads and highways would rebound faster despite sharp losses this quarter. \n", "\n", "The agency said NHAI had planned to raise Rs 80,000-85,000 crore through fiscal 2025 by monetising 6,000 km of operational public-funded ", "toll roads", ". \n", "\n", "\"This asset monetisation programme through toll-operate-transfer and infrastructure investment trusts will likely take a hit,\" Crisil said. \n", "\n", " In addition to the loss in toll revenue, stakeholders will suffer losses on account of accrued interest, increase in costs of under-construction projects, time overruns, and rise in disputes between private sector and the government authorities. \n", "\n", "\"Tolling operations resumed on April 20 and construction on select projects has also restarted. Going forward, the ramp-up in traffic, availability of labour and raw materials for construction, and expeditious dispute resolution will be the key monitorables. \n", "\n", "\"In addition, road authorities such as the NHAI will have to step up initiatives beyond conventional avenues such as development of way-side amenities and formation of special purpose vehicles/ joint ventures for both, financing and revenues,\" Akshay Purkayastha, Director, Transport & Logistics, Crisil Infrastructure Advisory, said.\n"]], "tags": ["National Highways Authority of India", "nhai", "transport & logistics", "toll roads", "highway developers", "Crisil Research"]},
{"heading": [["AirAsia India cuts pilots' salary by 40% for May, Jun"]], "sub_heading": [["The senior management at AirAsia India had taken a pay cut of 20 per cent in April, while the wages of executives falling in other categories were reduced between 7-17 per cent."]], "time": [["Last Updated: Jun 02, 2020, 07.50 PM IST"]], "publisher": [["PTI"]], "article": [["MUMBAI: ", "AirAsia", " India has slashed salary of its ", "pilots", " by an average 40 per cent for May and June, an airline source said.\n", "\n", "However, the quantum of reduction in pay for other categories and senior management remains at the April level, he said.\n", "\n", "The senior management at AirAsia India had taken a pay cut of 20 per cent in April, while the wages of executives falling in other categories were reduced between 7-17 per cent.\n", "\n", "However, employees getting a salary of Rs 50,000 per month or less were spared of the move.\n", "\n", "The Tata-SIA joint venture carrier, which will be completing six years of operations next week, has a workforce of around 2,500 people.\n", "\n", "As many as 600 of them are pilots for its 30 ", "Airbus", " A320 aircraft fleet.\n", "\n", "\"Earlier a pilot was being paid for a fixed 70 hours irrespective of flying or no flying, which has now been reduced to 20 hours. This way, the average salary of a first officer (junior pilot) has come down to Rs 40,000 per month from 1.40 lakh, and that of a captain (senior pilot) to Rs 1 lakh from 3.45 lakh,\" the source told PTI.\n", "\n", "The reduction in pay accounts for 40 per cent of the total average salary of a pilot, he said.\n", "\n", "Responding to a PTI query on the issue, an AirAsia India spokesperson said, \"We do not comment on the internal matters pertaining to the company.\"\n", "\n", "The source also said that the airline has deferred its plans to induct any new plane in the fleet for the time being.\n", "\n", "Earlier, AirAsia India had plans to take delivery of five more A320 through March next year, he said.\n", "\n", "\"The airline's assessment is that the sector may take about two years to recover fully and domestic players are unlikely to expand network in the short-to-medium term in view of the demand. In this situation, fleet expansion will not serve any purpose in the next couple of quarters,\" the source said.\n", "\n", "Global aviation consultancy CAPA, in its last report, had estimated domestic traffic at 55-70 million and international air traffic demand at 20-27 million for the current fiscal.\n", "\n", "AirAsia India is currently utilising only about 50 per cent of the total capacity (30 planes), and even if there is a surge in demand, the existing capacity should be able to cater to the traffic, the source said.\n", "\n", "CAPA in its report had also said that Indian carriers would need to realign their fleet deployment plans with the expected levels of demand, and estimated that airlines would be operating around 265-300 aircraft in the domestic market and 80-95 aircraft on international routes in the second half of the current financial year. \n", "\n"]], "tags": ["Pilots", "airbus", "covid impact", "lockdown", "AirAsia"]},
{"heading": [["Road contractors may get more time for project execution: Ministry"]], "sub_heading": [["The highway ministry is examining the issue faced by the contractors and could unveil steps for their resolution soon, two senior officials told ET. Toll road operators will also be compensated for loss of business on account of fall in traffic and toll exemption, they said. "]], "time": [["Last Updated: May 07, 2020, 11.31 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Road ", "project contractors", " are likely to get an extension of project execution timelines, compensation for loss of business, and speedier payments to boost their liquidity flow as part of a Covid-19 relief package. \n", "\n", "The highway ministry is examining the issue faced by the contractors and could unveil steps for their resolution soon, two senior officials told ET. Toll road operators will also be compensated for loss of business on account of fall in traffic and toll exemption, they said. \n", "\n", "The government is looking at unveiling sector-specific relief measures for industries hit hard by the Covid-19 outbreak. “For ongoing projects, we will look at extension of contract period,” one of the officials said. \n", "\n", "\n", "\n", "\n", "The extension will be equal to the duration of the time when business activity was not allowed due to the mini-pandemic. The ministry is also reworking the payment mechanism for contractors to ease their liquidity flow. “We are looking at tweaking the payment cycles, making them shorter,” one of the officials said. \n", "\n", "“This will ensure that the smaller contractors also get paid.\" Vinayak Chatterjee, chairman of infrastructure service firm Feedback Infra, said the release of payments “will have to be far faster than earlier”. “The sector will be looking for liquidity, which would mean quicker dispute resolution and arbitration payouts,” he said. \n", "\n", "\n", "\n", "\n", "India has been under ", "lockdown", " since March 25. While construction activity was allowed to resume in most districts outside ", "pandemic", " hotspots, contractors have informed the ministry and the ", "highways", " building authority that the ‘force majeure’ clause in their contract needs to be invoked under the current circumstances. \n", "\n", "Timeline extension of projects is provided for under this clause. A final estimate of the claims that will have to be borne by the ", "National Highways Authority of India", " (", "NHAI", ") in terms of costs of idling, and delay in projects, is being worked out, the officials said. \n", "\n", "For toll ", "roads", " under build-operate-transfer contracts, NHAI is likely to bear a loss of around `1,000 crore, ratings agency ICRA said in a recent assessment. Toll operations remained suspended from March 25 to April 19, meaning additional claims for the authority.\n", "\n"]], "tags": ["roads", "highways", "project contractors", "National Highways Authority of India", "nhai", "lockdown", "pandemic"]},
{"heading": [["FASTag technology ensuring safety during COVID-19 times: NHAI"]], "sub_heading": [["New Delhi, May 11 () FASTag, an inclusive technological tool for toll collection on highways, is ensuring safety of commuters during COVID-19 times, the NHAI said on Monday."]], "time": [["Last Updated: May 11, 2020, 07.58 PM IST"]], "publisher": [["PTI"]], "article": [["FASTag, an inclusive technological tool for toll collection on ", "highways", ", is ensuring safety of commuters during COVID-19 times, the NHAI said on Monday. A total of 1.68 crore FASTags have been issued across the country till the beginning of May 2020. \n", "\n", "FASTags not only prove useful now but would be more practical and beneficial in the coming times post COVID-19 lockdown, the ", "National Highways Authority of India", " (NHAI) said in a statement. \n", "\n", "FASTag employs Radio Frequency Identification (RFID) ", "technology", " for making toll payments on national highways directly from the prepaid or savings account linked to it. A prepaid tag, fixed on vehicles' windscreen, allows automated deduction of toll charges, and lets any vehicle pass through a toll plaza with zero human contact. \n", "\n", "Movement of all essential goods and services takes place majorly through the road networks of the country. \n", "\n", "\"As India is gearing up for a life post the COVID-19 induced lockdown phase, the NHAI foresees an increase of commercial and private vehicles on national highways in the coming days. This will increase the chances of coronavirus spread,\" it said. \n", "\n", " In such a scenario, the NHAI recommends that FASTags should be the preferred mode of toll payments as it is the safest mode for toll transactions on national highways. \n", "\n", " It's a technological boon that can help us all bring the lives and economy back on track in such turbulent times without ever compromising on our health and safety, the NHAI said. \n", "\n", "As the nation and its scientific community are celebrating the National Technology Day today, there should be mention of this technological innovation that has changed our lives for better - FASTag, an ", "electronic toll collection", " (ETC) system in India which is operated by the NHAI. \n", "\n", " It said FASTag has been instrumental not only in ensuring smooth flow of vehicles on National Highways but also proved to be the safest mode of paying toll charges considering the COVID-19 outbreak. \n", "\n", "\"FASTag nullifies the chances of contracting Corona virus as there is no human contact between drivers and the toll booth workers unlike during cash transactions,\" it said.\n"]], "tags": ["National Highways Authority of India", "electronic toll collection", "Automated theorem proving", "highways", "technology", "NAM"]},
{"heading": [["Reports of truck drivers in the country contracting Covid-19: AIMTC"]], "sub_heading": [["The development adds to the issue of lack of truck drivers in the country, who are reluctant to come back to work, and the delay in announcement of Covid-19 insurance for truck drivers is making the situation worse, the All Indian Motor Transport Congress (AIMTC) said in a statement.  "]], "time": [["Last Updated: Apr 29, 2020, 08.24 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: ", "Truck drivers", " in the country have started contracting Covid-19, in what could pose as a grave challenge for the supply chain across sectors, India’s largest transport body said on Wednesday. \n", "\n", "The development adds to the issue of lack of truck drivers in the country, who are reluctant to come back to work, and the delay in announcement of Covid-19 insurance for truck drivers is making the situation worse, the All Indian Motor Transport Congress (AIMTC) said in a statement. \n", "\n", "The association has also sought relief from the government in terms of soft loans, deferment of statutory compliances, among others, to prevent truck operators from going bankrupt. \n", "\n", "“We have reports from Gwalior, Nawashrar and Vijaywada about drivers contracting Covid-19,” AIMTC said. “The drivers becoming a corona(virus) carrier is a dangerous proposition and it will be difficult to track backwards because of the wide geography traversed by them,” the statement said. \n", "\n", "Meanwhile, transport operators are still awaiting a Covid-19 insurance for truck drivers, which will help instil confidence in them to come back to work, who are otherwise reluctant so far. \n", "\n", "\n", "\n", "“The anxiety and uncertainty over the future scenario (is) galore everywhere, more so among the road transport fraternity, which is fast receding to bankruptcy,” the transport body said. \n", "\n", "The government should make available sift loans, defer statutory compliances and taxes, fees, EMIs, by six months, to allow a breather for transporters across the country, AIMTC said. \n", "\n", "AITWA also sought refund of TDS, with no cap on refund amount, to help meet the administrative expenses of transporters. \n", "\n"]], "tags": ["transport sector", "truck drivers", "coronavirus", "covid 19", "pandemic"]},
{"heading": [["NHAI extends deadline for road auctions"]], "sub_heading": [[" The government has extended the bid submission deadline for the fourth set of road auctions to July 31 as traffic flows remain below normal in the aftermath of the lockdown in the country."]], "time": [["Last Updated: May 15, 2020, 10.11 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The government has extended the bid submission deadline for the fourth set of road auctions to July 31 as ", "traffic", " flows remain below normal in the aftermath of the lockdown in the country.\n", "\n", "Bids for the Toll-Operate-Transfer bundle were invited by the ", "National Highways Authority of India", " (NHAI) in October and the deadline has been extended five times so far. \n", "\n", "While the initial plan was to raise Rs 4,200 crore, the floor price was eventually lowered to about Rs 2,200 crore to attract smaller ", "investors", ". The current offer consists of road stretches in Jammu & Kashmir, Punjab, Haryana, ", "Rajasthan", " and ", "Madhya Pradesh", ", with a cumulative length of 341.6 km.\n", "\n", "Investors who were asked to submit their bids by Friday now have time until July 31. The move may impact the highway ministry’s asset monetisation plans.\n", "\n", "“Asset monetisation is looking difficult in the current financial year,” a government official told ET. “For investors to be able to assess the feasibility of roads on the block, traffic has to normalise and only after that they will be able to make a projection.”\n", "\n", "NHAI suspended toll operations for about four weeks after the lockdown started on March 25. Although the government allowed the authority to resume toll operations from April 20, traffic still remains at about 40% of the usual level.\n", "\n", "This asset monetisation programme through toll-operate-transfer and infrastructure investment trusts will likely take a hit, advisory firm Crisil recently said.\n", "\n", "“Suspension of tolling and gradual recovery thereafter will make it hard for potential investors to estimate the traffic and, thus, arrive at a fair value for the asset,” Crisil said in a report assessing the impact of Covid-19 on the infrastructure sector.\n", "\n", "Approved in 2016, TOT is a mode of monetising operating highways where the concessionaire gets toll collection rights against a lump sum. This has been highway ministry’s method of bringing private investment into the sector.\n", "\n", "\n"]], "tags": ["National Highways Authority of India", "Madhya Pradesh", "investors", "rajasthan", "traffic"]},
{"heading": [["Yolo Bus to start services in Assam from May 25"]], "sub_heading": [["The company aims to start services across cities of Guwahati, Tinsukia, Silchar, North Lakhimpur, Duliajan, and the buses will ply from Guwahati to other states as well. "]], "time": [["Last Updated: May 22, 2020, 05.16 PM IST"]], "publisher": [[", ET Bureau"]], "article": [[": ", "Yolo bus", ", a Gurugram-based inter-city transportation and mobility platform, will start its ", "bus services", " in ", "Assam", " from May 25 onwards.\n", "\n", "With the ", "COVID-19", " pandemic, travelers would be searching for safer and more hygienic options to travel, the company said in a statement, adding that its primary focus would be is to expand its full-stack services with completely sanitized buses for every trip \n", "\n", "Shailesh Gupta, CEO & Founder said, “Assam is an important part of our expansion plans. With extensive on-ground research and smart network planning, we have figured out how to run a socially distanced transit system, logistically and equitably.\"\n", "\n", "The company aims to start services across cities of Guwahati, Tinsukia, Silchar, North Lakhimpur, Duliajan, and the buses will ply from Guwahati to other states as well. The interstate routes would be Guwahati to Imphal via Dimapur and Kohima, Guwahati to Aizwal and Guwahati to Itanagar.\n", "\n", "Mukul Shah, COO & Founder said they had started hiring local youths in Assam and were investing in their training and development. \n", "\n", "The company said they will launch ten buses on eight routes this month, followed by an increase in the number of buses over the next two months. There is no major organized player in the North East market now. \n", "\n", "Their statement said every passenger would be checked with infra-red temperature measuring guns before onboarding and that customers would be able to book their essential PPE kits and know the temperature of the bus crew members before booking the bus. \n", "\n", "\"The company will introduce a sanitization tunnel for each passenger before onboarding in order to contain the spread of COVID-19. The captain, along with the bus driver and staff will wear essential PPE to do away with the risk of contamination, ensuring a safe journey for the passengers,” it said.\n", "\n", "\n"]], "tags": ["Yolo Bus", "assam", "gurugram", "bus services"]},
{"heading": [["UPSRTC preparing to restart operations at short notice, date not decided yet: Official"]], "sub_heading": [["Reacting to reports that the state roadways buses would be restarting normal operations from June 1, the managing director of UPSRTC, Rajshekhar said the final decision will depend on the directions of the Ministry of Home Affairs and the Uttar Pradesh government regarding the ongoing lockdown."]], "time": [["Last Updated: May 25, 2020, 02.38 PM IST"]], "publisher": [["PTI"]], "article": [["LUCKNOW: The ", "Uttar Pradesh State Road Transport Corporation", " (", "UPSRTC", ") is preparing to restart operations at a short notice but the date of resuming the services is yet to be decided, a senior official said on Monday.\n", "\n", "Reacting to reports that the ", "state roadways", " buses would be restarting normal operations from June 1, the managing director of UPSRTC, Rajshekhar said the final decision will depend on the directions of the Ministry of Home Affairs and the Uttar Pradesh government regarding the ongoing ", "lockdown", ".\n", "\n", "\"It has come to the notice of UPSRTC headquarters that many websites and social media sites have posted some information about the operations of ", "buses", " from June 1,” Rajshekhar told reporters.\n", "\n", "“The start of operations and modalities will depend on the directions of the MHA and state government regarding the lockdown and its opening after May 31,” he added.\n", "\n", "\"We are preparing ourselves so that we can start operations at a short notice. The final date, time and modalities of operation completely depend on the decision about the lockdown and its lifting,\" he said further. \n", "\n"]], "tags": ["state roadways", "Uttar Pradesh State Road Transport Corporation", "Buses", "lockdown", "upsrtc"]},
{"heading": [["APM Terminal Pipavav handles 35 vessels since lockdown, says ops running smoothly"]], "sub_heading": [["The APM Terminals Pipavav port is running 24X7 due to the concerted efforts of all the stakeholders that has resulted in the smooth functioning of the port ever since the lockdown was announced in March 2020, it company said and added that the port is taking stringent precautionary measures as per various statutory guidelines to ensure the safety of the employees."]], "time": [["Last Updated: Apr 20, 2020, 01.22 PM IST"]], "publisher": [[]], "article": [["NEW DELHI: ", "APM Terminals Pipavav", " on Monday said it has handled more than 35 vessels and its operations are running smoothly despite the ", "lockdown", ".\n", "\n", "The APM Terminals Pipavav ", "port", " is running 24X7 due to the concerted efforts of all the stakeholders that has resulted in the smooth functioning of the port ever since the lockdown was announced in March 2020, it said in a statement.\n", "\n", "\"The port operations are proceeding safely and efficiently despite some challenges. The port handled over 35 vessels and more than 175 rakes since the lockdown without any delay. The port has created additional yard space and working with extended logistics partners to ensure the smooth flow of goods and help address any emergent supply chain needs,\" the company said.\n", "\n", "The pre-emptive steps taken by various authorities are commendable, it said.\n", "\n", "Jakob Friis Sorenson, Managing Director, APM Terminals Pipavav said, “We are grateful to the central and state government agencies, ", "Gujarat Maritime Board", ", the Railways, the district administration, the local police and the Customs departments for supporting the port in conducting continuous operations and keeping the wheels of the supply chain moving.”\n", "\n", "The statement said the port is taking stringent precautionary measures as per various statutory guidelines to ensure the safety of the employees, workforce and the community around.\n", "\n", "APM Terminals Pipavav is one of gateway port for containers, ro/ro (passenger cars), liquid bulk and dry bulk cargoes serving customers in the state of Gujarat with road and rail networks to India's hinterland and northwest.\n", "\n", "Its annual cargo handling capacity includes 1.35 million TEU containers, 2,50,000 passenger cars, 2 million tonne of liquid bulk and 4 million tonne of dry bulk. \n", "\n"]], "tags": ["Port", "lockdown", "APM Terminals Pipavav", "jakob friis sorenson", "Gujarat Maritime Board"]},
{"heading": [["Online booking, wearing masks must to board Haryana transport buses plying from Friday"]], "sub_heading": [["The Haryana government has already sanitised its bus terminals and the ordinary non-air-conditioned buses which will hit roads, Transport Minister Mool Chand Sharma said."]], "time": [["Last Updated: May 14, 2020, 06.44 PM IST"]], "publisher": [["PTI"]], "article": [["CHANDIGARH: Online booking and wearing masks will be must for ", "passengers", " boarding the ", "Haryana Roadways", " buses which are to start plying on select routes in the state from Friday, said Transport Minister Mool Chand Sharma. \n", "\n", "\"No passenger will be allowed to board the bus if online booking has not been done. The bus services will be point-to-point on select routes and wearing masks is mandatory. Thermal screening of passengers will also be done,\" Sharma told over phone on Thursday. \n", "\n", " The Haryana government has already sanitised its bus terminals and the ordinary non-air-conditioned buses which will hit roads, he said. \n", "\n", " To ensure that social distancing is strictly followed, only 30 passengers will be allowed to board the 52-seater buses. In the bus terminals too, passengers will have to maintain social distancing in the waiting area, he said. \n", "\n", " The buses will ply from depots in Ambala, ", "Bhiwani", ", Hisar, Kaithal, Karnal, Narnaul, ", "Panchkula", ", ", "Rewari", ", Rohtak and Sirsa and ply on select point-to-point routes.\n", "\n", " Digitally addressing a press conference on Wednesday, Haryana Chief Minister M L Khattar had announced that public transport will resume operation in the state on an \"experimental basis\" from Friday, with a limited number of buses plying on select routes. \n", "\n", " A government spokesman, meanwhile, said the buses, which will ply within Haryana, will not be started in areas severely affected by COVID-19. \n", "\n", " He said bookings for these buses can only be done through the online portal www.hartrans.gov.in. \n", "\n", " \"The buses will ply from the ", "Haryana State Transport", " bus stands to the scheduled bus stands. No passenger will be allowed to board or disembark the bus on the way,\" he added. \n", "\n", " He said in a statement that the buses passing through worst-hit COVID-19 affected districts will pass through a bypass or flyovers. Notably, Gurgaon, Faridabad, ", "Sonipat", " and Jhajjar are among the worst-affected districts in Haryana. \n", "\n", " He said if the bus movement is not possible on any route due to any reason then passengers will be informed two hours before the scheduled time of departure. The fare paid by the passenger will be refunded, he added.\n"]], "tags": ["Bhiwani", "passengers", "Haryana Roadways", "haryana state transport", "Sonipat", "panchkula", "rewari"]},
{"heading": [["Arshiya Ltd is ready to tackle container congestion at Ports and will not charge any Ground Rent for container storage"]], "sub_heading": [[]], "time": [["Last Updated: Apr 21, 2020, 10.20 AM IST"]], "publisher": [["Mediawire"]], "article": [["\n", "\n", " \n", "\n", "\n", "As India’s effective steps to stabilise Covid-19 situation brings accolades from international borders, it is now the Government of India’s efforts to reboot Indian economy that is considered most crucial at this stage. \n", "\n", "Facing lack of labour, multiple problems in transportation with driver in-availability, congestion at Ports, Container Freight Stations (CFS) and Inland Container Depots (ICDs), these big issues are a major concern for the commerce and labour ministry to handle ahead. \n", "\n", "Seeking solutions, the Port authorities and Commerce Ministry in India has been eagerly looking forward to have capable partners who can deal with evacuation of cargo and its onward delivery.\n", "\n", "\n", ". Currently amidst partial relaxation of lockdown, Arshiya Ltd’s workforce is dealing with removal of container congestion at JNPT / CFS and ICD in NCR attracting much appreciation from port authorities, domestic and international clients.\n", "\n", "Ajay Mittal, Chairman & Managing Director, Arshiya Ltd is confident that the situation can be tackled with strategic plans in place. He says, “Arshiya Ltd is equipped with state-of-the-art facilities to decongest the ports/ CFSs/ ICDs in West and North India. \n", ". Today, empty containers going back into circulation is a big problem and we have the right solution for the same through our The Free Trade and Warehousing Zones (FTWZs), allowing de-stuffing of import cargo. Together, we will win the war against COVID-19 sooner than later. Stay Safe and all the very best,” \n", "\n", "Keeping in mind about Government of India’s notification to companies and units that are located in access-controlled SEZs, EOUs and industrial townships to begin work, Arshiya Ltd promises to continue its awe-inspiring work through its Free Trade and Warehousing Zones. \n", "\n", "The team at Arshiya Ltd is currently processing solutions given to clients and intends to continue supporting client-based import operations in India. \n", "\n", "Ensuring health and safety norms at their warehouses, leading facilities offered by Arshiya Group’s services includes Free Trade & Warehousing Zones (FTWZs). Rail & Rail Infrastructure, Industrial & Domestic Hub, Forwarding, Supply Chain Technology and Handling procedures. \n", "\n", " \n", "\n", "\n", " • Movement by Road from JNPT/CFS near JNPT and by Road or Rail from current ICDs to Khurja ICD.\n", " • De-stuff cargo in either JNPT or Khurja FTWZ without payment of duty.\n", " • File BoE only for the cargo that needs to move out and pay duty accordingly.\n", " • Return empty containers to Shipping Lines as soon as possible on arrival at FTWZ\n", " • Avoid penalties of detention and demurrage.\n", "\n", " \n", "\n", "\n", " • Movement from current ICD to Khurja ICD (with client consent).\n", " • De-stuff cargo in FTWZ without payment of duty of the client (with client consent).\n", " • Client to file BoE only for the cargo that needs to move out and pay duty accordingly.\n", " • Empty containers in circulation as soon as possible on arrival at Khurja.\n", " • Efficient Supply Chain and planning for arrival and departure of ships.\n", "\n", "Situational readiness is a guarantee at Arshiya Ltd. The able team is now ready to partner with interested clients to tackle Covid-19 pandemic and usher a brighter tomorrow for India and the world.\n", "\n", " \n", "\n", "\n", "Arshiya Limited is a Logistics and Supply chain company and is a Pioneer in setting up two fully functional FTWZ in India. Situated in Western India at Panvel Mumbai and spread over 165acre, it is located – 24kms from JNPT. Situated 23kms from proposed second international Airport and NH 17 connecting Goa and Mumbai. \n", "\n", "Arshiya Ltd has a Multi-modal logistics Park in Northern India. Over 350 acres in Khurja near Greater Noida in NCR, located on eastern and western dedicated freight corridor encompassing – ICD. \n", "\n", "Free-Trade-Warehousing Zone (FTWZ), bonded warehousing and domestic (non-bonded) warehousing are available with CTO license with 18 rakes and 3,000 containers to move cargo (although zero ground rent offer above is CTO agnostic and not conditional on using CTO services). The available built up space of warehouse is 1.8 million sq.ft and capacity to build 6 million more between Panvel and Khurja. With 24X7 Dedicated Customs, 1 million sq. ft. of warehousing space for destuffing, hazardous cargo and over-dimensional cargo facilities are effectively available at Arshiya Ltd.\n", "\n", " \n", " \n", "www.arshiyalimited.com", "\n", "\n", " \n", " \n", "\n", " \n", " \n", " Sanjay Vohra, General Manager \n", "\n", " E: sanjay.vohra@arshiyalimited.com\n", "\n", " T: +91 22 4230 5502 / M: +91 9892805198\n", "\n", " \n", " Navnit Choudhary, Vice President\n", "\n", " E: navnit.choudhary@arshiyalimited.com\n", "\n", " T: +91 22 4230 5502 / M: +91 9323113203\n", "\n", " \n", " \n", " Vipin Sharma, General Manager \n", "\n", " E: vipin.sharma@arshiyalimited.com\n", "\n", " T: +91 11 4222 0950 / M: +91 9811608951\n", "\n", " \n", " Amit Gupta, Sr. Vice President\n", "\n", " E: amit.gupta@arshiyalimited.com\n", "\n", " T: +91 11 4222 0950 / M: +91 9582140591\n", "\n", " \n", "\n", " \n\n  ", "\n \n"]], "tags": ["trending", "national news", "International news", "Todays News", "popular news"]},
{"heading": [["COVID-19: Shipping Ministry seeks govt intervention for recognition of electronic trade documents"]], "sub_heading": [["​​Citing bottlenecks caused in handling EXIM cargo on account of the current manual process, it sought the commerce ministry's intervention for issuing advisory to departments, including customs, and the Indian Banks Association for accepting 'electronically generated trade documentation'."]], "time": [["Last Updated: Apr 19, 2020, 06.12 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: To ensure smooth cargo operations at India's ports amid the coronavirus pandemic, the shipping ministry has sought the commerce ministry's intervention for issuing advisory for recognition of electronic trading documents instead of \"manual trade documentation\" still required by many departments and financial institutions. \n", "\n", "Citing bottlenecks caused in handling EXIM cargo on account of the current manual process, it sought the commerce ministry's intervention for issuing advisory to departments, including customs, and the Indian Banks Association for accepting 'electronically generated trade documentation'.\n", "\n", " India has 12 major ports -- Deendayal (erstwhile Kandla), Mumbai, JNPT, Marmugao, New Mangalore, Cochin, Chennai, Kamarajar (earlier Ennore), V O Chidambarnar, Visakhapatnam, Paradip and Kolkata (including Haldia) that handled nearly 705 million tonnes (MT) cargo in 2019-20.\n", "\n", " Citing challenges faced in handling of EXIM cargo, Shipping Secretary Gopal Krishna in a letter to Commerce Secretary Anup Wadhawan said the inability of service providers such as courier agencies, general lockdown restrictions and the requirement of social distancing are causing severe impediment in issuance, delivery and despatch of physical format based trade documentation, which is directly impacting the release of import containers and cargo.\n", "\n", " Stating that the current manual process that requires surrender of original bill of lading (BL) at the shipping lines office, collection of paper invoice and payment by cash and collection of paper delivery order issued by then shipping line add up to 11.5 hours of person-to-person contact on an average, Krishna said it not only creates a high level of risk with the contagious nature of COVID-19 but results in considerable delays in release of cargo.\n", "\n", " Considering the present circumstances on account of COVID-19, the ", "Indian Ports Association", " (IPA) under the aegis of the ", "Ministry of Shipping", " has taken steps towards digitising some of trade related process through implementation of ", "Port Community System", " (PCS), the letter said.\n", "\n", " PCS was launched in December 2018 and has managed to digitise the major part in port related activities including e-invoice, e-payment and and electronic delivery order (e-DO).\n", "\n", " Bill of lading (BL), a critical component, however is still missing and trade bodies under the umbrella of the Federation of Indian Logistics Association (FILA) have supported the IPA initiative of eBL and identified providers like CargoX, the letter mentions.\n", "\n", " \"I would request you to consider issuing suitable guidelines and advisory consistent with international conventions on the subject to Departments as well as to ", "Indian Bank Association", " for banks in India by accepting 'electronically generated trade documentation'. \n", "\n", " \"Also, the 'stakeholders of the trade industry' such as carriers, exporters and importers can also be issued mandate to adopt and use such platforms for 'electronically generated trade documentation' including Bill of Lading (document of title) across stakeholders and across nations,\" the shipping secretary said. \n", "\n", " \"Such a measure shall help ease the economic and humanitarian challenges and also encourage continuity of trade and also enable trade revival in future. This will also support the Ministry of Shipping and ", "Ministry of Commerce", " in their efforts to ensure smooth flow of Export Import trade and release of import containers/cargo at various ports in India. Should the stakeholder or financial institutions or Departments require any support or assistance, they can reach out to Ministry of Shipping or the IPA,\" he added.\n", "\n", " The ministry also requested considering CargoX, a public block chain platform that provides the eBL solution and added that other solution providers of eBL like Tradelens, Wave, Bolero etc are explored for maritime EXIM cargo.\n", "\n", " The number of vessels handled by ports during 2019-20 was around 20,837, whereas during 2018-19, number of vessels handled was 20,853. The vessel traffic declined slightly by 0.08 per cent in comparison to last year.\n", "\n", " The major ports handle about 60 per cent of the country's total cargo traffic.\n"]], "tags": ["Ministry of Commerce", "Ministry of Shipping", "Indian Ports Association", "Indian Bank Association", "Port Community System"]},
{"heading": [["Handling cargo with caution, 55,238 crew, passengers not allowed to disembark: Official"]], "sub_heading": [["\"We are strictly adhering to precautions to prevent any further spread of COVID-19 while handling cargo at ports and the government has not issued shore passes or daily passes to 55,238 crew and passengers on board 1,715 vessels,\" an official told. All these crew and passengers were thermal scanned as per the WHO guidelines. "]], "time": [["Last Updated: Apr 21, 2020, 03.35 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Handling EXIM ", "cargo", " with laid down protocols to contain COVID-19 spread, India's ports saw as many as 1,715 ships mostly from China reaching its shores till Sunday with over 55,000 crew and passengers that were not allowed to disembark, a ", "Shipping Ministry", " official said on Tuesday. Of the 1,715 ships reaching Indian shores with cargo between January 27 and April 19, as many as 1,347 ships reached major ports and allowed anchoring at designated places. \n", "\n", "\"We are strictly adhering to precautions to prevent any further spread of COVID-19 while handling cargo at ports and the government has not issued shore passes or daily passes to 55,238 crew and passengers on board 1,715 vessels,\" an official told on Tuesday. \n", "\n", "Of the 55,238 crew and passengers on board these ships, 48,261 reached India's major ports, the official said. \n", "\n", "All these crew and passengers were thermal scanned as per the WHO guidelines, the official added. \n", "\n", "India has 12 major ports -- Deendayal (erstwhile Kandla), Mumbai, JNPT, Marmugao, New Mangalore, Cochin, Chennai, Kamarajar (earlier Ennore), V O Chidambarnar, Visakhapatnam, Paradip and Kolkata (including Haldia) that handled nearly 705 million tonnes (MT) cargo in 2019-20. \n", "\n", "For maintaining smooth operations across its ports the ", "Shipping", " Ministry has initiated a number of steps that include waiving of rentals. \n", "\n", "The government has asked each major port to ensure that no penalties, demurrage, charges, fee, rentals are levied on any port user (traders, shipping lines, concessionaires, licensees etc) for any delay in berthing or loading/unloading operations or evacuation of cargo caused by the reasons attributable to lockdown measures from March 22. \n", "\n", "The government has said each major port shall exempt or remit demurrage, ground rent over and above the free period, penal anchorage/ berth hire charges and any other performance-related penalties that may be levied on port-related activities including minimum performance guarantee, wherever applicable. \n", "\n", "Besides for existing and operational PPP projects, major ports can permit waiver of all penal consequences on a case-to-case basis along with deferment of certain performance obligations. \n", "\n", "The official said that hospitals across the major port trusts have been supplied with personal protective equipment (PPEs) and the arrangement of sufficient staff round the clock has been made. \n", "\n", "Ports and PSUs under the ", "Ministry of Shipping", " have contributed more than Rs 52 crore from the CSR funds towards PM CARES Fund. \n", "\n", "Besides, employees of ports, PSUs and other offices of the Ministry of Shipping have contributed over Rs 7 crore from their salaries towards PM CARES Fund. The number of vessels handled by ports during 2019-20 was around 20,837 against 20,853 vessels in 2018-19.\n"]], "tags": ["Ministry of Shipping", "covid", "shipping", "Shipping ministry", "Cargo"]},
{"heading": [["Material Recycling Association of India asks government to waive demurrage and rental charges"]], "sub_heading": [["According to MRAI, more than 2.5 lakh containers have got stuck for clearances at Indian ports on account of the complete lockdown."]], "time": [["Last Updated: Apr 29, 2020, 11.57 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["The ", "Material Recycling", " Association of India (MRAI) has asked the government to waive the detention ", "demurrage", " charges by shipping lines and ", "container freight", " stations apart from being provided with additional working capital.\n", "\n", "It also wants waiver on the interest on late payment of customs duty.\n", "\n", "“The 6000 odd MSME units in the recycling segment from metal and paper are adhering government order to giving salaries to their employees. However, foreign shipping lines and their associates are not listening to the ", "Ministry of Shipping", " guidelines, for waiving off the unjustified levies that they charge on import cargo,” said Sanjay Mehta, president, MRAI.\n", "\n", "This has led to containers containing imported scrap worth several lakhs getting stranded, making it challenging for the sector to start operations, said Mehta.\n", "\n", "If these orders are not strictly implemented by shipping lines, ", "Inland Container", " Depots (ICDs) and Container Freight Stations (CFSs) , Indian importers will lose more than Rs.80,000 crores in detention/demurrage charges to the foreign liners, said the industry.\n", "\n", "According to MRAI, more than 2.5 lakh containers have got stuck for clearances at Indian ports on account of the complete lockdown.\n", "\n", "“Plants are not operational, there is cash flow crunch in the market,employees are unable to reach office to perform necessary works related to imports and banks are working with less manpower,” said MRAI is a statement.\n", "\n", "According to the industry, the Container Freight Stations Association of India (CFSAI) has issued a letter denying to give any waiver on demurrage charges, citing that they are governed under Handling of Cargo in Customs Area Regulations( HCCAR) , 2009 , whereas none of the ministerial and departmental orders have mentioned about the HCCAR Rules. Similarly, foreign shipping companies have refused to adhere to guideline orders.\n", "\n", "Consequently, The Jawaharlal Nehru Custom House at Nhava-Sheva Port has issued a revised guidance to all the CFS/ICDs citing HCCAR Rules, so that the government orders are abided.\n", "\n"]], "tags": ["material recycling", "Ministry of Shipping", "demurrage", "Inland Container", "container freight"]},
{"heading": [["Recycling industry says scrap cargo stuck at ports, charges not waived; 6,000 units face closure"]], "sub_heading": [["Noting a drop in export-import (EXIM) cargo due to supply chain disruptions on account of the COVID-19 pandemic, the government last month asked India's all 12 major ports to defer the lease rentals and licence fees-related charges for April, May and June besides waiving rentals in proportion to the cargo drop and not to levy penalties. "]], "time": [["Last Updated: May 01, 2020, 06.52 PM IST"]], "publisher": [["PTI"]], "article": [["About 6,000 ", "recycling", " units face crisis-like situation, putting livelihood of about 3 lakh people dependent on them at stake as containers with imported scrap are stranded at ports amid COVID-19 outbreak while shipping lines, ICDs and CFSs fail to waive levies despite government order, as per recycling body MRAI. According to industry sources, more than 2.5 lakh containers have got stuck for clearances at ports amid lockdown in the wake of COVID-19 outbreak. \n", "\n", "Seeking PMO intervention to address the issue, Material Recycling Association of India (MRAI) has said shipping lines and CFSs (container freight station)/ICDs (Inland Container Depot) are not adhering to the guidelines by the ", "Ministry of Shipping", " for waiving levies, container detention, demurrage etc charges on import cargo. \n", "\n", "This has led to containers containing imported scrap worth several lakhs getting stranded, making the industry miserable, it said. \n", "\n", "\"This has also led to over 3 lakh people who depend on recycling sector for their livelihood, staring at starvation. About 30 per cent of this work force comprises women, who are engaged in segregation of scraps, before melting,\"it added. \n", "\n", "Noting a drop in export-import (EXIM) cargo due to supply chain disruptions on account of the COVID-19 pandemic, the government last month asked India's all 12 major ports to defer the lease rentals and licence fees-related charges for April, May and June besides waiving rentals in proportion to the cargo drop and not to levy penalties. \n", "\n", "In a letter, the shipping ministry had asked the ports to provide relief in the form of exemptions/ remission of charges to the shipping liners, exporters, importers, logistics providers and other stakeholders hit by the coronavirus outbreak. The relief measures are aimed at boosting EXIM cargo by supporting and rebuilding the logistics chain. \n", "\n", "However, MRAI said these orders are being violated by shipping lines, CFSs/ICDs and added that financial difficulties due to this has put a large number of people at stress as the recycling sector also indirectly supports livelihood of rag pickers & smaller scrap aggregators. \n", "\n", "\"Whereas the 6,000 odd MSME units in the recycling segment from metal and paper are adhering to government order to give salaries to their employees who are mainly from the weaker section of the society, here are foreign shipping lines and their associates who do not even listen to Ministry of Shipping guidelines\" said Sanjay Mehta, President, MRAI. \n", "\n", "MRAI alleged that these are the same shipping lines which make millions of dollars from the Indian trade and industry but refuse to extend a helping hand at this grievous situation, where everyone is contributing to help the country along with the government. \n", "\n", "The ", "recycling industry", " urged the government to intervene into the matter for survival of 6,000 MSME units and their employees by ensuring implementation of its orders including waiver of charges else warned that this could result in Indian importers losing \"more than Rs 80,000 crore in detention/demurrage charges to the lines which are foreign entities.\" \n", "\n", "Queries sent to ", "Jawaharlal Nehru Port Trust", " (JNPT) Chairman Sanjay Sethi and Mumbai Port Chairman Sanjay Bhatia remained unanswered. \n", "\n", " JNPT is India's number one container port, handling more than half of the container cargo across all major ports in India. \n", "\n", "Queries sent to Shipping Ministry officials too remained unanswered. \n", "\n", " In a letter to all ports chairman and CMDs, the ministry has said:\"The logistics chain-related businesses including traders, importers, exporters, port operators, shipping lines and transporters are facing a huge challenge in maintaining their businesses due to a lower trade volume as well as cash flow issues. Therefore, it is required that some relief measures are taken to support and rebuild the chain.\" \n", "\n", " \"The lockdown measures and associated disruptions in the logistics chain have impacted the Indian ports and port users. There is an impact in the form of drop in imports and export volumes, delays in evacuation of cargo, cash flow issues etc., resulting in inability of port users, concessionaires and other stakeholders to fulfil their obligations to port authorities, banks and lenders,\" it added. \n", "\n", "Under this extraordinary situation, all major ports have been directed that they shall allow free storage time to all port users during the lockdown, besides \"deferment of April, May and June months' annual lease, rentals, licence fee on pro-rata basis without any interest\", according to the letter. \n", "\n", "India has 12 major ports -- Deendayal (erstwhile Kandla), Mumbai, JNPT, Marmugao, New Mangalore, Cochin, Chennai, Kamarajar (earlier Ennore), V O Chidambaranar, Visakhapatnam, Paradip and Kolkata (including Haldia) that handled nearly 705 million tonnes of cargo in 2019-20.\n"]], "tags": ["Ministry of Shipping", "Shopclues", "Jawaharlal Nehru Port Trust", "nam nam anu anu", "recycling", "recycling industry"]},
{"heading": [["Shipping ministry announces Rs 50 lakh compensation for employees at Major Ports"]], "sub_heading": [["The monetary compensation will be extended to direct employees as well as contractual labourers, the ministry of shipping said in a statement. Ministry of Shipping has decided that all the Major Ports may grant compensation ex-gratia in the event of loss of life due to COVID-19 to the dependent members or legal heirs of the port employees, it said. "]], "time": [["Last Updated: Apr 28, 2020, 04.09 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The government on Tuesday declared a compensation of Rs 50 lakh for people employed with ", "major ports", " in the country, in case they lose their lives to Covid-19. \n", "\n", "The monetary compensation will be extended to direct employees as well as contractual labourers, the ministry of ", "shipping", " said in a statement. \n", "\n", "Ministry of Shipping has decided that all the Major Ports may grant compensation ex-gratia in the event of loss of life due to COVID-19 to the dependent members or legal heirs of the port employees, it said. \n", "\n", "India has 12 major ports—Deendayal (erstwhile Kandla), Mumbai, JNPT, Cochin, to name a few.\n", "\n", "“Monetary Compensation is declared to cover the risk of life due to COVID-19 contamination while discharging the Port related duty,” it said. \n", "\n", "The port chairman will be the competent authority for settling claims and disbursement of the compensation and also the verifying authority for the cause of death from COVID-19. \n", "\n", "The compensation will be applicable only for the pandemic of COVID-19 and shall be in force up to September 30, 2020. subject to review thereafter, the government said. \n", "\n"]], "tags": ["Ministry of Shipping", "covid", "shipping", "major ports", "coronavirus"]},
{"heading": [["COVID-19 Lockdown: Special ships between Port Blair, Chennai to transport those stranded"]], "sub_heading": [["The Andaman and Nicobar Islands administration has decided to arrange special ships between Port Blair and Chennai to ferry stranded migrant workers, students, pilgrims and tourists, officials said on Friday. "]], "time": [["Last Updated: May 01, 2020, 02.24 PM IST"]], "publisher": [["PTI"]], "article": [["The Andaman and Nicobar Islands administration has decided to arrange special ships between ", "Port Blair", " and ", "Chennai", " to ferry ", "stranded", " migrant workers, students, pilgrims and tourists, officials said on Friday. \n", "\n", "The decision was taken after the Centre on Wednesday issued fresh directives allowing states to transport stranded people to their home states or destination amid the COVID-19-induced ", "lockdown", " \n", "\n", "\"The transportation of such personnel shall be on one time, one way basis only,\" the deputy director of ", "Shipping Services", " said in a statement. \n", "\n", "\"Primarily only asymptomatic people who clear the screening process will be allowed to board the ship,\" the statement said. \n", "\n", "Further, all persons arriving in Port Blair will be mandatorily quarantined for 14 days and they will be required to give an undertaking regarding this before boarding, it said. \n", "\n", "Officials said those who want to travel will have to register themselves by 5 pm on May 2. \n", "\n", "\"Based on the data of stranded personnel, sailing will be scheduled in the near future and announced accordingly,\" it said. \n", "\n", "People who want to travel from Port Blair to Chennai can register themselves by sending an SMS to 9932080480 and 9150572319 with details such as name, age, sex, present location, final destination and mobile number. \n", "\n", "People who want to travel from Chennai to Port Blair can register themselves with the assistant director of Shipping Services in Chennai by sending an SMS with such details to 9434272187.\n"]], "tags": ["PORT BLAIR", "lockdown", "stranded", "shipping services", "Chennai"]},
{"heading": [["Covid-19 impact: Port congestion adds to exporters’ woes"]], "sub_heading": [["India’s exports shrank almost 35% in March, the biggest contraction in almost a decade, reflecting the global slowdown made worse by the Covid-19 pandemic. Exporters looking to restart operations are confronted with multiple issues including additional costs due to stringent norms, cash flows and getting labour back to work."]], "time": [["Last Updated: Apr 22, 2020, 10.49 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Import containers have piled up at ports as manufacturing of non-essential goods is yet pick up under the lockdown, prompting some ports to shut export gates.\n", "\n", "India’s exports shrank almost 35% in March, the biggest contraction in almost a decade, reflecting the ", "global slowdown", " made worse by the ", "Covid-19", " pandemic.\n", "\n", "Exporters looking to restart operations are confronted with multiple issues including additional costs due to stringent norms, cash flows and getting labour back to work.\n", "\n", "Shipping lines", " are skipping Indian ports due to lack of yard space is the concern that Indian exporters and importers have begun facing as trade opens up. ", "JNPT", " is preparing a contingency plan to clear congestion.\n", "\n", "While there was a marginal increase of 50 more ", "special economic zones", " (SEZ) becoming operational on Monday, with another 50 starting work from home, the numbers vary among states, exporters said higher compliance cost associated with bringing and maintaining labour are hindrances in restarting factories.\n", "\n", "“We will watch the situation for one week,” said one official.\n", "\n", " \n", "\n", "\n", "Exporters have already flagged these issues with the government as they sought a lump sum amount, especially for the small units to be able to meet new compliance costs.\n", "\n", "“Owners need to give a guarantee that the labour is not coming from any containment zone. There is also a fear in the employers that even if there is one positive case, they would be held liable,” said Ravi Sehgal, chairman EEPC.\n", "\n", " “Ports have their own problems. Many inbound containers are lying at ports whose delivery is not happening and that is another crisis for exports,” said Ajay Sahai, director general, Federation of Indian Export Organisations.\n", "\n", "JNPT, which handles around 8,000 containers of which 2,000 are reefer containers, is preparing a contingency approach in case of congestion.\n", "\n", "“We have a contingency approach and don’t need to send the consignments to other ports,” said Sanjay Sethi, chairman, JNPT, adding that the port is prepared for the worst case scenario when no evacuation of consignments happens for two months.\n", "\n", "While temperature-sensitive cargo such as food and pharmaceuticals are fast moving, exporters have complained that exports are getting adversely impacted since raw materials are lying at ports.\n", "\n", "JNPT expects around 67 vessels to come by April 30 and there is no skip in that, sources said. Almost 90-92% of the imports that happened this time last year, are happening at the port in the last 4-5 days.\n", "\n", "\n"]], "tags": ["Special Economic Zones", "shipping lines", "Global slowdown", "JNPT"]},
{"heading": [["63,000 crew, passengers on board ships from China not allowed to disembark till April 30"]], "sub_heading": [["India has 12 major ports -- Deendayal (erstwhile Kandla), Mumbai, JNPT, Mormugao, New Mangalore, Cochin, Chennai, Kamarajar (earlier Ennore), V. O. Chidambaranar, Visakhapatnam, Paradip and Kolkata (including Haldia). These ports handled nearly 705 million tonnes (MT) cargo in 2019-20. "]], "time": [["Last Updated: May 03, 2020, 02.12 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: As many as 63,000 crew members and passengers on board vessels mostly from China have been denied disembarkation at Indian ports so far, as part of efforts to curb the spread of coronavirus, a shipping ministry official said. These crew members and passengers reached Indian ports on board about 1,990 vessels between January 27 and April 30, the official added. \n", "\n", " \"A total of 62,948 crew and passengers reached India's ports on board about 1,990 ships, mostly from China. Thermal scanning of all these crew and passengers were done as per the WHO (", "World Health", " Organization) guidelines. Besides adhering to all precautions and laid-down protocols to prevent any further spread of COVID-19, no shore passes or daily passes were issued to these people, and EXIM cargo was handled with care,\" the official told . \n", "\n", " Of the total 1,990 ships, 1,621 reached major ports and were allowed anchoring at designated places for loading and unloading of export-import (EXIM) cargo. \n", "\n", " Of these 63,000 crew and passengers onboard these ships, 56,000 reached the major ports, the official said. \n", "\n", " India has 12 major ports -- Deendayal (erstwhile Kandla), Mumbai, ", "JNPT", ", Mormugao, New Mangalore, Cochin, Chennai, Kamarajar (earlier Ennore), V. O. Chidambaranar, Visakhapatnam, Paradip and Kolkata (including Haldia). These ports handled nearly 705 million tonnes (MT) cargo in 2019-20. \n", "\n", " For maintaining smooth operations across ports, the shipping ministry has initiated a number of steps that include waiving of rentals. \n", "\n", " The government has asked all major ports to ensure that no penalties, demurrage, charges, fees and rentals are levied on any port user (traders, shipping lines, concessionaires, licensees, etc) for any delay in berthing or loading/unloading operations or evacuation of cargo caused by the reasons attributable to lockdown measures from March 22. \n", "\n", " Besides, for existing and operational PPP (public private partnership) projects, major ports can permit waiver of all penal consequences on a case-to-case basis along with deferment of certain performance obligations. \n", "\n", " The official said hospitals across the major port trusts have been supplied with ", "personal protective equipment", " (PPE), and the arrangement of sufficient staff round the clock has been made. \n", "\n", " Ports and PSUs under the ", "Ministry of Shipping", " have contributed over Rs 52 crore from the ", "corporate social responsibility", " (CSR) funds towards PM-CARES Fund. \n", "\n", " Besides, employees of ports, public sector undertakings (PSUs) and other offices of the ministry have contributed over Rs 7 crore from their salaries towards the PM-CARES Fund. The number of vessels handled by ports during 2019-20 was around 20,837 as against 20,853 vessels in 2018-19.\n"]], "tags": ["Ministry of Shipping", "personal protective equipment", "World Health", "JNPT", "corporate social responsibility"]},
{"heading": [["Cargo volume at major ports slip 21% to 47 million tonnes in April; Chennai, JNPT severely hit"]], "sub_heading": [["Rating agency Icra had last week said that while all cargo segments are vulnerable, container segment is expected to be more adversely impacted."]], "time": [["Last Updated: May 24, 2020, 04.39 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The country's 12 major ports recorded a 21 per cent decline in ", "cargo volumes", " to 47.42 million tonnes (MT) in April this year, mainly due to coronavirus outbreak, according to ", "Indian Ports Association", " (IPA).\n", "\n", "Ports like JNPT, ", "Chennai", ", Cochin and Kamrajar witnessed huge decline in cargo handling, as per the latest data.\n", "\n", "India has 12 major ports under the control of the Centre - Deendayal (erstwhile Kandla); Mumbai, JNPT; Mormugao, New Mangalore; Cochin, Chennai, Kamarajar (earlier Ennore), V O Chidambarnar, Visakhapatnam, Paradip and Kolkata (including Haldia) that handled 705 million tonnes (MT) cargo in the last fiscal.\n", "\n", "These 12 major ports handled 47.42 MT cargo in April, down 21.08 per cent as compared to the corresponding month of 2018-19, as per the latest figures released by the port body IPA.\n", "\n", "Chennai Port", " saw a massive 38.17 per cent fall in cargo handling to 2.44 MT, and JNPT declined by 33.97 per cent to 3.95 MT in April.\n", "\n", "Cargo handling at Cochin port slipped 33.73 per cent to 1.87 million tonnes, and Kamrajar Port fell 30.03 per cent to 2.08 MT, the data showed.\n", "\n", "Container trade", " was severely hit as it recorded a decline of 36.98 per cent in terms of TEU (twenty foot equivalent unit), followed by 30.46 per cent fall in thermal coal.\n", "\n", "Rating agency Icra had last week said that while all cargo segments are vulnerable, container segment is expected to be more adversely impacted.\n", "\n", "It said that while general cargo throughput may witness 5-8 per cent contraction for full year 2020-21, the container segment may witness a decline of 12-15 per cent during the same period. \n", "\n"]], "tags": ["Indian Ports Association", "Chennai port", "cargo volumes", "covid impact", "container trade", "Chennai"]},
{"heading": [["Cyclone Nisarga: DGCA reiterates guidelines on adverse weather operations to airlines, pilots"]], "sub_heading": [["\"Domestic aviation activities have recently been started after a period of two months. Operators and individuals have a challenge at hand in restarting flying after a prolonged period of non-flying and the associated weather at this time of the year across India,\" The Directorate General of Civil Aviation (DGCA) said in the circular. "]], "time": [["Last Updated: Jun 02, 2020, 08.42 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Indian aviation regulator DGCA issued a circular to airlines and pilots on Tuesday, reiterating its guidelines on adverse weather operations as ", "Cyclone Nisarga", " approaches the coastal areas of ", "Maharashtra", " and Gujarat. According to the ", "India Meteorological Department", " (IMD), the cyclone is expected to cross the north Maharashtra and the south Gujarat coasts late Wednesday evening. \n", "\n", "\"Domestic aviation activities have recently been started after a period of two months. Operators and individuals have a challenge at hand in restarting flying after a prolonged period of non-flying and the associated weather at this time of the year across India,\" The Directorate General of Civil Aviation (DGCA) said in the circular. \n", "\n", "This circular is being issued to operators and pilots to reiterate some existing guidelines on adverse weather operations and suggested measures \"to cater for the gap in flying of pilots\", it said. \n", "\n", "Operations at the Mumbai airport, which has been handling 50 ", "domestic flights", " daily since May 25, are likely to be significantly affected on Wednesday due to the cyclone. \n", "\n", "\"Fuel uplift calculation should be done very judiciously and it should take into account enroute and destination weather and trend forecast,\" the DGCA said. \n", "\n", "In another guideline, the regulator stated: \"Correct use of weather radar is very important, a common error is not having the weather radar in correct mode and range during take-off.\" \n", "\n", "Domestic passenger flights started in India on May 25 after a gap of two months due to the coronavirus-triggered lockdown. International passenger flights continue to remain suspended. \n", "\n", "Prime Minister Narendra Modi", " spoke with the chief ministers of Maharashtra and Gujarat on Tuesday and assured them of all help from the Centre as the cyclone approaches the country's western coast. \n", "\n", "The IMD has said a low-pressure area formed over the Arabian Sea has intensified into a depression and will further intensify into a cyclonic storm.\n"]], "tags": ["chhatrapati shivaji international airport", "prime minister narendra modi", "domestic flights", "Maharashtra", "India meteorological department", "cyclone nisarga"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [["Airlines cancel flights in the wake of Cyclone Nisarga"]], "sub_heading": [["Vistara also cancelled flights to Delhi and Kolkata. Other airlines too cancelled flights.The operators of the Mumbai airport held a meeting with its stakeholders to devise preventive measures to tackle potential adversities accompanied by the cyclone. "]], "time": [["Last Updated: Jun 02, 2020, 09.10 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Airlines", " cancelled most flights to and from Mumbai in the wake of ", "Cyclone Nisarga", ". Mumbai airport has allowed just 50 daily flight movements to prevent the spread of Coronavirus. Of that IndiGo cancelled 17 flights and operated just three to Chandigarh, Ranchi and Patna. \n", "\n", "Vistara", " also cancelled flights to Delhi and Kolkata. Other airlines too cancelled flights.The operators of the Mumbai airport held a meeting with its stakeholders to devise preventive measures to tackle potential adversities accompanied by the cyclone. \n", "\n", "The airport said it “has undertaken various measures to safeguard the passengers and airlines at the airport. Preventive checks at different airport functions have been carried out and the airport has ensured that DG sets are in place to provide uninterrupted power supply. Water pumps have been positioned across the airport to clear water in case of waterlogging,”\n", "\n", "“A dedicated team has been placed on standby at the airport to assist in this wary situation,” it said.\n", "\n", "There have been warnings of the Cyclone making its landfall in the Maharashtra coast. ", "The National Crisis Committee", " has taken stock of the state’s preparedness. On Monday, ", "the National Disaster Response Force", " said it has positioned teams in 9 vulnerable districts.\n", "\n"]], "tags": ["The National Disaster Response Force", "the national crisis committee", "National Disaster Response Force", "airlines", "Vistara", "cyclone nisarga"]},
{"heading": [["Transporters demand reduction in fuel prices"]], "sub_heading": [["All India Motor Transport Congress is the umbrella body of transporters representing about 95 lakh truckers and entities across the country.  There is no respite from the spiralling diesel and petrol prices which is having back-breaking impact on the transport sector as fuel prices are not being reduced and the taxes as well as VAT too are on the higher side."]], "time": [["Last Updated: Apr 21, 2020, 06.16 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Amid subdued global crude ", "oil", " prices, ", "transporters", "' apex body AIMTC on Tuesday demanded reduction in fuel prices, and suspension of toll collection on highways, as truckers are facing acute problems amid the lockdown. AIMTC said COVID-19 outbreak and the lockdown have hit the transport sector adversely, and exerting acute pressure on the sector. \n", "\n", "All India ", "Motor Transport", " Congress (AIMTC) is the umbrella body of transporters representing about 95 lakh truckers and entities across the country. \n", "\n", "There is no respite from the spiralling ", "diesel", " and petrol prices which is having back-breaking impact on the transport sector as fuel prices are not being reduced and the taxes as well as VAT too are on the higher side, it said. \n", "\n", "With the global crude oil prices on a downward spiral, it is hoped that it will help major consumers such as India manage fiscal pressures coupled with collateral damage done by corona fallout, it added. \n", "\n", "\"The cost of the Indian basket of crude, which represents the average of Oman, Dubai and ", "Brent", " crude, was USD 20.56 a barrel on 17 April, 2020. Brent oil prices have collapsed around 60 per cent since the start of the year while the price of diesel has fallen only by 10 per cent. From the beginning of the May 2014, the ", "Government", " did not pass on the benefit of plummeting crude oil prices to the public instead increased profit share of the OMCs by increasing the ", "excise", " duty. \n", "\n", "\"Apart from crude oil rates there are two important factors which determine the fuel cost - VAT and Excise Duty - which has increased significantly in last four years. Irony is - we are paying more taxes than the cost of obtaining fuel. Excise Duty was Rs 9.20/litre on Petrol and Rs 3.46/litre on diesel on November 1, 2014,\" said AIMTC President Kultaran Singh Atwal. \n", "\n", "Atwal said the present excise duty is Rs 22.98 per litre (including road cess) on petrol and Rs 18.83 per litre (including road cess) on diesel. \n", "\n", "Tax paid for obtaining fuel petrol in Delhi is Rs 37.84 per litre, while it is Rs 28.01 per litre for diesel, he said. \n", "\n", "AIMTIC also opposed resumption of toll charges from April 20, saying it has caused undue pressure on the road transport sector, which is crumbling under financial strain. \n", "\n", "\"These must be suspended for six months and the toll collection tenure may be extended for an equivalent period,\" it added. \n", "\n", "Besides, it demanded protection to the drivers engaged in supply chain in the form of health insurance. \n", "\n", "Demanding COVID-19 health insurance for drivers and co-workers, the body said there are quite a few cases where the driver has tested corona positive, including in a recent case in which a truck driver, who travelled from Panipat to Gwalior was found corona positive. \n", "\n", "\"We have been asking the government for sanitization of vehicles at loading and unloading stations and every 200 km en route along with thermal screening of the drivers, but all fell on deaf ears,\" it said.\n"]], "tags": ["Brent", "diesel", "Government", "oil", "Transporters", "excise", "motor transport"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["Lockdown 3.0", "ambala", "Haryana Roadways", "lockdown", "Haryana", "coronavirus", "bus services", "Roadways"]},
{"heading": [["Over 57 lakh migrants traveled in over 4,100 'Shramik' special trains since May 1"]], "sub_heading": [["The top five states where maximum trains terminated are Uttar Pradesh(1670 Trains), Bihar(1482 Trains), Jharkhand(194 Trains), Odisha (180 Trains), West Bengal (135 Trains), while most number of trains originated from Gujarat(1027 Trains), Maharashtra(802 Trains), Punjab(416 Trains), Uttar Pradesh (288 Trains) and Bihar (294 Trains)."]], "time": [["Last Updated: Jun 02, 2020, 10.17 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The ", "Indian Railways", " has operated 4,155 ", "Shramik special trains", " in the past one month transporting over 57 lakh migrants, the railway ministry said on Tuesday. \n", "\n", "Of these trains, almost 40% terminated in Uttar Pradesh, while 35% went to Bihar.\n", "\n", "The ministry of railways on May 1, began operating Shramik special trains meant for transporting stranded migrants back to their home States amid the ", "Covid-19", " outbreak. \n", "\n", "Of the total migrants that traveled in these trains, more than fifty lakh were transported in May, the ministry said. \n", "\n", "The top five states where maximum trains terminated are Uttar Pradesh(1670 Trains), Bihar(1482 Trains), Jharkhand(194 Trains), Odisha (180 Trains), West Bengal (135 Trains), while most number of trains originated from Gujarat(1027 Trains), Maharashtra(802 Trains), Punjab(416 Trains), Uttar Pradesh (288 Trains) and Bihar (294 Trains).\n", "\n", "“It may be noted that trains running now are not facing any congestion,” the ministry said. Between May 20-24, reports of excessive congestion on the railway network emerged, with the national transporter having to reroute 71 trains. \n", "\n", "At a recent press briefing, railway board chairman VK Yadav said that these trains were diverted because of congestion on the routes towards Uttar Pradesh and Bihar. \n", "\n", " “90% trains run between May 20-May 24 went to UP and Bihar, leading to congestion of the network. We diverted these turns to meet the requirements of originating States,” Yadav had said.\n", "\n", "The demand for these trains has, however, is now coming down gradually, Yadav said. As of Tuesday morning, 102 trains were on the run the ministry said. \n", "\n"]], "tags": ["shramik special train", "coronavirus", "train for migrants", "indian railways", "shramik special trains"]},
{"heading": [["Railways restores ticket reservation window to 120 days"]], "sub_heading": [["This comes as the government plans to bring normalcy in passenger train operations. Covid-19, however, continues to rage with over 1.5 lakh cases in the country. "]], "time": [["Last Updated: May 28, 2020, 10.14 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The Indian Railways has restored the advance reservation period (", "ARP", ") for special Rajdhani trains operating presently and mail express trains that will begin operations June 1 onwards, to 120 days. \n", "\n", "Essentially, passengers will be able to reserve train tickets up to four months in advance. \n", "\n", "“Ministry of Railways has decided to increase the advance reservation period of all Specials notified from 30 days to 120 days,” it said in a statement on Thursday. ", "Booking", " of parcel and luggage shall be permitted in all these 230 trains, the ministry said. \n", "\n", "This comes as the government plans to bring normalcy in passenger train operations. Covid-19, however, continues to rage with over 1.5 lakh cases in the country. \n", "\n", "Railway minister Piyush Goyal last week said that it was time to take the country towards a sense of normalcy as the national transporter prepares to run more passenger trains going forward. \n", "\n", "The ARP, which is essentially the window for which you can reserve a train ticket, has varied from seven days to 30 days for the passenger trains announced so far. \n", "\n", "The said changes shall be implemented with effect from 8 am of train booking dated 31st May onwards.\n", "\n", "Other terms like current booking, tatkal quota allocation of seats will be the same as in regular time-tabled trains.\n", "\n", "The Indian Railways will run both air conditioned and non-air conditioned passenger trains June 1 onwards, and booking for 200 such trains began May 21 onwards.\n", "\n", "These special services are in addition to the Shramik ", "special trains", " being run since 1st May and 30 Special AC trains being run since 12th May 2020. \n", "\n"]], "tags": ["booking", "rajdhani express", "New Delhi", "Special trains", "Ministry of Railways", "ARP"]},
{"heading": [["Demand for Shramik special trains coming down gradually: Chairman Railway Board"]], "sub_heading": [["The Indian Railways began operating 'Shramik' special trains 1st May onwards to transport stranded migrants back to their home States. "]], "time": [["Last Updated: May 29, 2020, 06.26 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The demand for ‘Shramik’ special trains is coming down gradually, with the ", "Indian Railways", " having transported over 50 lakh people in 3,840 trains so far, Chairman ", "Railway Board", " VK Yadav said on Friday. \n", "\n", "The Indian Railways began operating 'Shramik' special trains 1st May onwards to transport stranded migrants back to their home States. \n", "\n", "Till 28th May, over 3,800 trains transported around 52 lakh passengers. Of these, 1,524 Shramik Specials operated in the week between 22nd May to 28th May, transporting over 20 lakh passengers.\n", "\n", "“Slowly it seems like the demand from the originating States is coming down,” Yadav said at a media briefing here. \n", "\n", "As of last week, originating States had indicated a demand of 923 trains for migrants, which had come down to 449 trains as of Thursday, Yadav said. \n", "\n", "These trains, however, will continue to operate as long as all migrants are sent back to their home States as required.\n", "\n", "Yadav maintained that the incidents of migrants getting into a scuffle for food on these trains, have happened “only in 2-3% of these trains”, and the national transporter is trying its best to make trains available at a very short notice from State governments, the reason why some trains have had to be diverted from their original routes in the past few days. \n", "\n", "Yadav refuted reports of trains running overly late. “Of the 3,840 trains, only four took more than 72 hours to reach their destination,” Yadav said. \n", "\n", "Between May 20-May 24, the Indian Railways diverted around 71 trains, with heavy demand for Uttar Pradesh and Bihar. “90% trains run between May 20-May 24 went to UP and Bihar, leading to congestion of the network. We diverted these turns to meet the requirements of originating States,” Yadav added. \n", "\n", "Yadav said that the data on deaths in Shramik trains was still being compiled, and the government was ascertaining the reason behind these deaths. \"It would be insensitive to say, without any investigation, that these deaths were on account of hunger,\" Yadav said. \n", "\n"]], "tags": ["coronavirus pandemic", "migrant workers", "Railway Board", "india lockdown", "shramik special trains", "indian railways"]},
{"heading": [["People with pre-existing medical conditions should avoid Shramik specials: Railway Ministry"]], "sub_heading": [["It has been observed that some people who are availing this service have pre-existing medical conditions which aggravates the risk they face during the COVID-19 pandemic, the ministry said. The ministry has attributed the reason behind these deaths to “pre-existing medical conditions”. "]], "time": [["Last Updated: May 29, 2020, 02.15 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: The railway ministry on Friday advised people with pre-existing health conditions to avoid travelling in ‘Shramik’ special ", "trains", " being run to transport stranded ", "migrants", " back to their home States. \n", "\n", "This comes after several deaths have been reported recently among people on board these trains which began operating 1st May onwards. \n", "\n", "“In order to protect the vulnerable persons from COVID-19, Ministry of ", "Railways", " makes an appeal that persons with co-morbidities (for example - hypertension, diabetes, cardio-vascular diseases, cancer, immune deficiency conditions), pregnant women, children below the age of 10 years and persons above 65 years of age may avoid travel by rail, except when it is essential,” it said in a statement on Friday. \n", "\n", "It has been observed that some people who are availing this service have pre-existing medical conditions which aggravates the risk they face during the COVID-19 pandemic, the ministry said.\n", "\n", "The ministry has attributed the reason behind these deaths to “pre-existing medical conditions”. \n", "\n"]], "tags": ["covid", "Migrants", "coronavirus", "Shramik Specials", "trains", "railways"]},
{"heading": [["Only four Shramik trains have taken over 72 hours to reach destination: Railways"]], "sub_heading": [["The clarifications came amid criticism over delays that the migrant trains were getting \"lost\" before reaching their destinations.  Among the destination-states for which the trains were diverted were Bihar (51), Uttar Pradesh (16), Jharkhand (2), Assam and Manipur (1 each). "]], "time": [["Last Updated: May 29, 2020, 05.32 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi: Only four out of the total 3,840 ", "Shramik Specials", " run so far have taken over 72 hours to reach their destinations since they started operating on May 1, ", "Railway Board", " Chairman V K Yadav said Friday, reacting to reports of the trains being \"lost\". He also said 90 per cent of these migrant trains ran with an average speed higher than regular mail express trains. \n", "\n", "\"From 20-24 May, 71 trains were diverted because of high demand for trains to UP, Bihar, where 90 per cent trains were going from across the country,\" Yadav said. \n", "\n", "Among the destination-states for which the trains were diverted were Bihar (51), Uttar Pradesh (16), Jharkhand (2), Assam and Manipur (1 each). \n", "\n", "Among the originating-states for which trains were diverted included Maharashtra, Gujarat, Karnataka, Rajasthan. \n", "\n", " The clarifications came amid criticism over delays that the migrant trains were getting \"lost\" before reaching their destinations. \n", "\n", "Till May 28, Yadav said, 3,840 ", "Shramik", " Specials operated ferrying a total of 52 lakh passengers. \n", "\n", "He said 1,524 Shramik train operated in last one week and over 20 lakh passengers were ferried. \n", "\n", "\"Railways has accommodated almost all requests received from the sending states and we are ready to meet all demand of Shramik movements,\" he said, adding \"as of now we have demand for around 492 trains\". \n", "\n", "Yadav also that the Railways was compiling a list of people who died on the Shramik Special trains as he urged everyone with pre-existing health conditions, pregnant women and the aged to avoid unnecessary travel.\n"]], "tags": ["Shramik", "asg abh abh", "migrant workers", "Railway Board", "Shramik Specials"]},
{"heading": [["Shatabdi trains will be redeployed; bookings will start soon: Vinod Kumar Yadav, Chairman, Railway Board"]], "sub_heading": [["Vindo Kumar Yadav explains why the railways had to divert Shramik special trains and why the transporter initially asked states to collect fares from migrants before transporting them to their home states."]], "time": [["Last Updated: May 31, 2020, 12.12 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Railway Board", "Vinod Kumar Yadav", "Shramik special trains", "\n", "\n", "\n", "\n", "According to the assessment we had on May 28 after consulting with states, 449 Shramik trains are still required. We will do an assessment again. We will run Shramik trains till the last migrant needs it. Both regular and Shramik specials will run from Monday.\n", "\n", "\n", "\n", "We are resuming regular trains in a phased manner. After all, the state governments will need to arrange facilities at the stations to screen passengers and quarantine them. The railways will inform the states about each of those trains. So, 100 pairs of trains will run from June 1. The routes were decided on the basis of India’s geography and passenger demands. These are in addition to 15 pairs of Rajdhani that are already running. We have to introduce more trains in routes where there is massive demand. We are monitoring the booking patterns to understand demand. Also, ", "Shatabdi trains", " will be redeployed to cover shorter distances. Bookings will start soon.\n", "\n", "\n", "\n", "That is an exaggeration by media. We had to divert some trains mainly because there was a surge in demand for Shramik specials between May 20 and 24. About 90% of the migrant labourers had just two destinations — Uttar Pradesh and Bihar. But out of 3,941 Shramik trains (run between May 1 and 29), only 71 were diverted — all between May 20 and 24. That is 1.8% of the total.\n", "\n", "\n", "\n", "Train diversions are decided by machines. Computers tell the control room about the best possible routes. It is like a Google map telling you which route you should take to avoid a traffic jam. The route via Jharsuguda in Odisha was clear, so 37 trains were diverted through that station. The trains had to travel for a longer distance, but they also moved faster.\n", "\n", "\n", "\n", "Let us remember, it is not a normal time. In some places, our contractors found it difficult to source food from private restaurants and hotels as all those were closed. We are, however, monitoring the situation and if any person fails to get his meal in one station, we ensure the passenger is provided the same in the next big station.\n", "\n", "\n", "\n", "Originally, we said ‘collect and pay’ because at the beginning, Shramik trains were meant not only for migrant labourers but also for students and stranded tourists. The states did reimburse the migrants. Cost of running a special train is higher than a usual train. But we said it from day one that 85% of the cost will be borne by the railways. The passenger fare portion, which is borne by states, covers only 15% of our expenditure. Initially, originating states paid the fare, but now, in most cases, destination states are paying it. Migrant workers have never had to pay.\n", "\n", "\n", "\n", "I can’t give you the number of deaths. Each case is being handled by the respective state government. None of the reports has said a person died of hunger. To link these to starvation during the journey is fallacious. \n", "\n"]], "tags": ["Shatabdi trains", "Sunday ET", "coronavirus", "Railway Board", "shramik special trains", "Vinod Kumar Yadav"]},
{"heading": [["Govt to arrange special trains to bring labourers back to their workplaces: Anurag Thakur"]], "sub_heading": [["The government arranged special trains to ferry migrated labourers to their home state after thousands of them were seen walking one state to another along with their family and kids despite the lockdown as they stopped earning with the economic activity coming to a standstill during lockdown. Thakur has requested the industry to get in touch with their workers."]], "time": [["Last Updated: May 30, 2020, 05.11 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA: ", "Special trains", " would be arranged for ", "labourers", " so that they can return to their workplaces, junior finance minister Anurag Singh Thakur said Saturday.\n", "\n", "He has requested the industry to get in touch with their workers, who have managed to return to their native places during the lockdown in desperate conditions. \n", "\n", "As the economy opens up in a phased manner, the labour-intensive factory and ", "construction units", " in the western and ", "southern states", " are facing shortage of migrated labourers, posing roadblocks to the path of restoring production. \n", "\n", "The government arranged special trains to ferry migrated labourers to their home state after thousands of them were seen walking one state to another along with their family and kids despite the lockdown as they stopped earning with the ", "economic activity", " coming to a standstill during lockdown.\n", "\n", "The government has announced measures to boost activity. One of these is the extension of a credit linked subsidy scheme (", "CLSS", ") for middle income groups to buy affordable housing units till March 31, 2021. \n", "\n", "Thakur said that a suggestion to extend the scheme to the metro and Tier-II cities is being considered.\n", "\n", "He interacted with members Kolkata-based ", "Bharat Chamber of Commerce", " in a video call.\n", "\n", "Speaking on self-reliance through ", "import substitution", ", the minister said that ", "India", " should increase mining and export of key minerals like coal and bauxite. “We need to reduce our reliance on import of coking coal in the future”, he said.\n", "\n"]], "tags": ["economic activity", "southern states", "construction units", "kolkata", "labourers", "CLSS", "Special trains", "import substitution", "India", "Bharat Chamber of Commerce"]},
{"heading": [["1.45 lakh passengers set to travel on June 1 as 200 more trains commence operations"]], "sub_heading": [["Around 26 lacs passengers booked for Advance Reservation Period between June 1 and June 30.   These passenger services will be in addition to Shramik special trains and 30 special AC trains being run since 12th May.  Passengers have been advised to reach the railway station at least 90 minutes in advance."]], "time": [["Last Updated: May 31, 2020, 07.46 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: Over 1.45 lakh ", "passengers", " will travel in 200 passenger mail express ", "trains", " that are set to commence from June 1 onwards. \n", "\n", "In what would be a further resumption of passenger train services, ", "the railway ministry", " on May 19 announced the operations of a hundred pairs of air conditioned and non air conditioned trains. \n", "\n", "“More than 1.45 lac passengers to travel on Day 1 of 200 trains starting on June 1,” the railway ministry said in a statement on Sunday. \n", "\n", "Around 26 lacs passengers booked for ", "Advance Reservation Period", " between June 1 and June 30. \n", "\n", "These passenger services will be in addition to Shramik special trains and 30 special AC trains being run since 12th May. \n", "\n", "Passengers have been advised to reach the railway station at least 90 minutes in advance and only those with confirmed and RAC tickets shall be allowed to enter ", "the Railway Station and board", " the train.\n", "\n"]], "tags": ["indian railways", "passengers", "advance reservation period", "New Delhi", "coronavirus", "the railway station and board", "trains", "The railway ministry"]},
{"heading": [["Jharkhand, Andhra Pradesh and Maharashtra express reservations on running special trains from June 1: Railways"]], "sub_heading": [["Sources said a high-level meeting is underway at the railway headquarters to resolve the matter. They indicated the three states have raised concerns over the rising cases of the coronavirus as the reason behind their opposition to movement of trains."]], "time": [["Last Updated: May 31, 2020, 07.52 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: Hours before the Railways begins operating 200 ", "special passenger trains", ", Jharkhand, Andhra Pradesh and Maharashtra have expressed reservations about the planned services, the national transporter said on Sunday.\n", "\n", "Sources said a high-level meeting is underway at the railway headquarters to resolve the matter. They indicated the three states have raised concerns over the rising cases of the ", "coronavirus", " as the reason behind their opposition to movement of trains.\n", "\n", "\"Jharkhand, Andhra Pradesh and Maharashtra have expressed reservations about running of trains or number of stoppages as planned. The matter is being discussed with the states. Any further development in this regard will be intimated,” a railway spokesperson said.\n", "\n", "The Railways has decided to run 200 special passenger trains from June 1. \n", "\n"]], "tags": ["New Delhi", "migrant workers", "coronavirus", "virus outbreak", "special passenger trains"]},
{"heading": [["Shramik Specials not regular trains, can be extended, diverted to benefit migrant workers: Railways"]], "sub_heading": [["The clarifications from railways came amid criticism over delays that the migrant trains were getting \"lost\" before reaching their destinations. Railways data shows that 36.5 per cent of all Shramik trains have ended up in Bihar and 42.2 per cent have terminated in Uttar Pradesh, leading to unequal pressure on these routes."]], "time": [["Last Updated: May 29, 2020, 08.49 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The ", "Railways", " defended itself on Friday in the face of severe criticism over delays by ", "Shramik Specials", " in reaching their destinations, saying they were not ", "regular trains", " and they can be extended or short-terminated, and their stoppages and routes can be changed for the benefit of migrant workers.\n", "\n", "Addressing a press conference, ", "Railway Board", " Chairman V K Yadav clarified that no train can ever be \"lost\", as has been said about the delayed trains, and pointed out that of the 3,840 trains operated since May 1, only four have taken over 72 hours to reach their destinations.\n", "\n", "The clarifications came amid criticism over delays that the migrant trains were getting \"lost\" before reaching their destinations. Railways data shows that 36.5 per cent of all Shramik trains have ended up in Bihar and 42.2 per cent have terminated in Uttar Pradesh, leading to unequal pressure on these routes.\n", "\n", "Repeatedly stating that these were \"unusual times\", Yadav also defended the Railways against the flak over lack of food and water on board the delayed trains, saying 85 lakh meals and 1.25 crore water bottles were supplied free of cost to ", "passengers", ".\n", "\n", "He said complaints from passengers aboard specific trains have been investigated and it was found that there were no discrepancies in supply of meals.\n", "\n", "\"Because of ", "coronavirus", ", many contractors did not want to board the trains to distribute food. We would initially give the packets for them to take on their own. But now our employees are using masks and gloves to enter the trains and distribute food.\n", "\n", "\"So, out of the 3,840 trains, these incidents are maybe in 1 or 2 per cent of the trains. In 98-99 per cent cases, this has gone smoothly,\" he asserted.\n", "\n", "Yadav said the Railways was compiling a list of people who died on the Shramik Specials as he urged everyone with pre-existing health conditions, pregnant women and the aged to avoid unnecessary travel.\n", "\n", "\"", "Indian Railways", " has a control system; the train is immediately stopped if someone is found ill and doctors try to save their lives. Many passengers have been attended to by Railway doctors, 31 successful deliveries have been done. In many cases they were sent to the nearest hospital base.\n", "\n", "\"I understand that they are travelling in desperate times. Each death is investigated. We are compiling the data on deaths and the reasons behind the dates from ", "state governments", ". We will make it public when we have the numbers and I don't want to comment on this without correct numbers,\" he said responding to a question on the number of deaths on board these trains.\n", "\n", "He also said 90 per cent of these migrant trains ran with an average speed higher than regular mail express trains.\n", "\n", "\"There was some fake news that a train reached Siwan in nine days... We diverted only 1.8 per cent of trains. From 20-24 May, 71 trains were diverted because of high demand for trains to UP, Bihar, where 90 per cent trains were going from across the country,\" Yadav said.\n", "\n", "He said in one case, a train which was to go to Allahabad was sent to Lucknow and was reported as \"lost\". It was diverted to the Uttar Pradesh capital when it was realised that there were fewer people destined for Allahabad and more on the Lucknow route.\n", "\n", "\"We spoke to the state government and we took a decision in Kanpur to take the train to Lucknow. These trains are not normal trains, Railways has maintained full flexibility in them. State governments have been given full flexibility to extend trains, change stoppages and change routes,\" he said.\n", "\n", "Among the destination-states for which the trains were diverted were Bihar (51), Uttar Pradesh (16), ", "Jharkhand", " (2), Assam and Manipur (1 each).\n", "\n", "Among the originating-states for which trains were diverted included Maharashtra, Gujarat, Karnataka, Rajasthan.\n", "\n", "Till May 28, Yadav said, 3,840 Shramik Specials operated ferrying a total of 52 lakh passengers. He said 1,524 Shramik trains operated in last one week and over 20 lakh passengers were ferried.\n", "\n", "\"Railways has accommodated almost all requests received from the sending states and we are ready to meet all demand of Shramik movements. Requirement of states as on May 24 was 923 trains, as per requirement yesterday, the figure is now 449 trains,\" he said.\n", "\n", "He said meals -- breakfast, lunch, dinner -- were served at enroute stations and the state governments provided food and water at starting stations. IRCTC and various railway divisions arranged free meals and water for migrants in trains enroute and over 85 lakh meals and 1.25 crore water bottles were supplied free.\n", "\n", "\"NGOs also supplemented efforts. Railway Divisions mobilized local halwais, bakeries at various stations to prepare snacks and foods for Shramiks,\" he said. \n", "\n"]], "tags": ["Shramik Specials", "jharkhand", "passengers", "coronavirus", "Railway Board", "State governments", "indian railways", "Regular Trains", "railways"]},
{"heading": [["Railway Minister Piyush Goyal asks zones to ensure punctuality of Shramik Special trains"]], "sub_heading": [["In the order issued to the general managers of its zones, the board said punctuality needs to be enforced in the operations of these trains. "]], "time": [["Last Updated: Jun 01, 2020, 07.11 PM IST"]], "publisher": [["PTI"]], "article": [["With reportedly 40 per cent of the ", "Shramik Special trains", " running late by eight hours on an average, ", "Railway Minister Piyush Goyal", " has instructed the zones to ensure a ", "punctual operation", " of these trains. An order issued by ", "the Railway Board", " on Monday said the punctuality of both the ", "Rajdhani", " special trains that have been operational since May 12 and the special train services that began on Monday needs to be maintained. \n", "\n", "The railways has run 4,000 Shramik Special trains and ferried more than 56 lakh passengers across the country so far. \n", "\n", "In the order issued to the general managers of its zones, the board said punctuality needs to be enforced in the operations of these trains. \n", "\n", "\"The MR (minister of railways) desires that punctuality of mail/express special trains being operated with effect from May 12 and June 1 should be closely monitored at the divisional and zonal level, a special focus on the punctual operation of Shramik Special should be continued (reason for detention, if any, should be analysed and immediate action should be taken to ensure punctual running of trains. Matter most urgent, ensure compliance,\" the order stated. \n", "\n", "According to reports, an analysis of 3,740 Shramik Special trains showed that around 40 per cent of those reached the destination with an average delay of about eight hours. As many as 421 trains were delayed by 10 hours or more. Around 10 per cent or some 373 Shramik Special trains were late by 10-24 hours. There were 78 trains that were delayed by a day or more and 71 of them were delayed by over 72 hours.\n"]], "tags": ["The Railway Board", "piyush goyal", "rajdhani", "indian railways", "shramik special trains", "punctual operation", "railway minister piyush goyal"]},
{"heading": [["Railways receives a demand for 321 Shramik Special trains; decision likely on discontinuation soon: Sources"]], "sub_heading": [["The Railways, which is running over 200 Shramik Special trains on an average, has the capacity to complete the demand of 321 trains in the next two days, the sources said. "]], "time": [["Last Updated: Jun 01, 2020, 08.10 PM IST"]], "publisher": [["PTI"]], "article": [["New Delhi, Jun 1 () The ", "Railways", " has received a request for 321 more trains from various states and is likely to take a decision to end these services soon, sources said on Monday. While the Railways has maintained that it will run these trains as long as there is demand, a letter from the Chairman Railway Board to the states on May 29 had requested that they look at their list of registered migrants still wanting to return and provide their requirement for such trains by May 30 so that these services can be planned. \n", "\n", "By May 30 evening, demand for 321 such trains have been received, the sources said. \n", "\n", "Since May 31, the Railways has run 4,000 such trains ferrying around 56 lakh migrants home, the demand for such trains has tapered down from the states. Most of these 321 trains are to terminate in West Bengal, they said. \n", "\n", "The Railways, which is running over 200 ", "Shramik Special trains", " on an average, has the capacity to complete the demand of 321 trains in the next two days, the sources said. \n", "\n", "However, it has to run these services keeping in mind the requirements of the states, which are asking them to be sent in a staggered manner. \n", "\n", "On Sunday, the Railways operated only 69 such trains, officials said. \n", "\n", "Over 42.2 per cent of these trains have been received by Uttar Pradesh, followed by ", "Bihar", " with 36.5 per cent, ", "Jharkhand", " with 4.8 per cent, Odisha 3.2 per cent, West Bengal 2.3 per cent and received by the remaining states. \n", "\n", "Shramik Special trains are being operated primarily on the request of the states, which want to send migrant workers stranded due to the coronavirus-triggered lockdown to their native places. \n", "\n", "While the ", "Indian Railways", " is bearing 85 per cent of the total cost of these trains, states are bearing 15 per cent of it in the form of fares. \n", "\n", "The nationwide lockdown has had a devastating impact on the economy as well as on the livelihoods of lakhs of migrant workers. \n", "\n", "The plight of migrant workers, who were walking from several urban centres to their villages hundreds of kilometres away, had grabbed headlines for almost two months. \n", "\n", "There have been incidents of many of them being killed in road accidents. A number of migrant labourers were even killed by a speeding train after they fell asleep on the tracks. \n", "\n", "On May 1, the Railways started the migrant special trains to facilitate the movement of such workers back to their home states. \n", "\n", "While on the first day, four such trains were operated, the maximum number of 279 trains were operated on May 20.\n"]], "tags": ["jharkhand", "Bihar", "New Delhi Railway station", "indian railways", "shramik special trains", "railways"]},
{"heading": [["South Eastern Railway to replant and restore the trees destroyed during Cyclone Amphan"]], "sub_heading": [["The historic campus of SER headquarters at Garden Reach was left badly damaged by Cyclone Amphan which ravaged Kolkata and its suburbs on May 20, 2020. "]], "time": [["Last Updated: Jun 02, 2020, 04.01 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA: ", "South Eastern Railway", " (SER) has taken up a unique initiative for restoration of ", "trees", " and re-greening of its headquarters in ", "Kolkata", " in the aftermath of the devastating impact of ", "Cyclone Amphan", ".\n", "\n", "The historic campus of SER headquarters at ", "Garden Reach", " was left badly damaged by Cyclone Amphan which ravaged Kolkata and its suburbs on May 20, 2020. The headquarters of SER houses a number of century-old trees and is renowned for its greenery all around. But many of the trees have been uprooted or badly damaged after the cyclone hit Kolkata.\n", "\n", "It reflected the overall situation in the city of Kolkata which suffered large scale destruction of its green cover, with anywhere between 5,000-10,000 trees either being uprooted, fallen or destroyed in the cyclone.\n", "\n", "Sanjay Kumar Mohanty, General Manager, South Eastern Railway along with other senior officers visited the ravaged SER campus on May 21, 2020 morning. After witnessing the damage, it was decided SER would ", "replant", " as many trees as possible. A team of experts consisting of horticulturists has subsequently been deployed for replantation and restoration of trees. \n", " \n", "\"A total number of 237 trees have been uprooted/tilted during the Cyclone Amphan. Till now 102 trees have been restored, out of which, 82 trees have been restored mechanically and 20 trees have been restored manually. \n", "Another 80 trees have been supported by rope and wooden poles,\" an official statement from SER said adding, the ongoing drive aims \"to restore as many trees as possible to bring back the greenery.\"\n", "\n"]], "tags": ["cyclone amphan", "kolkata", "replant", "trees", "Garden Reach", "South Eastern Railway"]},
{"heading": [["Railways bets on Maruti, Kia to increase freight kitty"]], "sub_heading": [["“We are expecting orders from automakers to stabilise and go up to 10 rakes every month,” said RS Saxena, divisional railway manager at Bengaluru."]], "time": [["Last Updated: May 31, 2020, 11.17 PM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW DELHI: The ", "Indian Railways", " is betting on increased freight loading by automakers including Maruti ", "Suzuki", " and South Korea’s ", "Kia Motors", " as the lockdown is eased. During the lockdown, the railways had been in touch with both companies for their transportation requirements, a senior railway ministry official said.\n", "\n", "One freight train loaded with 100 units of Kia Seltos left from ", "Bengaluru", " on Sunday. The rate for one such train, known as a rake, is about Rs 19 lakh.\n", "\n", "“We are expecting orders from automakers to stabilise and go up to 10 rakes every month,” said RS Saxena, divisional railway manager at Bengaluru.\n", "\n", "While the cost of moving SUVs by rail is similar to that by road, rail transportation is faster – rakes from Bengaluru reach New Delhi in three to four days compared with a week by road, Saxena told ET.\n", "\n"]], "tags": ["Maruti Suzuki", "bangalore", "Bengaluru", "Kia Motors", "indian railways", "suzuki"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["indian railways", "shramik special trains", "migrant workers", "Railway Board", "Vinod Kumar Yadav"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["migrant workers", "coronavirus", "Railway Board", "Shramik Train"]}
]