[
{"heading": [["Dixon to invest Rs 250 crore, hire 2,500 in 9 months under PLI scheme"]], "sub_heading": [["On April 1, the government notified three schemes comprising total incentives of around Rs 48,000 crore to boost electronics manufacturing in the country."]], "time": [["Last Updated: Jun 02, 2020, 08.15 PM IST"]], "publisher": [["PTI"]], "article": [["Dixon Technologies", " is planning to invest Rs 250 crore and hire 2,500 people in next 8-9 months to expand operations to take advantage of ", "the Product Linked Incentive", " (PLI) scheme that opened on Tuesday, a top company official said. On April 1, the government notified three schemes comprising total incentives of around Rs 48,000 crore to boost ", "electronics manufacturing", " in the country. \n", "\n", "Electronics manufacturing companies will get 4-6 per cent incentives based on certain incremental sales every year. \n", "\n", "The company is readying to apply for the PLI scheme shortly, Dixon Technologies Chairman Sunil Vachani told . \n", "\n", "\"The schemes announced by the government are a game changer. We will apply for the PLI scheme shortly. Dixon plans to invest Rs 250 crore and hire 2,500 people over a period of next 8-9 months,\" Vachani said. \n", "\n", "According to industry estimates, mobile manufacturing companies have the potential to get an incentive of around Rs 7,500 crore if they scale up production to worth about Rs 1.5 lakh crore over the next five years under the PLI scheme. \n", "\n", "The government has started inviting applications for the same through the scheme implementing partner ", "Industrial Finance Corporation of India", " (IFCI). \n", "\n", "Under the scheme, the government aims to attract top 5 global mobile manufacturing companies who control 80 per cent of the global market in the segment and also promote five local companies in expanding their business as national champions. \n", "\n", "\"This is the first time the government has come up with a scheme to promote local companies as national champions. The scheme will help Indian mobile manufacturing companies to go global as well,\" Vachani said.\n"]], "tags": ["electronics manufacturing", "Industrial Finance Corporation of India", "Finance Corporation of India", "Dixon Technologies", "the product linked incentive"]},
{"heading": [["Oppo halts work at Noida unit after staff test positive"]], "sub_heading": [["Earlier on Sunday, six Oppo factory employees were reportedly found to be Covid-19 positive at manufacturing facility in Greater Noida."]], "time": [["Last Updated: May 18, 2020, 07.55 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW: Chinese handsetmaker ", "Oppo", " said it has suspended its manufacturing at the Greater Noida plant after some ", "employees", " tested positive for Covid-19, and is awaiting test results of all 3,000 employees. \n", "\n", "Earlier on Sunday, six Oppo factory employees were reportedly found to be Covid-19 positive. “...we have suspended all operations at our manufacturing facility in Greater Noida and initiated Covid testing for 3,000+ employees, for which results are awaited,” an Oppo spokesperson said in a statement to ET.\n", "\n", "“Will only allow employees with negative test results to resume office following all safety protocols,” the spokesperson said. “We are undertaking stringent measures to keep the employees safe and disinfecting the premises.”\n", "\n", "\n"]], "tags": ["Noida factory", "Oppo", "Handsetmaker", "coronavirus", "employees"]},
{"heading": [["Lava plans to move export manufacturing base to India"]], "sub_heading": [[" Handset maker Lava International plans to shift its export manufacturing base from China to India this year on the back of an incentive scheme, and a top executive said the company will invest about ₹800 crore over the next five years."]], "time": [["Last Updated: May 16, 2020, 11.36 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["Handset maker ", "Lava", " International plans to shift its export ", "manufacturing", " base from China to India this year on the back of an incentive scheme, and a top executive said the company will invest about Rs 800 crore over the next five years.\n", "\n", "“We have been eagerly looking forward to an opportunity to shift our entire mobile R&D, design and manufacturing from China to India,” Hari Om Rai, chairman of home-bred Lava International, told ET. He said the company will invest Rs 80 crore for the transition that is planned to be executed within six months.\n", "\n", "The government’s production-linked incentive (PLI) scheme is designed to address the disadvantages faced by global supply chains in India.\n", "\n", "“With the production-linked incentives, our manufacturing disabilities for the world market would largely be met. Hence, we plan to make this shift. We see complete transition happening over a period of time. The transition will depend on demand as well as on our ability to capture market share in the global market,\" said Rai, who is also the managing director.\n", "\n", "Lava's manufacturing facilities in China are outsourced, whereas its R&D and design facilities in China are owned by the company.\n", "\n", "The handset maker said its India setup can handle all domestic and export demands. \n", "\n", "The PLI scheme for large-scale electronics manufacturing was notified on April 1 and offers a production-linked incentive to boost domestic manufacturing and attract large investments in mobile phone manufacturing and specified electronic components, including assembly, testing, marking and packaging (ATMP) units.\n", "\n", "Besides having a strong foothold in the feature phones space, Lava has also established its presence in contact manufacturing. In September last year, it bagged a multi-crore deal from US conglomerate General Electric to manufacture hand-held devices meant specifically for medical use.\n", "\n", "Along with Micromax, Lava had also bagged a Rs 2,500 crore order for manufacturing sub-$200 devices from US telco major AT&T along with rivals T-Mobile and Sprint.\n", "\n", "Lava recently said it is raising $90 million (Rs 630 crore) from GEM Global Yield Fund to invest in R&D with the aim of boosting its position in the sub-$150 price segment. \n", "\n", "GEM group is making the investment over the next 36 months through a share subscription facility, which will allow the company to sell American depositary receipts to the US fund house in exchange for drawing down available funds, Lava said in a statement.\n", "\n"]], "tags": ["Lava", "india exports", "manufacturing", "Delhi"]},
{"heading": [["Online sales of smartphones to dominate this festive season"]], "sub_heading": [["Experts predict smartphone sales via ecommerce platforms this festive season will capture more than half of the market and exceed offline sales for the first time, with consumers preferring home delivery to in-store shopping."]], "time": [["Last Updated: May 18, 2020, 03.21 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["As e-commerce resumes with the lifting of lockdown curbs, the online channel is expected to be the choice for consumers purchasing smartphones in times of Covid-19.\n", "\n", "Experts predict ", "smartphone sales", " via ecommerce platforms this festive season will capture more than half of the market and exceed offline sales for the first time, with consumers preferring home delivery to in-store shopping.\n", "\n", "E-commerce channels including Amazon and Flipkart and the online stores of large-format retailers such as Croma, Vijay Sales, ", "Reliance", " and Sangeetha could altogether corner 53% of the market during October-November this year, according to ", "Counterpoint Technology Market Research", ".\n", "\n", "The online market share could settle between 46%-50%, which would be the highest ever, ", "International Data Corporation", " said.\n", "\n", "According to IDC India data, online contribution to smartphone sales has consistently risen, touching 41.7% in 2019 from 38.4% in 2018. The highest share was recorded at 45.4% in the June-August period last year.\n", "\n", "However, online smartphone sales are expected to come at a cost to some brick-and-mortar stores.\n", "\n", "“Standalone retailers will be the most impacted if sales plunge in the offline channel as they are not very cash-rich entities and operate on periodic credit cycles, manage inventories and get incentives on target fulfilment,” said Tarun Pathak, associate director at Counterpoint.\n", "\n", "However, the online-to-offline (O2O) model adopted by companies including ", "Xiaomi", " and Vivo could save the day for independent sellers, analysts said.\n", "\n", "“Offline retailers have pivoted their business models. With the O2O mechanism, they have adopted the hyperlocal delivery models. This could act as a shield to offline retailers to some extent,” Pathak said.\n", "\n", "In the O2O model, customers can get a phone delivered from their nearest retailer after placing an order on the handset maker’s official website.\n", "\n", "“The hybrid channel strategy is the step in the right direction, given the current times, but its success largely depends on implementation,” said Upasana Joshi, associate research manager at IDC. “It depends on factors such as how many retailers actually digitise and how quickly they do it, and how comfortable customers are with browsing a single brand catalogue.”\n", "\n", "While the online-offline tussle continues, online sales remained strong and captured 43.1% of the market in the January-March quarter, according to IDC.\n", "\n", "\n"]], "tags": ["Xiaomi", "International Data Corporation", "covid", "Reliance", "counterpoint technology market research", "Smartphone sales"]},
{"heading": [["Refurbished, pre-owned smartphones rack up numbers as incomes shrink"]], "sub_heading": [["Omni-channel goods’ resellers such as OLX, Quikr, Cashify and Yaantra are witnessing a flow in demand towards the organised refurbished and pre-owned smartphone market in just over a week of easing of lockdown restrictions. "]], "time": [["Last Updated: May 28, 2020, 10.30 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The Covid-led disruption in the ", "smartphone", " industry is opening up avenues for the refurbished and pre-owned devices category, which is seeing a ", "demand", " shift from new devices due to dip in consumers’ disposable incomes. \n", "\n", "Omni-channel goods’ resellers such as ", "OLX", ", ", "Quikr", ", ", "Cashify", " and ", "Yaantra", " are witnessing a flow in demand towards the organised refurbished and pre-owned smartphone market in just over a week of easing of lockdown restrictions. \n", "\n", "The major challenge for the ", "industry", " though is the continuous supply of smartphone parts from China, which is expected to normalise in 5-6 weeks, experts said. But for now, demand is picking up for this segment. \n", "\n", " \n", "\n", "\n", "Cashify said that despite fewer people outside, it has seen a surge in demand in both online and offline channels for the week gone by. Yaantra said there has been a 30% rise in orders placed by offline retailers, especially in tier-2 and tier-3 cities. \n", "\n", "Pre-owned goods reseller Quikr estimates a double-digit growth in the segment in the next two quarters, factoring in the immediate need for smartphones. Market intelligence firm Counterpoint Research predicts that while the new handset market will decline 10%, the refurbished category will decline by 4% and growth is expected in latter part of second half of the year. \n", "\n", "Yaantra said that besides premium brands, which sell faster in the re-commerce market, mid-range brands such as ", "Oppo", ", ", "Vivo", " and ", "Realme", " are also seeing traction with `5,000-8,000 being the most popular price band. \n", "\n", "“Pre-owned smartphones owing to affordability continue to be of higher interest for consumers as rural internet users have surpassed urban internet users recently as per a report from IAMAI & Nielsen,” Tarun Sinha, head-horizontal business unit at OLX India, told ET.\n", "\n"]], "tags": ["Smartphone", "demand", "olx", "Cashify", "quikr", "realme", "Oppo", "Industry", "Vivo", "Yaantra"]},
{"heading": [["Nokia resumes operations at its Sriperumbudur facility after employees test positive"]], "sub_heading": [["ET wrote to Nokia to find out how many employees from the Sriperumbudur plant had tested positive and is awaiting a response from the Finnish firm.  The factory had resumed operations under the standard operating procedures that had been laid down by the State government as the lockdown norms were eased for the manufacturing sector, in a bid to revive the economy. "]], "time": [["Last Updated: May 27, 2020, 03.18 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Chennai: ", "Nokia", " has resumed operations at its its factory in ", "Sriperumbudur", " after briefly remaining shut following some employees testing positive for Covid-19, a spokesperson from the company confirmed to ET via email. \n", "\n", "\"We have now resumed operations with minimum required staff strength. We are closely monitoring the situation and plan to gradually ramp-up,\" the Finnish company said in the statement. \n", "\n", "The company declined to comment on how many of their employees tested positive. \n", "\n", "In their statement, Nokia said the India factory had been operating at a restricted level for the past few weeks with necessary government approvals and in compliance with local regulations ensuring all safety practices. \n", "\n", "Nokia said the company had suspended operations last week and had since undertaken further fumigation and sanitization activities in line with regulatory guidelines. \n", "\n", "Shutting down the factory, however, was the company's own decision. \n", "\n", "\"Our protocol says only that part of the factory where the infected person worked need to be temporarily closed and thoroughly disinfected. In Nokia's case, the management itself took the decision to close,\" said a senior official in the Tamil Nadu Industries Department. \n", "\n", "The company said it had already implemented a suite of measures to limit the risk of infection within the factory. These measures included social distancing, enhanced cleaning regimes, increased hygiene and mandatory face masks for employees, rules for transport and travel, changes to canteen facilities, and screening measures at multiple points on arrival. \n", "\n", "\"All employees are also being regularly briefed on hygiene and expected behaviours. Compliance with these rules and behaviours, and the effectiveness of these measures are under continual review,\" Nokia added. \n", "\n", "The Nokia factory is located on the outskirts of State capital, Chennai which is the worst hit district in the State with 11,640 cases. Tamil Nadu touched 17,728 cases in all on Tuesday. \n", "\n", "The company's closure came close on the heels of Chinese smartphone maker ", "Oppo", " suspended operations at a plant last week after some workers tested positive for the novel ", "Coronavirus", ".\n", "\n"]], "tags": ["Nokia", "Sriperumbudur", "Nokia employee", "Oppo", "coronavirus"]},
{"heading": [["India paves way for Apple, others to increase domestic production by removing a clause"]], "sub_heading": [["Govt has dropped irritants from its PLI scheme, paving way for phone-makers to ramp up production in India."]], "time": [["Last Updated: May 30, 2020, 09.19 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["The government has dropped contentious clauses including the evaluation of plant and machinery to be brought from China and ", "South Korea", ", which had been opposed mainly by Apple, paving the way for the iPhone maker and others like Samsung, Foxconn, ", "Oppo", ", Vivo, and ", "Flextronics", " to make a larger play in ", "local production", " using the production-linked incentive (PLI) scheme.\n", "\n", "“The empowered committee of secretaries met on Friday and decided to remove the clause, which evaluated plant and machinery brought into India at 40% of its value, and has agreed to a few other changes so that manufacturing could shift to India in a big way,” an official aware of the discussions at the meeting told ET.\n", "\n", "ET had reported in its May 11 edition that Apple through its ", "contract manufacturers Wistron", " and Foxconn could shift a significant portion of its manufacturing facility to India under the proposed PLI scheme. However, the iPhone manufacturer had raised concerns regarding certain clauses, including valuation of plant and machinery with the government. The government is also in discussions with a third Apple contract manufacturer, Pegatron, to relocate part of its manufacturing to India, the official said.\n", " \n", "“The irritants have been resolved,” the official added. Through the scheme, India is trying to attract American investment with pressure on US companies now to diversify manufacturing out of China under the ‘China plus one strategy’.\n", "\n", "Among the changes agreed to on Friday were to include the industry in discussions before making any changes to the PLI scheme once these companies have invested and started producing in the country. “Earlier, a clause permitted only the empowered committee to be able to unilaterally change the rules but investors had voiced concerns with this clause,” the official said.\n", "\n", "The other changes made include removal of various caps, including another clause which said the government would release the incentive despite the industry meeting its targets only if it had the money to do so. Instead, a clause on force majeure, which permits the companies to seek relief from the targets in time of natural calamities such as Covid-19, has been added.\n", "The government hopes to attract large-scale ", "smartphone", " manufacturing to India and raise exports out of India to over $100 billion by 2025 from under $3 billion right now.\n", "\n", "“Also, the proposed investors had raised concerns on the excessive business information sought by the government, which has been further watered down,” the official said.\n", "\n", "The official added that depending upon the production targets achieved by the companies in subsequent years, the government could alter the benefits depending upon the performance of companies.\n", "To avail the graded incentives ranging between 4% and 6% over a five-year period, foreign manufacturers will have to produce high-end phones (with freight on board value of more than $200) of more than Rs 4,000 crore over and above their production level in the base year.\n", "\n", "In the second, third, fourth and fifth years, manufacturers will have to produce phones worth Rs 8,000 crore, Rs 15,000 crore, Rs 20,000 crore and Rs 25,000 crore over the base year production value to avail the incentives.\n", "\n", "The scheme, which is likely to be notified next week, will give out incentives to both foreign as well as domestic manufacturers over a period of five years. While the eligibility for foreign investors as well as domestic investors varies, a total of Rs 40,951 crore has been earmarked as incentives for companies, which achieve the production and minimum incentive targets.\n", "\n", " \n", " \n", "\n"]], "tags": ["Apple Inc.", "Flextronics", "local production", "Smartphone", "Oppo", "contract manufacturers wistron", "Wistron Corporation", "Oppo Electronics", "South Korea"]},
{"heading": [["Covid-19: Indian smartphone market to decline by 13-15%"]], "sub_heading": [["IDC has now projected the smartphone market in India could hit as low as 130 million handsets as compared to earlier estimate of 140 million. Counterpoint has just revised its outlook pegging the industry at 137 million from earlier outlook of 142 million.  Last year, India had sold around 154-158 million smartphones."]], "time": [["Last Updated: May 31, 2020, 09.50 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA: Market researchers ", "International Data Corporation", " (", "IDC", ") and ", "Counterpoint Research", " have downward revised their outlook for the Indian ", "smartphone", " market estimating ", "sales", " will decline by 13-15% due to ", "Covid-19", ", making it the first year of decline ever.\n", "\n", "The ", "trackers", " said this is going to be due to recent spate of job and salary cuts whereby consumers will postpone purchases, companies unable to ramp up production impacting supply of models, and the recent increase in goods and services tax (GST) on smartphones from 12-18% making models pricier.\n", "\n", "IDC has now projected the smartphone market in India could hit as low as 130 million handsets as compared to earlier estimate of 140 million. Counterpoint has just revised its outlook pegging the industry at 137 million from earlier outlook of 142 million.\n", "\n", "Last year, India had sold around 154-158 million smartphones and before Covid trackers had expected high single digit growth this year.\n", "\n", "In case of feature phones, the decline in sales is estimated to be a steep 42% from 130 million handsets sold last year to around 75 million with income of this set of consumers badly hit, as per IDC. \n", "\n", "IDC India research director Navkendar Singh said the situation is very volatile and a pessimistic view has been taken due to extended lockdowns, plants not able to operate whereby there are supply issues, and consumers not eager to upgrade handsets. These will impact the replacement market which has been driving smartphone sales since 2017, he said.\n", "\n", "“The sub-Rs 10,000 segment will take a hit, while Rs 10,000-25,000 segment may still sell but will not be able to make-up for the lost ground. The current pent-up demand will taper-off by June,” said Singh.\n", "\n", "Counterpoint’s associate director Tarun Pathak said factories are running at 20-30% capacity and may not pick steam till the Covid-19 curve starts to flatten, may be around July. “Unemployment rate is going up every month and purchases can get postponed to even early 2021,” he said.\n", "\n", "Last year, India surpassed the US to become the second largest smartphone market. The trackers have estimated a pick-up in demand around festive season and if this fails, there will be further hit in overall shipments.\n", "\n", "Sales tracker ", "GfK India", " managing director Nikhil Mathur said there is an optimism for market to positively pick up during October-December festive months.\n", "\n", "“Our studies show Indian consumers are relatively more optimistic as compared to other parts of the world. Some of the technical consumer product purchases are likely to get postponed, but consumers may not cancel them,” he said.\n", "\n"]], "tags": ["Indian smartphone market", "International Data Corporation", "trackers", "GfK India", "Smartphone", "counterpoint research", "idc", "sales"]},
{"heading": [["‘Smartphone sales to fall 15% in 2020’"]], "sub_heading": [["IDC has now projected the smartphone market in India could hit as low as 130 million handsets as compared to earlier estimate of 140 million. Counterpoint has just revised its outlook pegging the industry at 137 million from earlier outlook of 142 million."]], "time": [["Last Updated: Jun 01, 2020, 09.37 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["KOLKATA: Market researchers ", "International Data Corporation", " (", "IDC", ") and ", "Counterpoint Research", " have downward revised their ", "outlook", " for the Indian ", "smartphone", " market estimating ", "sales", " will decline by 13-15% due to Covid-19, making it the first year of decline ever.\n", "\n", "The trackers said this is going to be due to recent spate of job and salary cuts whereby consumers will postpone purchases, companies unable to ramp up production impacting supply of models, and the recent increase in goods and services tax (GST) on smartphones from 12-18% making models pricier.\n", "\n", "IDC has now projected the smartphone market in India could hit as low as 130 million handsets as compared to earlier estimate of 140 million. Counterpoint has just revised its outlook pegging the industry at 137 million from earlier outlook of 142 million.\n", "\n", "Last year, India had sold around 154-158 million smartphones and before Covid trackers had expected high single digit growth this year.\n", "\n", "In case of feature phones, the decline in sales is estimated to be a steep 42% from 130 million handsets sold last year to around 75 million with income of this set of consumers badly hit, as per IDC. \n", "\n", "IDC India research director Navkendar Singh said the situation is very volatile and a pessimistic view has been taken due to extended lockdowns, plants not able to operate whereby there are supply issues, and consumers not eager to upgrade handsets. These will impact the replacement market which has been driving smartphone sales since 2017, he said.\n", "\n", "“The sub-Rs 10,000 segment will take a hit, while Rs 10,000-25,000 segment may still sell but will not be able to make-up for the lost ground. The current pent-up demand will taper-off by June,” said Singh.\n", "\n", "Counterpoint’s associate director Tarun Pathak said factories are running at 20-30% capacity and may not pick steam till the Covid-19 curve starts to flatten, may be around July. “Unemployment rate is going up every month and purchases can get postponed to even early 2021,” he said.\n", "\n", "Last year, India surpassed the US to become the second largest smartphone market. The trackers have estimated a pick-up in demand around festive season and if this fails, there will be further hit in overall shipments.\n", "\n", "Sales tracker GfK India managing director Nikhil Mathur said there is an optimism for market to positively pick up during October-December festive months.\n", "\n", "“Our studies show Indian consumers are relatively more optimistic as compared to other parts of the world. Some of the technical consumer product purchases are likely to get postponed, but consumers may not cancel them,” he said.\n", "\n"]], "tags": ["International Data Corporation", "Indian smartphone market", "kolkata", "Smartphone", "counterpoint research", "idc", "outlook", "sales"]},
{"heading": [["Construction work of Vivo facility stopped"]], "sub_heading": [["Vivo, India's No. 2 smartphone brand, has stopped construction work at its industrial park at Greater Noida after two people working there tested Covid-19 positive. "]], "time": [["Last Updated: May 19, 2020, 08.53 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: ", "Vivo", ", India's No. 2 smartphone brand, has stopped construction work at its industrial park at Greater Noida after two people working there tested ", "Covid-19 positive", ". The development comes a day after rival ", "Oppo", " had to shut its manufacturing plant in the same area after nine of its employees tested positive for coronavirus.\n", "\n", "\"The company (Vivo) had got 18 employees tested in Healthians Lab, Gurgaon, out of which 16 negative and two positive have been declared. The company has voluntarily shut down its operations, for the time being, the incident commander has orders for the sealing of specific area of the premises and sanitation process is underway,\" according to a health bulletin by Gautam Budh Nagar released on Monday evening.\n", "\n", "China’s Vivo, however, clarified that the incident took place at the industrial park, which is the construction site of its new factory and the location was being completely managed by a thirdparty construction company. “No Vivo employee has tested positive till date and we are taking all precautionary measures adhering to all government guidelines,” a Vivo spokesperson told ET.\n", "\n", "The spokesperson added that Vivo’s current operational factory is 15 km away from the construction site, and is running at 30% of its capacity as per the norms stated by Greater Noida authorities. Vivo India was allotted a 169-acre land parcel by the Yamuna Expressway Industrial Authority, Greater Noida. It is planning to invest `7,500 crore over the next few years to sharply expand its production capacities, initially for the India market and later for exports.\n", "\n"]], "tags": ["Gautam Budh Nagar district", "Oppo", "China", "Vivo"]},
{"heading": [["India unveils Rs 50,000 crore schemes to attract electronics makers"]], "sub_heading": [["IT and Telecom Minister Ravi Shankar Prasad said India will initially aim to attract top 5 global mobile manufacturing companies and also promote five local companies that will be identified through a screening process. "]], "time": [["Last Updated: Jun 02, 2020, 06.33 PM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW DELHI: Union Minister ", "Ravi Shankar Prasad", ", on Tuesday, unveiled the guidelines for ", "electronics manufacturing", " schemes with an aim to strengthen domestic manufacturing of five global and five Indian mobile phone makers.\n", "\n", "The three Schemes namely, the Production-Linked Incentive Scheme (PLI), Scheme for Promotion of Manufacturing of Electronic Components and Semiconductors (SPECS) and Modified Electronics Manufacturing Clusters (EMC 2.0) Scheme, which were notified by the Ministry of Electronics and IT (MietY) on April 1, have a total outlay of Rs 50,000 crore.\n", "\n", "The PLI Scheme shall extend an incentive of 4% to 6% on incremental sales (over base year) of goods manufactured in India and covered under the target segments, to eligible companies, for a period of five years subsequent to the base year. \n", "\n", "\"Many years later, when you will look back, you will find that today's day will be a pathbreaking day because under the Aatma Nirbhar Bharat concept of the Prime Minister, our attempt is to build some champion sectors who will drive India's growth and create jobs. I was fortunate work with Ministry of Electronics and IT under the leadership of the Minister (Prasad) and want to compliment his leadership. He was very clear in his perspective and everyone in his team worked with dedication for this,\" ", "Niti Aayog", " CEO ", "Amitabh Kant", " said Tuesday.\n", "\n", "The Manufacturers Association for Information Technology (MAIT) welcomed the government’s announcement which will boost local handset production and urged the government to extend the PLI scheme to other electronics.\n", "\n", "“The mobile manufacturing industry is very positive about the move and this scheme will help meet the targets under NPE 2019,” said Nitin Kunkolienker, President-MAIT. “This will certainly lead to companies moving their supply chains to India. This will not only spur manufacturing but will make India an export-led global manufacturing hub for mobile phones.”\n", "\n", "The apex body of IT manufacturers said the interruption in the global supply chain due to the pandemic gives India an opportunity to increase export-led manufacturing and broadening the scope of PLI to all other major sectors of electronics such as Consumer electronics, ICT, CPE products, Computers, Medical Electronics etc. will be a game-changer.\n", "\n", "The SPECS shall provide financial incentive of 25% on capital expenditure for the identified list of electronic goods, i.e., electronic components, semiconductor/ display fabrication units, Assembly, Test, Marking and Packaging (ATMP) units, specialized sub-assemblies and capital goods for manufacture of aforesaid goods. \n", "\n", "The EMC 2.0 shall provide support for creation of world class infrastructure along with common facilities and amenities, including Ready Built Factory (RBF) sheds / Plug and Play facilities for attracting major global electronics manufacturers, along with their supply chains.\n", "\n", "The respective portals to receive applications for the three schemes have been made live by the IFCI, a public-sector NBFC.\n", "\n", "According to data from MeitY, production of mobile handsets in 2018-19 has reached 29 crore units worth Rs. 1.70 Lakh crore from just 6 crore units worth Rs. 19,000 crore in 2014. While the exports of electronics has increased from Rs. 38,263 crore in 2014-15 to Rs. 61,908 crore in 2018-19, India’s share in global electronics production has reached 3% in 2018 from just 1.3% in 2012.\n", "\n", "The schemes are expected to increase production of mobile phones and their parts to around Rs.10,00,000 crore by 2025 and generate around 5 lakh direct and 15 lakh indirect jobs, the government said.\n", "\n", "\n"]], "tags": ["electronics manufacturing", "global mobile device makers", "Niti Aayog", "Telecom", "Ravi Shankar Prasad", "amitabh kant"]},
{"heading": [["Google issued 1,755 warnings to users globally on govt-backed attackers in April"]], "sub_heading": [["In a blog post, Google said its Threat Analysis Group (TAG) tracks more than 270 targeted or government-backed groups from over 50 countries. It, however, did not clarify which governments have targeted these users."]], "time": [["Last Updated: May 29, 2020, 03.18 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "Google", " sent out 1,755 warnings to users globally, including up to 100 in India, in April whose accounts were the target of \"government-backed attackers\".\n", "\n", "In a blog post, Google said its ", "Threat Analysis Group", " (TAG) tracks more than 270 targeted or government-backed groups from over 50 countries. It, however, did not clarify which governments have targeted these users.\n", "\n", "Google shared recent findings on government-backed phishing, threats and disinformation, as well as a new bulletin to share information about actions it has taken against accounts that it attributes to coordinated influence campaigns.\n", "\n", "\"Last month, we sent 1,755 warnings to users whose accounts were targets of government-backed attackers,\" it said.\n", "\n", "A heatmap on \"Distribution of targets of government-backed phishing attempts in April 2020\" showed that 51-100 users in India had received such warnings.\n", "\n", "The tech giant said government-backed or state-sponsored groups have different goals in carrying out their attacks.\n", "\n", "\"...Some are looking to collect intelligence or steal intellectual property; others are targeting dissidents or activists, or attempting to engage in coordinated influence operations and disinformation campaigns,\" it added.\n", "\n", "The company emphasised that its products are designed with robust built-in ", "security features", ", like Gmail protections against phishing and ", "Safe Browsing in Chrome", ", but it still dedicates significant resources to developing new tools and technology to help identify, track and stop this kind of activity.\n", "\n", "\"In addition to our internal investigations, we work with law enforcement, industry partners, and third parties like specialized security firms to assess and share intelligence,\" it said.\n", "\n", "Outlining steps taken by the company, Google said it swiftly removes such content from its platforms and terminates these actors' accounts. It also routinely exchanges information and shares its findings with others in the industry, it added.\n", "\n", "Google said in March, it terminated three advertising accounts, one AdSense account, and 11 YouTube channels as part of its actions against a coordinated influence operation linked to India.\n", "\n", "The campaign, which was sharing messages in English supportive of Qatar, was consistent with similar findings reported by ", "Facebook", ", it added.\n", "\n", "\"Since March, we've removed more than a thousand YouTube channels that we believe to be part of a large campaign and that were behaving in a coordinated manner. These channels were mostly uploading spammy, non-political content, but a small subset posted primarily Chinese-language political content...,\" it said. \n", "\n"]], "tags": ["facebook", "security features", "threat analysis group", "google", "Safe Browsing in Chrome"]},
{"heading": [["Offline handset retailers bet on online platform to take on e-commerce, post Covid era"]], "sub_heading": [["Offline handset retailers are converging their online and offline channels, turning to hyperlocal business models to diversify and better compete with e-commerce players."]], "time": [["Last Updated: Jun 02, 2020, 10.04 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Offline handset retailers are converging their online and offline channels, turning to hyperlocal business models to diversify and better compete with e-commerce players. Retailers said that while sales have been strong since the easing of the lockdown due to pent-up demand, limited supply of stocks is turning out to be a dampener.\n", "\n", "Offline handset sellers, especially in cities with high Covid-19 infections, have started online portals to receive orders and deliver smartphones from neighborhood stores in less than four hours. Regional retail chains, including Mumbai-based O-line-O, Delhi-based ", "Gomobile", ", and Delhi-Kolkata based ", "Hotspot", ", have started their online portals that connect customers to their nearest retailer via Whatsapp or ", "Facebook", ".\n", "\n", "“Covid has taken us five years ahead in time,” said Arvinder Khurana, president of All India Mobile Retailers Association. “Now, retailers have a sense that the future is online and they need to go hyperlocal to battle with e-commerce players.”\n", "\n", "These moves by offline retailers come ahead of smartphone brands including Samsung, Oppo, Vivo and ", "Xiaomi", ", who are still in the initial stages of building a nationwide O20 (offline-to-online) solution. “A consumer is able to shop from a multi-brand catalogue from here and the integration is seamless and much faster than a single brand portal since there is already an established network,” said Upasana Joshi, associate research manager at International Data Corporation.\n", "\n", "Meanwhile, long format chains such as Vijay Sales and Sangeetha, which had negligible presence in e-commerce, said they are seeing 5x and 10x jump in online sales, respectively. However, the surge in sales is the outcome of pent-up demand playing out that is bound to come down by next month, analysts and industry executives believe. “Getting stocks is a big issue currently. Had it been normal, I would probably say my business is better post Covid, both online and offline,” said Chandu Reddy, director, Sangeetha Mobiles. “But I am sure it is the lockdown pent-up demand and is bound to come down in a few weeks.”\n", "\n", "However, the hyperlocal ecosystem for mobile phone retail is here to stay. Vibhooti Prasad, MD & CEO of 75 O-line-O stores in Mumbai, Navi Mumbai and Thane, said he has partnered with a courier agency to deliver phones during lockdown but plans to build a supply chain with its workforce post Covid. The portal is currently serving 300 orders per day. “We want to scale up the hyperlocal model to more cities in a way that our in-store employees double in as delivery boys and we are able to control job losses in the sector,” Prasad told ET.\n", "\n", "Spice Retail-owned Hotspot, a decade-and-a-half-old brand which owns 100 stores in Delhi and Kolkata, started home delivery and will soon integrate a payments gateway on its website. “Our strategy here on is that we will not deliver products inter-state,” said Atul Kapoor, CEO of Hotspot. “We will be a city-based brand with both online and offline presence.” Kapoor said that the company is in the process to acquire 60 stores in Himachal Pradesh this year.\n", "\n"]], "tags": ["Spice Digital", "Xiaomi", "HotSpot", "facebook", "gomobile"]},
{"heading": [["Samsung launches affordable Galaxy M11, M01 smartphones in India"]], "sub_heading": [["Galaxy M11 comes in two variants. The 3GB+32GB will be priced at Rs 10,999 while the higher 4GB+64GB variant will be available for Rs 12,999."]], "time": [["Last Updated: Jun 02, 2020, 01.39 PM IST"]], "publisher": [["IANS"]], "article": [["Samsung on Tuesday launched two new smartphones, Galaxy M11 and ", "Galaxy M01", ", with powerful batteries under Rs 15,000 in India.\n", "\n", "Galaxy M11 comes in two variants. The 3GB+32GB will be priced at Rs 10,999 while the higher 4GB+64GB variant will be available for Rs 12,999.\n", "\n", "Galaxy M11 will be available in metallic blue, black and violet colours.\n", "\n", "Priced at Rs 8,999, the Galaxy M01 smartphone will come in one 3GB+32GB variant, in black, blue and red colours.\n", "\n", "Galaxy M11 and M01 will be available across all Samsung offline stores as well as on Samsung.com and e-commerce portals such as Amazon.in and ", "Flipkart", " starting Tuesday, the company said in a statement.\n", "\n", "While Galaxy M11 comes with best-in-class Infinity-O display and 5000mAh battery, Galaxy M01 houses 4000mAh battery, Infinity V display and dual camera.\n", "\n", "\"With the launch of Galaxy M11 and Galaxy M01, we are delighted to take the legacy forward to the next level. The new proposition offers unprecedented style and experience to our aspirational ", "Gen Z", " and millennial consumers, while delivering the best of everything in their device,\" said Aditya Babbar, Director, Mobile Business, Samsung India.\n", "\n", "Galaxy M11 comes with a 6.4-inch HD+ Infinity-O display, 15W fast charger and features a rear fingerprint scanner for device security. The storage is expandable to 512GB via a Micro-SD card.\n", "\n", "The triple rear camera on Galaxy M11 has 13MP main sensor, 5MP ultra-wide camera with 115 degree field of view and a dedicated 2MP depth camera with Live Focus feature. The device sports an 8MP front camera for bright selfies.\n", "\n", "M11 comes has '", "Alive Keyboard", "' feature, a 'Make for India' innovation that allows users to chat effortlessly using intelligent keyboard suggestions in multiple Indian languages including Hindi, Marathi and Telugu.\n", "\n", "Galaxy M01 comes with 5.7-inch HD+ Infinity-V display and a 13/2 MP dual rear camera for taking clear photos. The device has a 5MP front-facing camera for selfies.\n", "\n", "Galaxy M01 comes with face unlock feature and its storage is expandable to 512GB via Micro SD.\n", "\n", "Both smartphones come with Dolby ATMOS technology that gives a surround sound experience for users.\n", "\n"]], "tags": ["samsung galaxy m11 price", "Gen Z", "Samsung Galaxy M01 Price", "Alive Naturalsound Records", "samsung m11", "Flipkart", "galaxy m01", "alive keyboard"]},
{"heading": [["Nokia shuts plant in south India after 42 test positive for coronavirus"]], "sub_heading": [["Nokia did not disclose how many workers at the plant in Sriperumbudur in the southern state of Tamil Nadu tested positive, but a source familiar with the matter said they were at least 42. The outbreaks at Nokia and OPPO underline the challenges of easing the two-month nationwide lockdown."]], "time": [["Last Updated: May 26, 2020, 10.25 PM IST"]], "publisher": [["Reuters"]], "article": [["NEW DELHI: ", "Nokia", " last week suspended operations at a ", "telecoms", " gear manufacturing plant in southern India, the company said on Tuesday, after some employees tested positive for COVID-19.\n", "\n", "Nokia did not disclose how many workers at the plant in Sriperumbudur in the southern state of ", "Tamil Nadu", " tested positive, but a source familiar with the matter said they were at least 42.\n", "\n", "The company said it had already implemented measures such as social distancing and changes to canteen facilities.\n", "\n", "The factory had begun operations in a restricted manner over the past few weeks, Nokia said in a statement, after India eased the world's biggest ", "lockdown", " to kick-start its ", "economy", " which has been pummelled by the shutdown.\n", "\n", "\"We hope to resume operations soon at a restricted level with skeletal staff strength,\" Nokia added.\n", "\n", "Chinese smartphone maker ", "OPPO", " last week suspended operations at a recently re-opened plant on the outskirts of Indian capital New Delhi after at least nine workers tested positive for the novel coronavirus.\n", "\n", "The outbreaks at Nokia and OPPO underline the challenges of easing the two-month nationwide lockdown.\n", "\n", "India on Tuesday recorded a total of 145,380 coronavirus infections and a death toll of 4,167, comparatively low figures for the world's second-most populous country. \n", "\n"]], "tags": ["Nokia", "Oppo", "tamil nadu", "lockdown", "telecoms", "economy"]},
{"heading": [["India using public digital infra to achieve economic goals at home, connect globally: Jawed Ashraf"]], "sub_heading": [["India's High Commissioner to Singapore Jawed Ashraf further noted that building digital connectivity and partnerships with Singapore and ASEAN countries, is a priority for India and highlighted how technology has been used effectively to achieve public policy goals in the country during COVID-19 disruptions."]], "time": [["Last Updated: May 29, 2020, 12.15 PM IST"]], "publisher": [["PTI"]], "article": [["SINGAPORE: India is using its public digital infrastructure, to take a leap into digital economy in a bid to achieve economic goals in the country and connect globally, India's High Commissioner to Singapore ", "Jawed Ashraf", " has said.\n", "\n", "The envoy further noted that building ", "digital connectivity", " and partnerships with Singapore and ASEAN countries, is a priority for India and highlighted how technology has been used effectively to achieve public policy goals in the country during COVID-19 disruptions.\n", "\n", "“We are using our public digital infrastructure, rated as the largest in the world, to take a leap into digital economy to achieve our public policy and economic goals at home and connect globally,\" Ashraf told an online Fintech forum this week.\n", "\n", "He highlighted India's several initiatives with Singapore such as interoperability of ", "payment systems", ", with Singapore being the first country to see the launch of RuPAY in 2018 and BHIM QR at the Singapore Fintech Festival last year, and said that Singapore's NETS cards likely to be accepted in India soon.\n", "\n", "The two sides are also working on connecting India's Unified Payment Interface (UPI) with Singapore's FAST (Fast And Secure Transfers) system, which will make remittances to India seamless and efficient, he told some 700 participants from 34 countries at the \"SFF Green Shoots Series: Cross-border collaboration between the ASEAN region and India, UK, Denmark and Sweden\" held from Singapore via zoom on Tuesday.\n", "\n", "India is also collaborating with Singapore on building a digital hub, Business Sans Border, that will connect Micro, Small & Medium Enterprises (MSME) companies in India online to global supply chain and markets, particularly in the ASEAN market.\n", "\n", "Commenting on the role of technology and startups in the COVID-19 situation, he said that technology has been used effectively to achieve public policy goals.\n", "\n", "Jawed Ashraf pointed out that USD 5 billion was transferred to 160 million beneficiaries into their accounts in the first three weeks of its launch earlier this month.\n", "\n", "Aarogya Setu, a ", "contact tracing", " app, has helped keep up with managing the spread of coronavirus across the country.\n", "\n", "In home-based learning, as mandated in managing the COVID-19 spread, e-vidya and Diksha have drawn 640 million hits since its launch on March 24, 2020.\n", "\n", "New initiatives like portability of e-ration cards for migrant workers will cover 640 million beneficiaries by August 2020 and the entire country by March 2021.\n", "\n", "Elsewhere, e-trading for agriculture sector and e-market place for MSMEs are being planned.\n", "\n", "Digital technology has been an important instrument in the past five years for economic transformation and for empowerment, access and inclusion, Ashraf said adding that it will play a key role in economic recovery after the pandemic. \n", "\n"]], "tags": ["aarogya setu", "Jawed Ashraf", "Contact tracing", "payment systems", "digital connectivity", "Association of Southeast Asian Nations", "Micro, Small & Medium Enterprises", "Unified payments interface"]},
{"heading": [["UK plans new 5G club of 10 democracies, including India: Report"]], "sub_heading": [["The move to speed up such a club comes as the UK launched an inquiry into Huawei's involvement in the country's mobile network upgrade in the wake of US sanctions against the company."]], "time": [["Last Updated: May 29, 2020, 07.15 PM IST"]], "publisher": [["PTI"]], "article": [["LONDON: The British government has approached the US with the prospect of creating a 5G club of 10 democracies, including India, amid growing security concerns related to Chinese telecom giant ", "Huawei", ", according to a UK media report. \n", "\n", " A so-called \"D10\" club of democratic partners, including ", "G7 countries", " - UK, US, Italy, Germany, France, Japan and Canada - plus Australia, South Korea and India will aim to create alternative suppliers of 5G equipment and other technologies to avoid relying on China, 'The Times' reported. \n", "\n", " ", "The move", " to speed up such a club comes as the UK launched an inquiry into Huawei's involvement in the country's mobile network upgrade in the wake of US sanctions against the company. \n", "\n", " \"We need new entrants to the market. That was the reason we ended up having to go along with Huawei at the time,\" the newspaper quoted a UK government source as saying. \n", "\n", " Nokia and ", "Ericsson", " are the only European suppliers of 5G infrastructure and experts say that they cannot provide 5G kit as quickly or as cheaply as Huawei. \n", "\n", " Britain has labelled Huawei a \"high-risk\" vendor and therefore its involvement in the UK's 5G upgrade comes with a 35 per cent market cap, including a ban on its participation in the sensitive \"core\" of the network. \n", "\n", " The review into Huawei, launched last week by the UK\"s ", "National Cyber Security Centre", ", followed the announcement of US sanctions to block the sale of American chips to the company. \n", "\n", " UK security officials fear that the ban will prompt China to use cheaper, less secure technologies, instead of verified US versions. \n", "\n", " Officials are, meanwhile, examining proposals to curb the installation of Huawei kit in the 5G network from 2023. \n", "\n", " According to the newspaper, increasing the partnership of like-minded democracies forms part of the ongoing reappraisal of the Chinese firm's involvement in the UK. \n", "\n", " The US in recent months has increased its action against Huawei, China's first global tech brand and a maker of network equipment and smartphones, preventing it from doing business in the US, as it believes the company known for its technological advancement in 5G is being used by the Chinese leadership to serve their interest. \n", "\n", " The Trump administration says Huawei is a security risk, which the company denies, and is trying to persuade European and other allies to shun its technology for the next-generation telecom networks. \n", "\n", " China has accused the US of raising phony security concerns to hurt a rising competitor to American tech companies.\n"]], "tags": ["The move", "huawei", "National Cyber Security Centre", "ericsson", "G7 countries"]},
{"heading": [["Handset retailers’ earnings hit as mobile brands erase sales incentive"]], "sub_heading": [["While the removal of sales targets would offer some relief to beleaguered retailers who are facing a near washout in sales due to Covid-induced restrictions, this also means the brands have done away with the incentives they used to offer on meeting such sales targets, say industry players."]], "time": [["Last Updated: May 25, 2020, 06.38 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: ", "Handset brands", " such as Samsung, Vivo and Oppo have withdrawn ", "monthly sales targets", " for their ", "offline retail partners", ", and also changed the margin structure for the stores in the wake of dwindling demand for mobile phones due to the economic impact of COVID-19 crisis on consumer spending.\n", "\n", "While the removal of sales targets would offer some relief to ", "beleaguered retailers", " who are facing a near washout in sales due to Covid-induced restrictions, this also means the brands have done away with the incentives they used to offer on meeting such sales targets, say industry players.\n", "\n", "Brick-and-mortar sellers, who used to get an incentive upto 10% of their monthly sales value until March, will now receive an incentive at a flat rate of 3% from the likes of top brands ", "Vivo, Oppo", " and Samsung, according to multiple retailers ET spoke to.\n", "\n", "“This means a further reduction of approximately 25% in our monthly earnings at a time when costumer demand for smartphones is already below optimum levels,” said a Delhi-based retailer who did not wish to be named.\n", "\n", "The difference between ", "MRP", " and distributor price, which on average makes for a margin of 4%, has however remained same.\n", "\n", "\n", "\n", "Emails sent to Vivo, Oppo and Samsung did not illicit any response till press time. Other brands including India’s top brand ", "Xiaomi", ", ", "Realme", " and ", "OnePlus", " were already offering an incentive between 1%-3% of monthly sales value and haven't made any changes, as per industry sources. \n", "\n", "In an emailed response to ET, Xiaomi said it hasn’t made any changes while Realme and OnePlus didn’t respond.\n", "\n", "The change in strategy for some brands comes amid severe losses due to the nationwide lockdown since March 24. As per estimates by market intelligence firm Counterpoint Research, nearly 20 million handset devices were expected to be sold during the 40-day lockdown period cumulatively in offline and online channels. At an average selling price of $170, it accounts for a total loss of Rs 14,200 crore revenue for smartphone brands.\n", "\n", "While online channel functions according to number of orders received, the target-based strategy is the major driver of sales in the offline segment, analysts say. \n", "\n", "“Standalone offline retailers are the worst affected during the crisis in the entire handset ecosystem,” said Arvinder Khurrana, president of All India Mobile Retailers Association (AIMRA), which represents 1.5 lakh standalone mobile retailers. “Apart from the lockdown restrictions we are burdened with challenges such as GST increase, shortage of devices, reduction in profit margins, cash-and-carry or no credit period by few distributors etc.”\n", "\n", "He pointed out that retailers are opening stores for lesser working hours and on alternate days in some cities but its liabilities towards operational expenses such as salaries, rent, bank interest and power bills will be for 30 days of the month.\n", "\n", "“The disruption has caused retailers to adopt the hyperlocal online-to-offline business model to somewhat shield themselves from factors such as degrowth in sales and negligible customer walk-ins,” said Upasana Joshi, associate research manager at ", "International Data Corporation", ".\n", "\n"]], "tags": ["handset brands", "monthly sales targets", "beleaguered retailers", "Xiaomi", "International Data Corporation", "realme", "vivo, oppo", "offline retail partners", "mrp", "oneplus"]},
{"heading": [["Supplies of smartphones, tablets, laptops hit due to lower production & distribution workforce"]], "sub_heading": [["Two senior industry executives said brands like Apple, Xiaomi, Oppo, Vivo and Realme are facing supply issues with operational plants running at 30-35% capacity and several warehouses are not able to operate normally."]], "time": [["Last Updated: May 26, 2020, 09.14 AM IST"]], "publisher": [[", ET Bureau"]], "article": [[" Shortage of labour and social distancing norms have been hampering supply of products to the market to meet the pent up demand as makers of smartphones, tablets and laptops are unable to scale up production and distributors work way below capacity.\n", "\n", "Two senior industry executives said brands like ", "Apple", ", ", "Xiaomi", ", ", "Oppo", ", ", "Vivo", " and Realme are facing supply issues with operational plants running at 30-35% capacity and several warehouses are not able to operate normally.\n", "\n", "For imported products like Apple’s iPad and Mac computers, and laptops of other brands, the entire supply-chain is impacted –from clearance at customs, warehouses to the distribution system. The Oppo plant in Greater Noida, which manufactures for Oppo, Realme and OnePlus, continues to remain shut after a few workers were found infected with Covid-19 a week back, industry executives said.\n", "\n", "In contrast, the fast moving consumer goods (", "FMCG", ") industry has managed to scale up capacities at 60-65% with 40-50% workforce in the plants producing products and packs which require lower manpower but still fall short of 40% of the demand.\n", "\n", " \n", "\n", "Retailers said smartphone brands are unable to meet demand for entry-level models which has surged post-Covid, while supplies of tablets and laptops are also erratic.\n", "\n", "“Retailers have almost exhausted their stock of sub-Rs 15,000 smartphones where lies the maximum demand and supplies are not coming at all,” said Arvinder Khurana, president of All India Mobile Retailers Association (AIMRA).\n", "\n", "On Monday, AIMRA wrote to brands to prioritise stock for handsets priced up to Rs 15,000 to retailers as consumer demand for this price segment is high with average selling price coming down due to cautious sentiments.\n", "\n", "The government has allowed up to 50% workforce in factories and strict implementation of social distancing, sanitisation and checking of body temperature of workers before entry. However, the biggest problem for the industry is that they are not able to scale up production due to these norms and non-availability of migrant workers.\n", "\n", "Xiaomi India spokesperson said India’s largest smartphone maker was working with local authorities to secure approvals to scale up manpower and production to meet the demand while ensuring social distancing on the factory floor, safety and hygiene measures.\n", "\n", "Xiaomi expects to get back to normal in early July-September quarter if spread of Covid-19 is controlled. Realme said the main constraints in May and June will be more on supply than demand. Apple, Vivo and Oppo did not respond to queries.\n", "\n", "Packaged food companies like Parle and Britannia have asked the government to relax the 50% norm for them\n", "\n", "India's largest food company Parle Products’ category head, Mayank Shah, said with the 50% cap on workforce, it is not able to service almost 40% of the demand.\n", "\n", "Angshu Mallick, deputy chief executive of Adani Wilmar, which sells oil and pulses under the Fortune brand, said another big issue has been delivery of products from distributors to retailers.\n", "\n", "“Most distributors are short staffed to operate at normal level of efficiency and are also sceptical on payment terms offered to retailers. As a result, they are able to service just 50% of the store network at present,\" he said.\n", "\n"]], "tags": ["apple", "Xiaomi", "Oppo", "Vivo", "fmcg"]},
{"heading": [["Trump's move against social media cos unlikely to change India's stand"]], "sub_heading": [["The Indian government has been in the process of finalising amendments to the IT Intermediary Guidelines, which will require platforms to verify their users in order to discourage anonymous posting and need companies like WhatsApp to trace the origin of unlawful messages on court orders, among a host of measures to pin greater responsibility on companies."]], "time": [["Last Updated: May 29, 2020, 08.08 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["NEW DELHI: US President ", "Donald Trump", "’s executive order diluting the immunity enjoyed by ", "social media companies", " is unlikely to change India's stand on making firms such as ", "Twitter", " and ", "Facebook", " more responsible and accountable for content posted on their platforms. \n", "\n", "India has been facing a challenge of misinformation on a large scale and has had to deal with situations such as mob lynching due to unchecked ", "hate speech", " and fake news on social media. This has made ", "New Delhi", " propose key policy changes to legislations that put the onus of checking content largely on social media companies. \n", "\n", "India and ", "the United States", ", though, are reconsidering the immunity for different reasons, said Udbhav Tiwari, policy advisor with Mozilla. \n", "\n", "“While India wants to compel platforms to carry out better content moderation and cooperate with law enforcement, the US seems to think that current content moderation practices are negatively impacting political neutrality and wants to rein in such practices,” Tiwari said. \n", "\n", "Indian policymaking is unlikely to be immediately influenced since most large social media companies are based in the US and their product policies are made keeping in mind American laws, he said, although this policy change may have “far reaching ramifications globally” if it goes through. \n", "\n", "There is also a key difference in US and Indian law on the kind of actions for which immunity is granted to social media platforms. \n", "\n", "The US provides Good Samaritan protections under Section 230(c) of the Communications Decency Act by explicitly allowing intermediaries to restrict content on certain grounds. \n", "\n", "On the other hand, India provides immunity to intermediaries under Section 79(2) of the IT Act, only on the condition that platforms do not modify content in any form. India does not provide any explicit Good Samaritan exceptions. \n", "\n", "Industry experts expect Trump’s executive order to face widespread legal challenges. \n", "\n", "The order, signed on Thursday, came after Twitter flagged Trump’s tweets with a fact check warning, alerting users to his claims about mail-in ballots. \n", "\n", "“They’ve had unchecked power to censor, restrict, edit, shape, hide, alter virtually any form of communication between private citizens or large public audiences,” Trump said while signing the order. “There is no precedent in American history for so small a number of corporations to control so large a sphere of human interaction.” \n", "\n", "Twitter has been unrelenting in its approach though and called the order an attempt to unilaterally erode and threaten the future of online speech and internet freedom. \n", "\n", "The Indian government has been in the process of finalising amendments to the IT Intermediary Guidelines, which will require platforms to verify their users in order to discourage anonymous posting and need companies like ", "WhatsApp", " to trace the origin of unlawful messages on court orders, among a host of measures to pin greater responsibility on companies for the content on their platforms. \n", "\n", "Governments across the world are battling with the common problem of how to regulate social media, said a top government official. \n", "\n", "“This episode highlights concerns of accountability and proliferation of fake news on social media platforms. Suitable legal regimes are evolving across the world and this seems to be one approach to it,” the official said. \n", "\n", "Although companies are encouraged to fact check posts, the question of who runs those fact checks and who the fact checkers will be answerable to will be possible issues, he added. Once platforms start modifying or filtering content, challenges around why only one kind of content is flagged will also crop up, said the official. \n", "\n", "Prasanto K Roy, a tech policy expert said that platforms rely on algorithms to moderate content, letting them screen millions of posts in real time, with human intervention only for escalations. It also allows a semblance of fairness and consistency, and plausible deniability. “The moment firms start blocking or restricting major handles, things can explode. Imagine the backlash in India if Twitter did to a Modi tweet what they did to Trump’s tweet?” he added. Twitter executives were summoned to the Parliamentary IT committee in February 2019 after a pro-government handle was blocked for abuse, and there was outrage when ", "Jack Dorsey", " didn’t personally attend, said Roy.\n", "\n", "Even as the US wants no interference in the name of security of its citizens and free speech, India wants more monitoring in the name of security of its citizens, and this is a classic dilemma, a former top bureaucrat told ET.\n", "\n"]], "tags": ["Social media companies", "WhatsApp", "Twitter", "New Delhi", "facebook", "legal immunity", "Jack Dorsey", "the United States", "hate speech", "Donald Trump"]},
{"heading": [["Donald Trump's social media diktat may not shift India’s stand"]], "sub_heading": [["India has been facing a challenge of misinformation on a large scale and has had to deal with situations such as mob lynching due to unchecked hate speech and fake news on social media."]], "time": [["Last Updated: May 30, 2020, 02.29 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: US President ", "Donald Trump", "’s executive order diluting the immunity enjoyed by ", "social media", " companies is unlikely to change India's stand on making firms such as Twitter and ", "Facebook", " more responsible and accountable for content posted on their platforms.\n", "\n", "India has been facing a challenge of misinformation on a large scale and has had to deal with situations such as mob lynching due to unchecked ", "hate speech", " and fake news on social media. This has made New Delhi propose key policy changes to legislations that put the onus of checking content largely on social media companies.\n", "\n", "India and the United States, though, are reconsidering the immunity for different reasons, said Udbhav Tiwari, policy advisor with Mozilla.\n", "\n", "“While India wants to compel platforms to carry out better content moderation and cooperate with law enforcement, the US seems to thinks that current content moderation practices are negatively impacting political neutrality and wants to rein in such practices,” Tiwari said.\n", "\n", "Indian policymaking", " is unlikely to be immediately influenced since most large social media companies are based in the US and their product policies are made keeping in mind American laws, he said, although this policy change may have “far reaching ramifications globally” if it goes through.\n", "\n", "There is also a key difference in US and Indian law on the kind of actions for which immunity is granted to social media platforms.\n", "\n", "The US provides Good Samaritan protections under Section 230(c) of the Communications Decency Act by explicitly allowing intermediaries to restrict content on certain grounds.\n", "\n", "On the other hand, India provides immunity to intermediaries under Section 79(2) of the IT Act, only on the condition that platforms do not modify content in any form. India does not provide any explicit Good Samaritan exceptions.\n", "\n", "Industry experts expect Trump’s executive order to face widespread legal challenges.\n", "\n", "The order, signed on Thursday, came after Twitter flagged Trump’s tweets with a fact check warning, alerting users to his claims about mail-in ballots.\n", "\n", "“They’ve had unchecked power to censor, restrict, edit, shape, hide, alter virtually any form of communication between private citizens or large public audiences,” Trump said while signing the order. “There is no precedent in American history for so small a number of corporations to control so large a sphere of human interaction.”\n", "\n", "Twitter has been unrelenting in its approach though and called the order an attempt to unilaterally erode and threaten the future of online speech and internet freedom.\n", "\n", "The Indian government has been in the process of finalising amendments to the IT Intermediary Guidelines, which will require platforms to verify their users in order to discourage anonymous posting and need companies like WhatsApp to trace the origin of unlawful messages on court orders, among a host of measures to pin greater responsibility on companies for the content on their platforms.\n", "\n", "Governments across the world are battling with the common problem of how to regulate social media, said a top government official.\n", "\n", "“This episode highlights concerns of accountability and proliferation of fake news on social media platforms. Suitable legal regimes are evolving across the world and this seems to be one approach to it,” the official said.\n", "\n", "Although companies are encouraged to fact check posts, the question of who runs those fact checks and who the fact checkers will be answerable to will be possible issues, he added. Once platforms start modifying or filtering content, challenges around why only one kind of content is flagged will also crop up, said the official.\n", "\n", "Prasanto K Roy, a tech policy expert said that platforms rely on algorithms to moderate content, letting them screen millions of posts in real time, with human intervention only for escalations. It also allows a semblance of fairness and consistency, and plausible deniability. “The moment firms start blocking or restricting major handles, things can explode. Imagine the backlash in India if Twitter did to a Modi tweet what they did to Trump’s tweet?” he added. Twitter executives were summoned to the Parliamentary IT committee in February 2019 after a pro-government handle was blocked for abuse, and there was outrage when Jack Dorsey didn’t personally attend, said Roy.\n", "\n", "Even as the US wants no interference in the name of security of its citizens and free speech, India wants more monitoring in the name of security of its citizens, and this is a classic dilemma, a former top bureaucrat told ET. \n", "\n", "\n"]], "tags": ["Social media policies", "facebook", "indian policymaking", "Twitter fact check", "hate speech", "Donald Trump", "social media"]},
{"heading": [["Scammers target Google Docs and Microsoft Sway to steal user credentials: Barracuda Networks"]], "sub_heading": [["Of the nearly 100,000 form-based attacks detected between January 1 and April 30, Google file sharing and storage websites were used in 65% of attacks, making up 4% of all spear-phishing attacks in the first four months of 2020."]], "time": [["Last Updated: May 29, 2020, 05.41 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Pune: Security solutions provider Barracuda Networks said its researchers have identified a new type of brand impersonation attack that is disproportionately using Google-branded sites to trick victims into sharing login credentials.\n", "\n", "Of the nearly 100,000 form-based attacks detected between January 1 and April 30, ", "Google", " file sharing and storage websites were used in 65% of attacks, making up 4% of all spear-phishing attacks in the first four months of 2020.\n", "\n", "In this type of brand impersonation attack, scammers leverage file, content-sharing, or other productivity sites like ", "docs.google.com", " or sway.office.com to convince victims to hand over their credentials.\n", "\n", "“There has been an exceptional spike in cybersecurity threats and an increase in a variety of ", "phishing", " campaigns. While phishing tactics are common in nature, this is a new kind of form-based attack that our researchers have been steadily detecting throughout the beginning of the year. They are expecting the numbers to increase going forward as cybercriminals are successfully able to harvest credentials with these attacks,” said Murali Urs, Country Manager, India at Barracuda Networks. \n", "\n", "The attackers are impersonating emails that appear to have been generated automatically by a legitimate file-sharing site such as OneDrive and takes their victim to a phishing site through a legitimate file-sharing site. Sometimes, an online form is created using a legitimate service and the link is then included in phishing emails to harvest credentials. These impersonation attacks are difficult to detect because they contain links pointing to legitimate websites that are often used by organizations.\n", "\n", "In the recent form-based attacks reported by Barracuda researchers, the attackers leveraged 25% ", "storage.googleapis.com", ", 23% docs.google.com, 13% storage.cloud.google.com and 4% ", "drive.google.com", ".\n", "\n", "In comparison, Microsoft brands were targeted in 13% of attacks - onedrive.live.com (6%), sway.office.com (4%), and ", "forms.office.com", " (3%).\n", "\n", "The other sites used in impersonation attacks include sendgrid.net (10%), mailchimp.com (4%), and formcrafts.com (2%).\n", "\n", "All other sites made up 6% of form-based attacks.\n", "\n"]], "tags": ["docs.google.com", "phishing", "forms.office.com", "storage.googleapis.com", "Scammer", "drive.google.com", "google"]},
{"heading": [["Ravi Shankar Prasad launches AI portal; programme for youth to build the skills"]], "sub_heading": [["“India must be a leading country in the development of Artificial Intelligence in the world, leveraging upon its vast Internet savvy population and data it is creating. India’s AI approach should be of inclusion and empowerment of human being by supplementing growth and development rather than making human beings less relevant,” Prasad said."]], "time": [["Last Updated: May 30, 2020, 08.17 PM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW DELHI: With the aim to aid the development of solutions based on Artificial Intelligence (AI), the government has launched a dedicated portal for Artificial Intelligence. The platform will act as a one stop digital platform for AI related developments in India, sharing of resources details of ", "startups", ", investment funds in AI, companies and educational institutions related to AI in India.\n", "\n", "The portal was launched by ", "Ravi Shankar Prasad", ", union minister for electronics, IT; communications and law and justice on Saturday to mark the first anniversary of the second tenure of the government.\n", "\n", "India’s national Artificial Intelligence Portal called www.ai.gov.in has been jointly developed by the Ministry of Electronics and IT and IT industry body ", "NASSCOM", ".\n", "\n", "“India must be a leading country in the development of Artificial Intelligence in the world, leveraging upon its vast Internet savvy population and data it is creating. India’s AI approach should be of inclusion and empowerment of human being by supplementing growth and development rather than making human beings less relevant,” Prasad said.\n", "\n", "The government also launched a national programme for the youth, called “Responsible AI for Youth” with is aimed at empowering the young students of the country with appropriate new age tech mind-set, relevant AI skill-sets and access to required AI tool-sets to make them digitally ready for the future.\n", "\n", "The programme has been created and launched by the National e-Governance Division, Ministry of Electronics and IT in collaboration with Intel India, with support from Department of School Education and Literacy (DoSE&L), Ministry of Human Resource Development.\n", "\n", "“Responsible AI for Youth” will empower the youth to become AI ready and help reduce the skill gap, while enabling youth to create meaningful social impact solutions. The Program is designed to reach out to students from Government schools pan India and provide them with an opportunity to become part of the skilled workforce in an inclusive manner, the ministry said in a statement.\n", "\n", "The National Programme is open to students of classes 8 - 12 from Central and State government-run schools and in its first phase, each of the State Education Department will nominate 10 teachers who will identify 25-50 potential students for the Program. The identified students will attend online training sessions on AI and understand how to identify social impact ideas/projects that may be created using AI and submit their ideas through a 60 seconds video explaining a proposed AI enabled solution. \n", "\n", "From the submitted ideas in the form of videos, top 100 ideas will be shortlisted and these students will be invited to attend residential boot camps or online sessions (subject to COVID-19 situation); to take them through a deep dive AI journey. Post the boot-camps/ online sessions, these students will be asked to create real time projects and submit their final project in a video format on the website.\n", "\n", "Adequate handholding will be provided by Intel certified AI coaches and mentors throughout to ensure that ideas mature as prototypes. The experts will shortlist top 50 project ideas and students will be invited to showcase their projects either face to face or in an online format. Further, top 20 innovative projects will be selected by an independent committee of experts and provided opportunities to showcase at relevant platform, the government said.\n", "\n", "\n"]], "tags": ["Artificial Intelligenc", "nasscom", "ai portal", "startups", "Ravi Shankar Prasad"]},
{"heading": [["Covid-19 disruption creates market boom for IoT, connected tech"]], "sub_heading": [["Tech companies like Infosys, ThoughtWorks, Tata Comm, Citius Tech, Hero Electronics are looking to leverage opportunity created by Covid-19 disruption. Infosys expects Covid-19 to lead to higher digitisation in manufacturing."]], "time": [["Last Updated: Jun 01, 2020, 06.53 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The disruption that Covid-19 has brought about will trigger a boom in the market for ", "Internet of Things", ", or connected technologies, say industry executives and analysts. They add that companies such as ", "Infosys", ", Tata Communications, ThoughtWorks, ", "Citius Tech", " and ", "Hero Electronics", " are betting on these opportunities. \n", "\n", " “IoT has always existed as an automation tool but this disruption will enhance adoption of ", "IoT", " just like it did for collaborative virtual meeting platforms,” said Alok Bhardiya, head (", "IoT Business Unit", "), Tata Communications.\n", "\n", "First, there was a dip. “The cellular-based IoT market is expected to have a YoY decline of 4.4% by end of CY2020,” said Apalak Ghosh, industry manager for digital transformation at market research and analysis firm Frost & Sullivan. He, however, expects the market to start reviving from 2021 and post as much as 22% growth the following year.\n", "\n", "\n", "\n", "Restaurants may have to attest to food quality in real time, said Selvakumar Natesan, the lead IoT tech consultant at ThoughtWorks. That should create a market for portable food sample analysers that give instant reports.\n", "\n", "Automatic disinfectants as well as air quality and cleanliness indicators would be needed in hotels, gyms and movie halls. Municipalities may also start deploying smart meters. \n", "\n", "\n", "\n", "Technology could be leveraged for remote monitoring, preventing failure of critical equipment, and disease prediction and diagnosis, said Sridhar Turaga, CitiusTech’s senior vice president for data science. There will likely be higher demand for wearable health devices and air quality and blood oxygen monitors.\n", "\n", "“There is an expectation that a digital health passport will become mandatory for train and public transportation,” ThoughtWork’s Natesan said.\n", "\n", "\n", "\n", "Automation will be crucial for scaling production up and down according to short term demand fluctuations and also for adaptive manufacturing — for instance when ventilators are manufactured at an automobile plant, said Ravi Aggarwal, vice-president, Automation Industry Association, which represents the likes of Siemens, Larsen & Toubro, Mitsubishi and Rockwell Automation.\n", "\n", "Infosys expects Covid-19 to lead to higher digitisation in manufacturing.\n", " \n", "\n"]], "tags": ["Citius Tech", "Hero Electronics", "internet of things", "iot business unit", "Infosys", "Internet", "IoT"]},
{"heading": [["How much legal immunity do social media companies have?"]], "sub_heading": [["In India, the government has been looking to make social media sites more accountable for content on their platforms. "]], "time": [["Last Updated: May 30, 2020, 08.48 AM IST"]], "publisher": [["ET Bureau"]], "article": [["US President ", "Donald Trump", " signed an executive order on Thursday aimed at stripping ", "legal protections available", " for ", "social media", " companies in the US. Trump uses ", "Twitter", " regularly to announce policies, make statements against rivals and complain against the media.\n", "\n", "Early this week, Twitter used fact-check labels to several of his tweets about mail-in voting, providing links to accurate information on the topic. This angered Trump to sign an order against social media companies to reevaluate the immunity enjoyed by them. \n", "\n", "In India, the government has been looking to make social media sites more accountable for content on their platforms. ET compares the executive order in the US and the efforts in ", "India", " to rein in social media platforms.\n", "\n", "\n", "\n", "\n", "USA", "\n", "1996 law, Section 230 of the Communications Decency Act, bars people from suing providers of an “interactive computer service” for libel if users post defamatory messages on their platforms. It says intermediary website operators will not be treated as the publisher or speaker for making others’ posts available. A related provision protects sites from lawsuits accusing them of wrongfully taking down content. It gives them immunity for “good faith” decisions to remove or restrict posts they deem “obscene, lewd, lascivious, filthy, excessively violent, harassing or otherwise objectionable, whether or not such material is constitutionally protected.”\n", "\n", "\n", "\n", "Intermediary guidelines under the Sec 79 of IT Act 2000 gives legal protection for social media sites if someone posts defamatory and unlawful content on their platforms. It provides time for social media platforms to remove such content with due legal procedures.\n", "\n", "\n", "\n", "The order argues that if a site restricts access to others’ content in bad faith and goes beyond removing the types of objectionable content detailed in the law, it should be deemed a publisher rather than a neutral platform — thus losing its legal immunity from lawsuits. It is however subject to court review.\n", "\n", "\n", "\n", "India has come out with a draft amendment to the intermediary guidelines in 2018 to define new rules to take down content that causes disturbances from social media platforms. The rules are to make social media companies more accountable for the content they host. The draft proposes that all platforms with over 5 million users in India need to have local offices and grievance officers so that the government can engage with them. Platforms will also have to verify users, trace content on order of a court and put automated tools for filtering child pornography.\n", "\n", "\n", "\n", "The order asks ", "the US Federal Communications Commission", " to develop regulations addressing whether social media firms lose Section 230 immunity if they restrict access to posted material in bad faith. That could include actions that are “deceptive, pretextual or inconsistent with a provider’s terms of service.”\n", "\n", "\n", "\n", "The government is in the final stages of notifying the intermediary guidelines. Once done, it may give a notice to social media companies to comply with it.\n", "\n", "\n", "\n"]], "tags": ["Federal Communications Commission", "Twitter", "usa", "the us federal communications commission", "legal protections available", "Donald Trump", "India", "social media"]},
{"heading": [["India asks internet service providers to block WeTransfer"]], "sub_heading": [["\"At this moment in time, WeTransfer seems to be blocked and unavailable in India,\" WeTransfer said in a blog post. Founded in 2009 in the Netherlands, WeTransfer allows users to upload and share file of up to 2GB for free at one time. Paying users can share files of up to 20 GB per transfer. The DoT did not immediately respond to a request for comment."]], "time": [["Last Updated: Jun 01, 2020, 01.29 PM IST"]], "publisher": [["Reuters"]], "article": [["NEW DELHI: India has ordered its internet service providers (ISPs) to block file-sharing website ", "WeTransfer", " at a time when hundreds of millions of people are working from home because of a nationwide lockdown to stop the novel ", "coronavirus", ".\n", "\n", "The order, dated May 18, from India's Department of Telecommunications (DoT), which was reviewed by Reuters, does not specify a reason for blocking the website, but invokes a clause from conditions laid out for granting licences to ISPs.\n", "\n", "The clause directs all licence holders to block websites in the \"interest of national security or public interest\".\n", "\n", "\"At this moment in time, WeTransfer seems to be blocked and unavailable in India,\" WeTransfer said in a blog post.\n", "\n", "\"We are working hard to understand the reasoning behind this block, as well as how to get it reverted as soon as possible.\"\n", "\n", "The DoT did not immediately respond to a request for comment.\n", "\n", "Founded in 2009 in the Netherlands, WeTransfer allows users to upload and share file of up to 2GB for free at one time. Paying users can share files of up to 20 GB per transfer.\n", "\n"]], "tags": ["wetransfer", "covid", "File Transfer", "wetransfer ban", "isp", "coronavirus", "covid 19", "Work from home"]},
{"heading": [["Feud between Donald Trump and Jack Dorsey can have long-lasting effects on how we consume media in India"]], "sub_heading": [["A significant development to this debate is the recent feud between US President Donald Trump and Jack Dorsey, CEO of Twitter. While, on its surface, it is a battle between two powerful Americans, it can have longlasting effects on how we consume media in India."]], "time": [["Last Updated: May 30, 2020, 10.55 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["With close to 670 million active internet connections, today more Indians consume ", "media", " through digital modes. This practically means a content feed based on the social media platform of your choice. It may be Facebook, Twitter, Instagram, ", "YouTube", ", TikTok, Share-Chat or even WhatsApp. ", "India", " has the highest number of users and views on several of these global ", "online platforms", ". Due to their scale and size, they have faced a recurring debate on social harms and allegations of bias.\n", "\n", "A significant development to this debate is the recent feud between US President ", "Donald Trump", " and ", "Jack Dorsey", ", CEO of Twitter. While, on its surface, it is a battle between two powerful Americans, it can have longlasting effects on how we consume media in India.\n", "\n", "Generally, both in the US and in India, social media companies are not liable for the content that is posted by users under what may be termed as “safe harbour laws”. At the same time, they can take down information without any legal liability, permitting them to police their platforms. It permits them to make choices and indeed such choices may come with political biases. As Stanford Cyber Policy Center’s Daphne Keller has argued, social media platforms should act as “good Samaritans”, and not be legally obligated to enforce neutrality, since, “by trying to moderate speech… they will be deemed insufficiently neutral”.\n", "\n", "Such an immunity is not absolute. It rests on compliance — whether they are taking down posts once notified of the illegality. These principles first developed through legislation and court challenges in the late 1990s and early 2000s and have received global acceptance. In India, this occurred a bit later, with the law being developed till 2015. It has remained somewhat static since then.\n", "\n", "But this law is plainly antiquated. Today, social media platforms are incredibly powerful and ubiquitous. They have upended traditional news media, broadcasting and rewritten how people conduct themselves on a daily basis in nearly every aspect of their lives. It determines national debates, personal habits and can act as the arbiter and source of power. This has led to several nuanced questions which legal scholars and technical experts are still trying to answer. \n", "\n", "For instance, to deal with the problem of disinformation, should platforms self-censor? If yes, in what circumstances? Or, should they maintain a level of neutrality? These obtuse questions around designing regulatory structures for the future of safe harbour protections are what is at the centre of the present debate.\n", "\n", "The specific factual controversy which provides context for this arises from allegations by Trump after two of his tweets on mail-in ballots were “factchecked” by Twitter, which appended labels, warning users about their accuracy. \n", "\n", "In response, a fuming Trump issued a presidential order on May 28, undermining the protections enjoyed not only by Twitter but other intermediaries as well. This presidential order is broken into eight sections. Eric Goldman, law professor at Santa Clara University School of Law, who analysed it, termed it “pro-censorship political theatre”.\n", "\n", "It increases government power by now providing a questionable legal basis to re-interpret under what actual conditions immunities are available to social media platforms and encourages prosecution against them for political bias. There is emerging consensus that many portions of this executive order would be unenforceable and even susceptible to legal challenge for violating free speech protections under the United States Constitution, as per an analysis by Keller as well as tweets by David Greene, civil liberties director, Electronic Frontier Foundation.\n", "\n", "Closer home, we are facing a somewhat similar moment. This goes above and beyond concerns on political bias or misinformation to diverse arguments made for greater control and content censorship. We have a clumsy draft, termed as Draft Intermediary Rules, that contains provisions that would require automated filtering and heavy-handed censorship.\n", "\n", " They also included provisions for a novel concept termed “traceability”, which was first evangelised, to my knowledge, on Twitter posts when mob lynchings were linked to WhatsApp forwards. This would have broken end-to-end encryption, which is a much-needed relief to ordinary people who discuss incredibly sensitive information online and made them susceptible to cyber-attacks and mass surveillance.\n", "\n", "Finally, in this complex soup of competing interests, what are some clear takeaways? First, online platforms have immense power and impact on ordinary people, but the prescriptions which are being proposed both in the US and India cater to interests of greater government control. Second, there is a lack of a clear path on regulating online platforms that can account for these disparate harms. \n", "\n", "At present, there are ongoing conversations around the regulatory frameworks of competition law, consumer protection or evolving a whole new regulatory paradigm for such large social media entities that emerge from a “duty of care” principle. Third, due to these two significant facts there will be continuing allegations of bias, leaving persons across the political spectrum with a sense of grievance.\n", "\n", "This presents continuing opportunities for discretionary action which suffer from legal deficiencies and may even smack of political control.\n", "\n", "The solutions may not be easy, but they do merit a few easy prescriptions that need to be based on clear-headed principles that cater to the public interest. These must start with greater transparency which can help policy professionals understand the disparate problems that emerge and move in a comprehensive manner towards developing a regulatory framework that caters to our present needs. While there have been some conversations floated by the Ministry of Electronics and IT to take a relook at the Information Technology Act, 2000, it needs to be accelerated with a view towards serving the long-term interests of individual liberty and innovation rather than of Silicon Valley platforms or any government of the day.\n", "\n"]], "tags": ["YouTube", "Online platforms", "Sunday ET", "Jack Dorsey", "Media", "Donald Trump", "India"]},
{"heading": [["Millions are on contact-tracing apps with poor privacy safeguards"]], "sub_heading": [["These apps have garnered several million downloads already, but many lack a clear or strong privacy policy although they collect personal information such as location data, photos, media, camera, call information, WiFi connection information and device ID, privacy advocates said."]], "time": [["Last Updated: Jun 02, 2020, 10.18 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["BENGALURU: States, city municipal corporations as well as police departments across India have launched 40 apps for Covid-19 contact tracing, quarantine tracking, providing health information and to generate e-passes, even as the central government’s ", "Aarogya Setu", " app remains the face of Covid-19 ", "contact tracing", " efforts across the country.\n", "\n", "These apps have garnered several million downloads already, but many lack a clear or strong privacy policy although they collect personal information such as ", "location data", ", photos, media, camera, call information, WiFi connection information and device ID, ", "privacy advocates", " said.\n", "\n", "In the absence of a ", "privacy law", ", privacy activists have termed the apps’ policies and terms of service as ineffective, weak and confusing.\n", "\n", "“While the applications have been developed independently by each government, we have observed some questionable trends, practices, and policy provisions pertaining to the apps,” Software Freedom Law Centre said in a report that studied the privacy policies, terms of service, and permission demanded by these apps. “It is shocking to see the absence of Terms of Service or a Privacy Policy that binds the developer/publisher of the app and its end-user.”\n", "\n", " \n", "\n", "Information Technology (Intermediaries Guidelines) Rules, 2011 mandate that an intermediary shall publish the terms of use, rules and regulations, and privacy policy pertaining to the platform operated by the intermediary.\n", "\n", "Some of the applications have generated privacy policies from a ", "Firebase", " application, which helps companies generate standardised privacy policy templates depending on the type of app and information accessed. \n", "\n", "The practice is in itself not uncommon although these policies lack clauses that cover important aspects such as data retention and purpose limitation for processing the data that is collected. \n", "\n", "“These apps are also not updated regularly, which poses a cybersecurity threat. There is a sloppy coding patchwork of the apps and sloppy drafting of the privacy policies. They are taking it from templates. Healthcare data is the most sensitive data alongside financial data. It requires a high degree of protection. Users should be able to demand a copy, rectify it and delete it,” said Apar Gupta, Executive Director at Internet Freedom Foundation, a digital advocacy organisation. \n", "\n", "For instance, the Uttar Pradesh government’s Self-Quarantine App does not have an accessible Terms of Service or Privacy Policy document. The privacy policy link on the Google Play Store page directs a user to the state government’s Covid-19 web portal. A policy document was not found there either.\n", "\n", "On the other hand, Punjab’s COVA app has a detailed privacy policy. However, it does not mention how much of the data will be retained after the pandemic or the mode of retention. It also requires permission to access location, IP address, operating system, device ID, and handset make, even though the app is mainly for providing information and advisories. \n", "\n", "Many apps direct users to privacy policies of other state government websites, which may have nothing to do with the Covid-19 app.\n", "\n", "Quarantine Monitor app of Tamil Nadu directs users to the privacy policy of the ‘esevai’ (e-Service) portal of the state government, while the Karnataka government’s Quarantine Watch app takes users to the privacy policies of the land records department. \n", "\n", "Emails sent to app developers of Tamil Nadu, Karnataka, Uttar Pradesh, Maharashtra, and Punjab did not elicit a response.\n", "\n"]], "tags": ["aarogya setu", "Contact tracing", "Firebase", "privacy advocates", "privacy law", "Location data"]},
{"heading": [["Youtube, Facebook and Netflix drive rural India's internet usage"]], "sub_heading": [["Babu Reddy, a village-level entrepreneur who runs a digital kiosk or Common Service Centre, is however providing high-speed Fibre-to-Home connections to citizens now, utilizing the BharatNet fibre backbone, which is transforming the life of the villagers, especially its youth."]], "time": [["Last Updated: Jun 01, 2020, 08.06 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Surrounded by hills, ", "Nandanam village", " in Chittoor district of Andhra Pradesh had never experienced Internet connectivity before.\n", "\n", "Babu Reddy, a village-level entrepreneur who runs a digital kiosk or Common Service Centre, is however providing high-speed Fibre-to-Home connections to citizens now, utilizing the BharatNet fibre backbone, which is transforming the life of the villagers, especially its youth.\n", "\n", "The Covid-19 pandemic has accelerated Internet penetration in rural areas.\n", "\n", "Data consumption in ", "Panchayats", " connected to the BharatNet fibre backbone has increased to 150 Terabytes (TB) per month in May from about 55 TB per month during January, according to data from ", "CSC e-Governance Services", ", which has been providing last mile connectivity through the BharatNet network to the gram panchayats since July 2019.\n", "\n", "More than 300,000 subscribers registered for a fibre-to-home connection from Bharat Net in March, while 1.2 million have subscribed to its Wi-Fi service till date.\n", "\n", "“With BharatNet being accessed by citizens through the common service centres, Internet consumption in rural areas has increased significantly. The limitation imposed due to the Covid-19 lockdown has also led to the surge, this shows that there was significant pent up demand in rural areas which was unserved earlier,” said Dinesh Tyagi, CEO of CSC e-Governance Services, which also maintains BharatNet’s optical fibre network.\n", "\n", "Since CSC has been made the custodian of last mile operational issues, it has helped in the speedy roll-out and maintenance of the services, Tyagi added.\n", "\n", "As far as consumption trends were concerned, ", "Google", "'s YouTube was used the most, followed by ", "Facebook", " and Netflix.\n", "\n", "The growth in usage has been a whopping 219% for YouTube in March compared to January.\n", "\n", "For Facebook, the growth has been 374% in the same period, while for Netflix it has been 422%.\n", "\n", "Amazon’s content streaming platform Prime, Facebook’s photo sharing app Instagram, video conferencing tools Zoom and Webex, along with Twitter, are other popular apps in the top 10 list.\n", "\n", "In an open letter written on the eve of his government completing one year of its second term, Prime Minister Narendra Modi said: “The government policies have led to bridging the gulf between urban and rural lives. For the first time, the internet users in rural areas have outnumbered the urban counterparts by 10%.”\n", "\n", "In July 2019, when CSC e-Governance Services’s special purpose vehicle took over, only around 22,000 gram panchayats were Internet enabled. Now, with close to 100,000 functional panchayats, the last mile internet connectivity drive in rural areas have been accelerated through its Wi-Fi Choupal programme, Tyagi said.\n", "\n", "“This will help in creating not only a digitally inclusive society but also enabling access to government as well as non-government services such as telemedicine, banking, tele-agriculture, tele-law etc,” added Tyagi.\n", "\n", " \n", "\n", "\n"]], "tags": ["nandanam village", "amazon video", "facebook", "panchayats", "google"]},
{"heading": [["View: The coming Facebook-Jio stress test for the CCI"]], "sub_heading": [["Reliance Jio will approach the Competition Commission of India to clear its Facebook deal.  "]], "time": [["Last Updated: Jun 02, 2020, 01.35 PM IST"]], "publisher": [["ET CONTRIBUTORS"]], "article": [["\n", "\n", "When it comes to the power of big data, it would be difficult to disagree that ", "Facebook", " may be called the old ‘Titan’ and ", "Jio", ", the next generation data God (Zeus). It is a stretch to say that Facebook may have drawn guidance from Greek mythology while joining hands with Jio, but one wonders! Perhaps, there is no point in Titanomachy and it is smarter to conquer together.\n", "\n", "Following the announcement of Facebook’s $5.7 billion investment in Jio Platforms, the largest minority investment by a technology company worldwide, ", "Reliance Jio", " confirmed that it would approach the ", "Competition Commission", " of India (CCI) for its approval. It is reassuring to know that the CCI will scrutinise this mega deal between two data giants before it can be consummated, unlike Facebook’s earlier acquisition of WhatsApp which escaped the CCI’s scrutiny. However, the key question is whether the CCI is equipped to deal with big data issues and if it would, in fact, go beyond its comfort zone (traditional competition rules) to analyse the potential adverse impact of such a mega deal.\n", "\n", "It is no secret that the primary driver of this deal is the vast user and data bases of the parties and the synergies which can be created by judiciously commercialising this data. It is believed that WhatsApp (as a platform with a massive userbase) will be leveraged to propel Reliance’s e-commerce platform, ", "JioMart", ". Given that the deal is subject to the scrutiny of the CCI alone, and that there is no data protection authority to monitor data abuses, it becomes indispensable that the CCI meticulously scrutinises the deal from the big-data perspective, without relying much on the traditional approach which may be unsuitable for dealing with dynamic digital markets.\n", "\n", "\n", "\n", "Once upon a time, data was a means to an end and was used for marketing. But, today, data is an end in itself as it carries great value and can be monetized. For example, Facebook paid $19 billion to acquire WhatsApp in 2014 in spite of the latter’s losses of $138 million in 2013. Facebook’s valuation split for WhatsApp was $2.7 billion for its user base, brand value and technology; and $15.3 billion for its ‘goodwill’. So, effectively, Facebook valued WhatsApp’s data at over $15 billion. This is the value and power of data in today’s world. Given Facebook’s past issues with users’ personal data, concerns around commercialization of personal data without users’ ‘true’ consent may not be misplaced, especially given the overwhelming number of users of Facebook, WhatsApp (owned by Facebook) and Jio (over 288 million, 400 million and 388 million, respectively). \n", "\n", "At the time of Facebook’s acquisition of WhatsApp, Jan Koum, WhatsApp’s co-founder, explained how WhatsApp was built with privacy of communication at its core. However, shortly after the acquisition, Koum reportedly left Facebook after his disputes with Facebook over user data issues. He later wrote a blogpost stating that, “If partnering with Facebook meant that we had to change our values, we wouldn’t have done it”.\n", "\n", "\n", "\n", "Many digital services (including Facebook and WhatsApp) appear to be free to users as users do not pay any money at the time of subscription. However, these services are not truly free, and users pay in terms of their personal data. While subscribing to these services, users are required to accept certain boiler plate terms and conditions which include collection of data on user’s internet activity (in case of Facebook, even activities outside Facebook). This data is then commercialised by sharing it with third parties. Most users whose data is commercialised do not even understand the concept of consent, forget about actually consenting to the collection and commercialisation of their personal data.\n", "\n", "\n", "\n", "In this day and age, behavioural advertising has become the new normal. Behavioural advertising is the practice of sending online advertisements to users based on their specific comprehensive profiles by observing their online habits. This enables companies to cut costs by addressing their target audience with customized advertisements for each user.\n", "\n", "To put this in perspective, imagine using your computer locked inside your room browsing something that you do not want anyone to see. However, someone is constantly looking over your shoulder and silently taking notes of what you are viewing. This is what you currently get in the name of data privacy. This is the essence of behavioural advertising which Facebook is far too good at. If you add to this, Jio’s capability as an ISP of monitoring online histories of its users with a dash of deep discounting and a hint of untraceable bias, the results could be far-reaching. \n", "\n", "\n", "\n", "Based on traditional competition rules, it may be difficult to assess the resources and market positions of the combining entities, especially in the technology sector. However, if such an assessment is undertaken considering data as a relevant metric for resources and economic power of the parties, the results would be very different. It is now well accepted that data is an asset and a relevant factor to assess the market power of an entity, especially in the digital space. From previous data driven transactions, such as Facebook/WhatsApp and Microsoft/LinkedIn, competition authorities have learnt their lessons not to ignore the importance of data in competition law assessments despite the limitations of the existing legal framework. \n", "\n", "It is, therefore, critical for the CCI to examine the potential adverse effects of this mega deal before it is consummated and not find comfort in the fact that it has the power to assess the actual conduct of the parties after the combination. It is well accepted now that ex-post rules are unsuitable for digital markets where it may not be possible to reinstate healthy competition after a player attains a dominant position (especially as a result of access to big data). Internet search is a classic example – once Google Search became popular, even large companies like Microsoft could not ever come close to competing with it. If potential competition concerns with the Facebook/Jio deal are not nipped in the bud, a deal of this magnitude may give rise to a being which could soon become untameable.\n", "\n", "\n", "\n", "\n", "\n"]], "tags": ["Jio", "facebook", "reliance jio", "WhatsApp Jio deal", "Mukesh Ambani", "Reliance", "Competition Commission", "Jiomart"]},
{"heading": [["TCS revenue growth from Tata Group slows in FY 20"]], "sub_heading": [["Revenue from Tata Sons as well as subsidiaries and associates grew to nearly Rs 2,656 crore compared to a more than 13% growth to Rs 2,566 crore in financial year 2019, when the software services exporter capitalised on the group's new technology initiatives."]], "time": [["Last Updated: May 31, 2020, 11.00 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: The revenue that ", "Tata Consultancy Services", " generated from ", "Tata Group", " companies increased by only 3.5% in fiscal year 2020, compared to a double-digit rise in the previous financial year, according to the company’s annual report.\n", "\n", "Revenue from ", "Tata Sons", " as well as subsidiaries and associates grew to nearly Rs 2,656 crore compared to a more than 13% growth to Rs 2,566 crore in financial year 2019, when the software services exporter capitalised on the group's new technology initiatives.\n", "\n", "The pace of revenue growth has slowed even as ", "N Chandrasekaran", ", the chairman of Tata Sons, has sought more collaboration between group companies since his appointment in 2017.\n", "\n", "During TCS’ previous Annual General Meeting, a shareholder, who had noted that revenue from group companies had increased in 2018-19, asked whether the margins in contracts awarded by group companies was higher and whether there would be a further increase in revenue from Tata Group companies in 2019-20.\n", "\n", "Responding , Chandrasekaran had said that all business “between Tata Group companies are done at arm’s length, on a very transparent basis, but I would like to see more and more Tata companies working together…I’m glad to see some improvement, but we need to go a long way.” \n", "\n", "According to a Tata Sons executive, group companies had invested heavily in new technology transformations last year which were headed by TCS, some of which are still underway. \n", "\n", "“Large scale technology transformations have been happening at group companies like Tata Steel and Tata Motors, which signifies the increase in 2019. Some of these technology initiatives are still in progress at these large companies. That’s the reason why in 2020 the growth percentage seems relatively small. But group companies continue to invest in new technology,” the executive who is aware of the developments said.\n", "\n", "TCS and Tata Sons did not respond to emails seeking comment.\n", "\n", "Analysts said TCS’ revenue contribution from government contracts has seen sharper growth as the software services provider increased revenue contribution from the public sector.\n", "\n", "TCS though does not disclose its revenue contribution from government contracts.\n", "\n", "Even if TCS grows its revenue contribution from its parent group, they said the overall percentage contribution would remain negligible due to the sheer scale of the software exporter.\n", "\n", "“Even if TCS wants to increase its revenue contribution from Tata Sons, it would happen at the proper arm’s length pricing and it would not be significant due to its size. For a company of the size of ", "Tata Elxsi", ", the contribution may instead be material,” said Madhu Babu, senior technology analyst at brokerage firm Centrum. \n", "\n", "\n"]], "tags": ["N Chandrasekaran", "Tata Sons", "tata consultancy services", "Tata Elxsi", "tata group"]},
{"heading": [["Cognizant to retain digital talent in slowdown, anticipating recovery"]], "sub_heading": [["The Teaneck, New Jersey-based IT services provider earns around 38% of its $16.8 bn revenue from digital businesses."]], "time": [["Last Updated: Jun 02, 2020, 09.37 AM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: ", "Cognizant", " will protect employees with digital skills from layoffs even if they remain under-utilised during the ongoing ", "economic crisis", ", its chief financial officer has said. \n", "\n", "The Teaneck, New Jersey-based IT services provider earns around 38% of its $16.8 billion revenue from digital businesses, which include helping clients shift applications to the Cloud, marketing online and on social media and building applications for smartphones and maintaining them at scale.\n", "\n", "Karen McLoughlin’s comments come amid moves to shed employees as part of cost optimisation.\n", "\n", "Cognizant announced a voluntary separation package for its US employees earlier in May wherein it would let go staffers who are not in active projects. \n", "\n", "In October last, it said 7,000 jobs would be axed. \n", "\n", "Staffers with digital skills are, however, likely to be spared through the recession brought on by the ", "Covid-19", " pandemic.\n", "\n", "“Even if, for some reason, we have digital talent that becomes unutilized during this timeframe, assuming that they have the right skills and capabilities and so forth, we will protect that talent for the recovery,” McLoughlin said during a Bernstein conference\n", "last week. \n", "\n", "In its first quarter results commentary, the company had said it continues to see a strong pipeline for digital deals.\n", "\n", "The ‘bench’ at many technology services companies, including Cognizant, has swelled with staffers from deferred or discontinued client projects. \n", "\n", "McLoughlin said those with skills that are “fairly reasonably and easy to replace in the marketplace” are currently on the bench and they could opt for the package. \n", "\n", "As part of the company’s “critical growth program,” most underutilised resources would be let go by the middle of the year, she added.\n", "\n", "IT services companies faced significant attrition of employees with digital skills last year, as demand for professionals who could deliver work in areas such as cloud, analytics and cyber security shot up globally. \n", "\n", "As more clients shift work to the cloud during the Covid-19 induced crisis, demand for people with such skills are on the rise.\n", "\n", "Separately, McLoughlin said the number of its employees returning to offices will remain minimal. “We're not anticipating a rush back into the delivery centres in India,” she said. \n", "\n", "“We will start to pilot some return to work on a very, very small scale in one or two of our centres in India in the coming weeks. But we do not expect to have everybody in the centres anytime in the near future. We will continue to have most folks work from\n", "home.”\n", "\n", "As companies globally are starting to understand what the Covid-19 crisis entails, business visibility has improved for Cognizant, she said.\n", "\n", "“What we've noticed in the last couple of weeks is a certain level of stabilization. I don't want to certainly imply that we've returned to strong growth or anything like that. But you have seen companies start to understand a little bit about what their environment is going to be like…and then look for ways to drive savings into their business…but at the same time protect their transformation agendas.”\n", "\n"]], "tags": ["Economic crisis", "Karen Mcloughlin", "The Teaneck", "Cognizant"]},
{"heading": [["Infosys says Covid-19 related risks could hit profitability, CEO compensation jumps 27%"]], "sub_heading": [["Infosys has withdrawn its growth guidance for the first time citing uncertainties in clients’ business."]], "time": [["Last Updated: May 31, 2020, 06.12 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Bengaluru: ", "Infosys", " said Covid-19 led ", "slowdown", " has resulted in termination of projects and may hit the company’s profitability going forward. \n", "\n", "The Bengaluru-headquartered IT services exporter has highlighted the pandemic could be a major risk going forward as key clients across the US, Europe and other prominent markets may cut costs due to prolonged economic impact. \n", "\n", "“Our profitability may be negatively impacted if we are unable to eliminate fixed or committed costs in line with reduced demand. Additionally, any sudden change in demand may impact utilization in (the) short term thereby impacting margins. Our profitability may be marginally impacted as some clients may dispute some of the existing work-in process that has been recognized by us as unbilled revenues. This in turn can impact our cash flows negatively,” said Infosys in its 20F filed with the US Securities and Exchange Commission. \n", "\n", "Infosys has withdrawn its growth guidance for the first time citing uncertainties in clients’ business in the wake of the pandemic. \n", "\n", "The company said in the filing that some of the specific “consequent risks related to the occurrence of Covid-19 that have materialized” include delay and suspension of some existing services projects. \n", "\n", "“Many of our clients’ business operations have been negatively impacted due to the economic downturn - resulting in postponement, termination, suspension of some ongoing projects with us and/or reduced demand for our services and solutions,” said Infosys. \n", "\n", "The Indian tech services major has also cautioned that certain employee benefits may get reduced and onboarding of new employees could be delayed. \n", "\n", " “The uncertainty in demand as our clients deal with a prolonged economic impact of Covid-19 may cause us to implement severe cost control measures including reduction in employee bonuses. This could result in increased attrition of employees and/or a higher expenditure on recruitment and subcontracting services, thereby impacting our profitability,” said Infosys, adding that the company’s ‘ability to honor job offers on a timely basis can get impacted’. \n", "\n", "Infosys, India’s second largest software services exporter, has also talked about possibilities of a global economic uncertainty impacting the demand for services, comparing it with the financial crisis in 2008. \n", "\n", "“Any future global economic uncertainty, arising out of various factors including the Covid-19 pandemic impacting the financial services industry, retail, consumer goods, energy and manufacturing on which we depend for a substantial portion of our annual revenues, may result in the reduction, postponement or consolidation of IT spending, contract terminations, deferrals of projects or delays in purchases by our clients...For instance, the financial services industry was severely impacted by the economic crisis that started in 2008 in the United States,” said the company. \n", "\n", "Infosys chief executive officer ", "Salil Parekh", "’s total remuneration jumped by 27% to $6.15 million in the financial year 2019-20, while chief operating officer Pravin Rao saw a 29% rise to nearly $2.3 million. \n", "\n", "Parekh was granted a significantly higher number of performance-based restricted stock units compared with the corresponding fiscal year and saw a more than 50% rise in value of granted RSUs. His fixed salary has been marginally reduced. \n", "\n", "\n"]], "tags": ["Salil Parekh", "lockdown", "covid 19", "Infosys", "Infosys jobs", "slowdown"]},
{"heading": [["Infosys among UK firms accessing Rishi Sunak's Covid-19 job saving scheme"]], "sub_heading": [["Infosys, co-founded by Sunak's father-in-law Narayana Murthy, said it had used the furlough - or forced leave - option for 3% of its staff in order to tide through the lockdown.  \"In light of the current situation, Infosys has furloughed 3 per cent of its UK workforce. We are reviewing this on a weekly basis,” Infosys told ‘The Sunday Times'."]], "time": [["Last Updated: May 31, 2020, 08.01 PM IST"]], "publisher": [["PTI"]], "article": [["LONDON: Indian software major ", "Infosys", " is among the many UK companies to benefit from UK Chancellor ", "Rishi Sunak", "'s ", "Coronavirus Job Retention Scheme", ", it emerged on Sunday.\n", "\n", "Infosys, co-founded by Sunak's father-in-law Narayana Murthy, said it had used the furlough - or forced leave - option for 3 per cent of its staff in order to tide through the lockdown imposed to curb the spread of the deadly virus.\n", "\n", "\"In light of the current situation, Infosys has furloughed 3 per cent of its UK workforce. We are reviewing this on a weekly basis,” Infosys told ‘The Sunday Times'.\n", "\n", "The scheme was unveiled by the Indian-origin finance minister, married to Murthy's daughter Akshata, at the peak of the crisis and is set to gradually wind down until it is fully closed at the end of October.\n", "\n", "Under the provisions, the government covers 80 per cent of salaries of furloughed staff, up to the value of GBP 2,500 a month, in order to prevent companies having to resort to redundancies. In a latest set of announcements earlier this week, Sunak had added more flexibility into the programme so that employers can make use of the scheme in the most effective way.\n", "\n", "“Our top priority has always been to support people, protect jobs and businesses through this crisis. The furlough and self-employment schemes have been a lifeline for millions of people and businesses,” said Sunak, who is leading the UK government's economic response to the coronavirus ", "pandemic", ".\n", "\n", "“We stood behind Britain's businesses and workers as we came into this crisis and we stand behind them as we come through the other side. Now, as we begin to re-open our country and kickstart our economy, these schemes will adjust to ensure those who are able to work can do so, while remaining amongst the most generous in the world,” he said.\n", "\n", "‘The Sunday Times' also claims that the finance minister is drafting up an emergency ", "coronavirus", " Budget to be tabled before ", "the House of Commons", " in July, as the lockdown measures begin to be eased from next week.\n", "\n", "“Plans to save millions of furloughed workers from the scrap heap and retrain them will be a centrepiece of the address to MPs, which is pencilled in for the week beginning July 6,” the newspaper said.\n", "\n", "The July statement will not be a full Budget with tax changes but would be a pre-budget report to outline a recovery plan for the pandemic-hit economy. Sunak has had to table a series of mini-budgets in response to the economic crisis since his maiden Budget in early March.\n", "\n", "Business groups briefed on the new plans claim the emergency budget will have three key elements - funds to retrain workers laid off when the furlough scheme ends, huge extra infrastructure spending, and a plan to help British-based technology firms. \n", "\n"]], "tags": ["Rishi Sunak", "coronavirus job retention scheme", "the house of commons", "coronavirus", "Infosys", "pandemic", "indian software major infosys"]},
{"heading": [["Infosys to eliminate roles to flatten organisation"]], "sub_heading": [["Company will trim its workforce in the ranks of delivery managers, AVPs, VPs and SVPs."]], "time": [["Last Updated: Jun 01, 2020, 11.51 AM IST"]], "publisher": [[", TNN"]], "article": [["BENGALURU: ", "Infosys", " is undertaking a major restructuring at the higher levels in order to flatten the organisation and make decision-making faster.\n", "\n", "As part of this, the company will trim its workforce at job level (JL) 7 and above, those in the ranks of ", "delivery managers", ", industry principal (the JL7 equivalent for consulting roles), AVPs, VPs and SVPs.\n", "\n", "Infosys has over 30,000 employees in senior roles or what they call JL 6, 7 and 8. Around 13,000 employees are in JL7 levels and above. The plan is to reduce, in a staggered manner, 10%-15% of the people at JL7 and above, which would impact over 1,300 ", "executives", ".\n", "\n", "The effort is to break down a five-tiered structure into two. Infosys CEO ", "Salil Parekh", " is said to have reviewed each layer closely to understand the overlaps in these layers. The idea is to fix greater responsibility and accountability on senior executives who are not billable resources, but are people managers. The initiative includes sales, delivery, BPO and support services, sources said.\n", "\n", "In the existing reporting structure in a vertical, delivery managers report to senior delivery managers who then report to a delivery head. The delivery head, in turn, reports into a service offering head and he/she reports to a ", "business unit head", ". “We don’t want to handle too many handlers,” said one senior executive, who didn’t want to be named. The objective is faster decision-making and to give frontline leaders more flexibility. It will also reduce cost significantly since the salaries for a delivery manager or an industry principal is an average of Rs 35-Rs 40 lakh. VPs and SVPs receive much more. \n", "\n", "When TOI asked the company about it, a spokesperson said, “We have no plans or targets for workforce reduction. Nor do we have any predefined percentage of exits as a result of our half-yearly and yearly performance cycles. However, as a performance-driven organisation, some involuntary attrition is integral to the normal course of business every year at Infosys.”\n", "\n", "Infosys came close to implementing a similar structure under former CEO Vishal Sikka. A pilot project to identify overlapping/top-heavy roles was initiated in the manufacturing unit under its former head Sudip Singh. It was part of Sikka's Zero Distance programme, which was designed partly to empower a project manager. The project manager would be supported by functions like HR, legal and finance, and would collaborate with the sales team for client requirements. Sikka's sudden exit meant the plan wasn't implemented. But it seems to have made a comeback under his successor.\n", "\n", "Moshe Katri, managing director of equity research at Wedbush Securities, said senior level layoffs \"are likely a function of ongoing efforts to flatten the pyramid structure at Infosys, aiming at encouraging communications among all levels of personnel as well as eliminating redundancies.”\n", "\n", "James Friedman of Susquehanna Financial Group (SFG) said this is part of the “reskilling” underway at Infosys and throughout the industry. “So much of the company’s heritage was from operational excellence of the extreme offshoring of maintenance and infrastructure. But today's architecture really emphasizes innovation and ideation, and those may require some reassessment at the front end of the organization.”\n", "\n"]], "tags": ["Salil Parekh", "executives", "Infosys news", "Infosys", "Infosys jobs", "delivery managers", "business unit head"]},
{"heading": [["Up to 64% of India Inc may see higher demand for Cloud Computing due to COVID-19: IDC"]], "sub_heading": [["Industries like media, education, and IT/ITeS are likely to see an increased uptick in usage of digital, cloud-based tools because of online entertainment, virtual classrooms, and increased need for collaboration as a result of increased remote working."]], "time": [["Last Updated: Jun 02, 2020, 07.38 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Mumbai: Public cloud will see increased adoption in technology based infrastructure- investments, ", "IDC", " has found in its recent survey. According to IDC's ", "COVID-19", " Impact on ", "IT spending", " Survey, May 2020, as a result of the spread of the pandemic 64% of the organizations in India are expected to increase demand for ", "cloud computing", " while 56% for cloud software to support the new normal.\n", "\n", "SaaS-based collaborative applications are seeing more demand with the increased need to work remotely. Remote work is also likely to increase the need for remote support services, both human professional services and of the cloud software and especially of security/identity. \n", "\n", "VPNs, collaboration suites, end-point encryption, and cloud tools will witness an uptake, IDC noted. Industries like media, education, and IT/ITeS are likely to see an increased uptick in usage of digital, cloud-based tools because of online entertainment, virtual classrooms, and increased need for collaboration as a result of increased remote working.\n", "\n", "\"We expect an accelerated adoption of cloud, as organizations explore testing of many new initiatives natively on cloud. As industries move away from infrastructure of ownership, pay-per-use models are likely to see an accelerated demand. Public cloud services will be among the few technologies that are positively impacted by the COVID-19,\" said Rishu Sharma, Principal Analyst, Cloud and Artificial Intelligence, IDC India.\n", "\n", "Cloud-based Virtual Desktop Infrastructure and collaboration tools helped enterprises stay in touch with their employees, clients, and partners, said Sharath Srinivasamurthy , Research Director, Enterprise Solutions & ICT Practices, IDC India. \n", "\n", "\"Cloud-based solutions continued to run and enable seamless business operations during the crisis and this has increased the confidence of enterprises in embracing cloud,\" he said. \n", "\n"]], "tags": ["India Inc", "IT spending", "idc", "coronavirus", "Cloud computing"]},
{"heading": [["With clients rethinking projects, Infosys flags risks"]], "sub_heading": [["The IT services provider highlighted that the pandemic could pose a major risk going forward as key clients across the United States, Europe and other prominent markets cut costs due to the prolonged economic impact of the outbreak. "]], "time": [["Last Updated: May 31, 2020, 11.46 PM IST"]], "publisher": [["ET Bureau"]], "article": [["Bengaluru: Some ", "clients", " of ", "Infosys", " have terminated projects or reduced demand for its services amid the ", "Covid-19", " induced ", "economic crisis", ", which could impact its profitability in the year ahead, the Bengaluru-based company said in a filing.\n", "\n", "The IT services provider highlighted that the pandemic could pose a major risk going forward as key clients across the United States, Europe and other prominent markets cut costs due to the prolonged economic impact of the outbreak. \n", "\n", "“Many of our clients’ ", "business operations", " have been negatively impacted due to the economic downturn – resulting in postponement, termination, suspension of some ongoing projects with us and/or reduced demand for our services and solutions,” the company said in a filing with the US Securities and Exchange Commission. “Our profitability may be negatively impacted if we are unable to eliminate fixed or committed costs in line with reduced demand,” Infosys added.\n", "\n", "In April, Infosys suspended its annual revenue guidance for the first time due to the economic uncertainty, as the United States and Europe waded into a recession, affecting businesses at clients.\n", "\n", "The company said that some of the specific “consequent risks related to the occurrence of Covid-19 that have materialised” include delay and suspension of some existing services projects. \n", "\n", "“Additionally, any sudden change in demand may impact utilisation in (the) short term thereby impacting margins. Our profitability may be marginally impacted as some clients may dispute some of the existing work-in process that has been recognised by us as unbilled revenues. This in turn can impact our cash flows negatively,” it added.\n", "\n", "The company also warned that certain employee benefits may be reduced and onboarding of new employees could be delayed.\n", "\n"]], "tags": ["Economic crisis", "Bengaluru", "clients", "Infosys", "Business Operations"]},
{"heading": [["AGC Networks to acquire Fujisoft to enhance presence in MEA region"]], "sub_heading": [["The proposed acquisition will also enhance the current solution portfolio of AGC and Black Box across cloud computing and virtualisation, cyber security, managed services, data centre and collaboration solutions, a statement said."]], "time": [["Last Updated: Jun 01, 2020, 11.25 AM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: ", "AGC Networks Limited", ", a part of Essar Group, will acquire ", "Fujisoft", " (along with its associated companies in UAE) through its indirect subsidiary - ", "Black Box Holdings Ltd", ", a move that will strengthen AGC's presence and offerings in the ", "Middle East and Africa", " (MEA) region.\n", "\n", "The proposed acquisition will also enhance the current solution portfolio of AGC and Black Box across ", "cloud computing", " and virtualisation, cyber security, managed services, data centre and collaboration solutions, a statement said.\n", "\n", "Financial details of the proposed deal were not disclosed.\n", "\n", "According to sources, AGC's revenue is close to USD 700 million, while that of Fujisoft is about USD 13-14 million.\n", "\n", "\"This acquisition accelerates our expansion in MEA region. In our pursuit to remain the customer's trusted partner in providing technology solutions and services, the combination of Fujisoft and AGC will strengthen our relationship and relevance with our combined customers in the region,\" Sanjeev Verma, Executive Director and CEO of AGC Networks and President and CEO of Black Box Corporation, said.\n", "\n", "Albert Raj, Managing Director of Fujisoft, said the acquisition is a logical next step that creates substantial value for customers and stakeholders of both AGC and Fujisoft.\n", "\n", "\"It will truly benefit customers and business partners through expanded product portfolio and service excellence in the Middle East region and beyond,\" he added.\n", "\n", "The proposed acquisition is subject to approval from the Department of Economic Development in Dubai and from ", "Abu Dhabi Department of Economic Development", ".\n", "\n", "\"Operating within the restrictive parameters of Work from Home during the current COVID-19 times and under the new normal, this challenging and unique acquisition by AGC is in the wake of our focused approach on continuing to be at the forefront to offer the best technology solutions and services in the various markets that we operate in,\" Rohit Himatsingka, Vice President and Head Corporate Development and Strategy at AGC Networks, said. \n", "\n"]], "tags": ["black box holdings ltd", "Middle East and Africa", "abu dhabi department of economic development", "fujisoft", "AGC Networks Limited", "Cloud computing"]},
{"heading": [["We’ve to guard against Covid apps increasing state power: Nandan Nilekani"]], "sub_heading": [["Nandan Nilekani has cautioned that contact tracing apps run the risk of increasing state power."]], "time": [["Last Updated: Jun 02, 2020, 08.36 AM IST"]], "publisher": [[", ET Now"]], "article": [["Infosys", " Chairman ", "Nandan Nilekani", " has cautioned that ", "contact tracing", " apps run the risk of increasing state power and must be rolled back once normalcy returns. In an interview with ET NOW's Chandra R Srikanth, 65 -year-old Nilekani, who is working on his third book, stressed on the need to protect lives and livelihoods as India loosens the two-month old lockdown to stall the spread of Covid-19. Excerpts:\n", "\n", "\n", "\n", " What has happened has happened. There seems to be a systematic plan of opening up. Clearly, we have to do both lives and livelihoods. There have to be measures taken at individual level like masks, hand washing, social distancing as well as at the group level by not having big events. We need to look at how to start things all over again. We are on the right track.\n", "\n", "\n", "\n", " Cash in the hands of people is always welcome. India doesn't have the benefit of the US which can run huge deficits. We work within the constraints we have. Whatever we are doing in terms of cash transfers has to be well targeted and reach the right people.\n", "\n", "\n", "\n", " This (Covid-19) has really done something which is unimaginable, I have to know the health of people I am meeting. Health was supposed to be private. This puts a whole new angle on privacy and surveillance. Obviously, for proper containment we will have to understand who is where and if they are following quarantine. It does run the risk of increasing state power and we have to guard against that and treat many of these things as a temporary step that needs to be rolled back once things get back to normal.\n", "\n", "\n", "Wipro", "Azim Premji", "\n", " One thing we have learnt in this unprecedented situation is the need for resilient systems. In April, 150 million people did 400 million transactions to withdraw money using Aadhaar-enabled ", "payment systems", " when banks or ATMs didn't function. There are 5 principles (we need to focus on) for resilient (technology) system design: national portability, choice, universality, convenience and high volume-low cost population scale system.\n", "\n", "\n", "\n", " The 2011 report met these 5 principles of system design. The idea was ahead of its time and I think at that time the need for this was not fully understood but it is needed now. Sometimes, when you plant ideas for reform, they take many years to fructify but that is the nature of the beast.\n", "\n", "\n", "\n", " Short term is going to be challenging, we need resilience in business. The ability to build a profitable business that generates free cash is a sign of resilience. One of the key things we have realised is that the startup ecosystem is dependent on raising capital. That is well when you have liquidity but then you become really fragile when there are no funds. Infosys generates $2 billion free cash annually and gave a dividend of half a billion this quarter. We need to bring back the notion that you have to be profitable, generate cash flow and fund your own destiny.\n", "\n"]], "tags": ["Nandan Nilekani", "Covid Apps", "Contact tracing", "Wipro", "payment systems", "Azim Premji", "Infosys"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [["EEPC India engages with IIT-Delhi to explore possibilities of automation"]], "sub_heading": [["Seeking new solutions to the economic crisis triggered by the global pandemic , engineering exporters' apex body EEPC India, along with IIT-Delhi and AIA Foundation recently held brainstorming sessions on the urgent need to adapting to new technologies and automation. "]], "time": [["Last Updated: Jun 01, 2020, 08.22 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["With health and hygiene standards becoming stringent all around the world, along with the 'here-to-stay' social distancing, manufacturer exporters , under the aegis of ", "EEPC India", " , got engaged with ", "IIT-Delhi", " to explore and devise higher level of automation in the industry , braving the Covid-19 challenge. \n", "\n", "Seeking ", "new solutions", " to the economic crisis triggered by the global pandemic , engineering exporters' apex body EEPC India, along with IIT-Delhi and ", "AIA Foundation", " recently held brainstorming sessions on the urgent need to adapting to new technologies and automation. \n", "\n", "Such a need was more paramount for the MSMEs which contribute significantly to the engineering exports, but have to do a lot of catching up in automation. \n", "\n", " '' As much as 75 per cent of Indian MSMEs are still at the stage 2.0 of the technology stand point . This is where we are trying to intervene with infrastructure for skill sets and automation with the help of the government, \" EEPC India chairman Mr Ravi Sehgal said. \n", "\n", " He said this is the opportune time to adopt automation at appropriate levels, and meet competition from other emerging nations such as Thailand, Vietnam and Turkey etc. ''In view of this, we must address various apprehensions among MSMEs like cost associated with the automation,\" Mr Sehgal said. \n", "\n", " Mr Anup Wadhwa, Director, ", "Automation Industry Association", " said that automation brings possibility for changes to the ", "entire manufacturing processes", ". He said that the goal of smart manufacturing is to increase the overall economic potential and increase agility by increasing customized production without quality loss.\n", "\n"]], "tags": ["entire manufacturing processes", "EEPC India", "new solutions", "Automation Industry Association", "aia foundation"]},
{"heading": [["IBM, the silent job cutter, stokes worker anxiety, speculation"]], "sub_heading": [["Speculation about thousands of job cuts last month has heightened anxiety among employees."]], "time": [["Last Updated: Jun 02, 2020, 09.03 PM IST"]], "publisher": [["Bloomberg"]], "article": [["\n", "IBM's new CEO, ", "Arvind Krishna", ", has continued an unusual company tradition, refusing to disclose the scale of its latest round of ", "job cuts", ". The price: speculation about thousands of positions eliminated in the U.S. last month, and heightened anxiety among employees. “Everyone wants to know what the full picture is, but they’ll never get it from IBM,” said James Cortada, who spent decades at ", "IBM", " and has written books on the company’s culture.\n", "\n", "International Business Machines Corp. has kept mum on these numbers for decades, with arguably one exception in 1993 when Lou Gerstner, a CEO hired from outside the company, announced 60,000 dismissals. When Krishna took the helm in April, Cortada and current employees hoped the new CEO would use the reorganization to make his mark and be more transparent as IBM enters its third revolution in 108 years. Instead, Krishna, a company veteran, is sticking to the threadbare script.\n", "\n", "IBM spokesman Ed Barbini said the company won’t disclose the total number of dismissals for competitive reasons. “IBM’s work in a highly competitive marketplace requires flexibility to constantly remix to high-value skills, and our workforce decisions are made in the long-term interests of our business,” he wrote in an emailed statement. “Recognizing the unique current conditions, IBM is offering subsidized medical coverage to all affected U.S. employees through June 2021.”\n", "\n", "Many other tech companies disclose how many employees they eliminate. When HP Inc. got a new CEO last year, the PC maker said it would cut as many as 9,000 employees. A few weeks later, Cognizant, an IBM rival, unveiled plans to eliminate up to 7,000 positions. This year, Uber Technologies Inc., Airbnb Inc. and TripAdvisor Inc. disclosed painfully large numbers. “Many companies are firing people today. The more forthright they are about it the better,” said Ronn Torossian, CEO of communications firm 5WPR, which represents many Fortune 500 companies.\n", "\n", "About 90% of the businesses represented by 5WPR disclose a ballpark figure when it comes to large workforce reductions. “It’s a mistake to think you can fire thousands of people and not answer questions,” he said. “And it’s not just the media asking questions -- it’s investors, remaining employees and customers as well.”\n", "\n", "Eliminating employees is always a sensitive topic. That’s especially true for IBM. The company has about 350,000 workers globally, but its domestic workforce has been shrinking while positions have been added in cheaper countries in Asia and Eastern Europe. That exposes the company to criticism and political pressure, especially with President Donald Trump pushing for more American jobs. Still, IBM is not alone in grappling with these disclosure questions. Internal battles often arise between company executives, the human resources department and public relations office over how much information to share on job cuts, said Jonathan Segal, a partner at Duane Morris LLP. His general advice: Be transparent.\n", "\n", "“When you don’t disclose, it looks like you’re hiding something, and it can become a bigger story than it otherwise would’ve been,” Segal said. “What employees may perceive is often worse than what it is.” In the IBM information void, workers are anxiously speculating about the scope of the restructuring. Several impacted employees said they asked their managers how many other colleagues lost their jobs and were told they didn’t have access to that information.\n", "\n", "In online forums and private messaging groups, other former and current IBM employees shared snippets of information. Some posts recounted an executive based in Raleigh, North Carolina, telling staff that 20,000 workers were affected. Others said this is IBM’s biggest staff reduction in a decade. Bruce Baumbush was let go after 22 years with Big Blue. “Half my department is gone,” he said in an interview. “Thousands of people were impacted.” Watson Health, which offers data-powered medical insights and was once considered an IBM crown jewel, has been “decimated,” according to Baumbush, who worked in artificial-intelligence consulting.\n", "\n", "Employees in at least eight different states were dismissed, according to interviews with affected IBM workers. Entire teams were cut from the broader Watson business, including managers, these people said. They asked not to be identified discussing sensitive company issues. Under federal law, corporations must notify regional Worker Adjustment and Retraining Notification offices about plans to cut jobs, but there’s a lot of leeway for companies to avoid WARN filings.\n", "\n", "IBM dismissed 243 employees at three work sites in Costa Mesa and San Jose recently, according to California’s WARN office. Another 42 lost their jobs at an IBM location in the mid-Hudson region of New York State, according to a WARN filing on Friday. Once the most important computing company in the world, IBM’s star has faded. Newer tech titans such as Amazon.com Inc. dominate the growing cloud-computing market, while IBM has suffered almost a decade of shrinking revenue.\n", "\n", "“All the cloud companies are hiring right now, and IBM is laying people off,” said Ivan Feinseth, chief investment officer of Tigress Financial Partners. “I wouldn’t be surprised about them laying off thousands of people.” There are no rules forcing companies to announce how many people they hire or fire, the analyst added. “Some companies are very transparent; some companies aren’t.” In a January earnings call, IBM told analysts it was reorganizing parts of the Global Technology Services IT consulting unit, which represents about a third of revenue. The company disclosed a $900 million restructuring charge.\n", "\n", "The changes, followed by Krishna’s appointment as CEO, represent a new era at IBM: a shift toward a hybrid strategy that connects clients’ data across public and private cloud providers. Last year, IBM closed its biggest deal ever when it acquired open-source software provider Red Hat for $34 billion to accelerate this initiative. IBM’s secrecy about job cuts is still guided by the experience under Gerstner in the 1990s when extra transparency resulted in negative media coverage, employee outrage and litigation, according to a former executive who asked not to be identified discussing private information.\n", "\n"]], "tags": ["IBM layoffs", "Uber Cup", "IBM", "Arvind Krishna", "Job cuts", "IBM Job cuts", "worker anxiety"]},
{"heading": [["Wipro's Abidali Neemuchwala’s pay rises 12% in FY20, Premjis forgo variable"]], "sub_heading": [["Founder Azim Premji and Chairman Rishad Premji have foregone profit-linked commissions for the year, according to the filing. "]], "time": [["Last Updated: Jun 02, 2020, 01.24 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Bengaluru: The compensation of ", "Wipro", "’s outgoing CEO ", "Abidali Neemuchwala", " rose 12% to $4.4 million in fiscal year 2020, according to a company filing with the US Securities and Exchange Commission. Founder ", "Azim Premji", " and Chairman ", "Rishad Premji", " have foregone profit-linked commissions for the year, citing uncertainty in business environment due to the ", "Covid-19", " pandemic, according to the filing.\n", "\n", "“In view of the current situation caused by Covid-19, uncertainty in business is likely to last for the next few months. To show solidarity with the team in facing the challenge, Azim Premji, Founder Chairman, has foregone the profit-linked commission payable to him for the relevant period for financial year 2019-2020,” the filing showed. \n", "\n", "Rishad Premji also did not take profit linked commission and variable pay during the year, it said.\n", "\n", "The salary of Jatin Dalal, the chief financial officer at the Bengaluru-headquartered IT services exporter, fell by as much as half to around $590,000.\n", "\n", "Wipro, like cross-town rival Infosys, has warned of significant business impact from the Covid-19 virus outbreak and reduction in value of assets. \n", "\n", "“If the Covid-19 pandemic has a substantial impact on our employees’, partners’ or customers’ attendance or productivity, our results of operations and overall financial performance may be harmed, and the recoverable value of our assets may be significantly reduced, which may result in impairment loss,” it said. \n", "\n", "The IT services provider said clients could delay payment, request for change in payment terms or default due to the ongoing financial crisis. \n", "\n", "The International Monetary Fund has predicted that the global economy will shrink by 3% tis year.\n", "\n", "The economic fallout and subsequent recovery will depend on multiple factors, such as the success of containment efforts and rate of recovery from the Covid-19 pandemic, supply chain disruptions, impact of lockdowns, repercussions of any dramatic tightening in global financial market conditions, shifts in consumer behaviour and spending patterns and volatile commodity prices, including oil prices, Wipro said.\n", "\n", "“If we are not able to respond to and manage the impact of such events effectively, our business will be adversely impacted,” said Wipro in the filing. \n", "\n", "Tata Consultancy Services CEO Rajesh Gopinathan also did not take profit-linked commission during the year, citing the pandemic.\n", "\n", "Gopinathan’s income dropped by 16.5% to Rs 13.3 crore in the fiscal year ended March 31, from Rs 16.04 crore in the previous financial year, the company said in its annual report. \n", "\n", "At Infosys, however, CEO Salil Parekh’s total remuneration jumped 27% to $6.15 million in the financial year 2019-20, while chief operating officer Pravin Rao’s compensation rose 29% to nearly $2.3 million. Chairman Nandan Nilekani did not take any compensation, as promised when he took over in August 2017.\n", "\n"]], "tags": ["Abidali Neemuchwala", "Wipro", "Azim Premji", "Rishad Premji"]},
{"heading": [["Infosys CEO Salil Parekh draws Rs 34.27 crore pay package in FY20"]], "sub_heading": [["Interestingly, TCS CEO and MD Rajesh Gopinathan had seen his pay package shrinking more than 16 per cent to Rs 13.3 crore in 2019-20 compared to the previous fiscal. "]], "time": [["Last Updated: Jun 02, 2020, 04.21 PM IST"]], "publisher": [["PTI"]], "article": [["Infosys", " CEO Salil Parekh saw his pay package growing about 39 per cent to Rs 34.27 crore in 2019-20, according to the company's annual report. Parekh's compensation was at Rs 24.67 crore in 2018-19. \n", "\n", "The company's annual report for 2019-20 showed that his compensation included Rs 16.85 crore in salary, Rs 17.04 crore in stock options and Rs 38 lakh (others). \n", "\n", "Infosys chairman ", "Nandan Nilekani", " voluntarily chose not to receive any remuneration for his services, the report said. \n", "\n", "Chief Operating Officer U B Pravin Rao's compensation rose 17.1 per cent to Rs 10.6 crore in FY20 from Rs 9.05 crore in the previous fiscal. \n", "\n", "Interestingly, TCS CEO and MD ", "Rajesh Gopinathan", " had seen his pay package shrinking more than 16 per cent to Rs 13.3 crore in 2019-20 compared to the previous fiscal. \n", "\n", " While ", "Wipro", " CEO Abidali Z Neemuchwala saw his compensation rise 11.8 per cent to USD 4.42 million (about Rs 33.38 crore) in fiscal 2020 from the previous year. \n", "\n", "In his note to shareholders in the annual report, Infosys CEO Parekh said the company will closely monitor the impact of the pandemic as the market and client activity evolve. \n", "\n", "\"We can already see several European countries and US states starting to re-open. We see stability and expansion in our work in the global telecommunications, high technology and life sciences industries,\" he said. \n", "\n", "Parekh noted that while methods like wearing masks, regular hand washing, and keeping safe distance help in increasing individual safety, the critical medical milestones of therapeutic and vaccine solutions are in the future. \n", "\n", "\"We remain extremely focussed on the needs of our clients in this environment and even more ready to expand our support to our clients as the world collectively emerges from the unprecedented situation,\" he said. \n", "\n", "Nilekani, in his address, also emphasised that the post-cloud era - characterised by increasingly intelligent, autonomous and self-healing ", "digital infrastructure", " - is bringing the industry the opportunity to do more. \n", "\n", "\"Our strong balance sheet, great growth momentum, scaled digital systems for our people to deliver collaboratively and an executive management team relentlessly focussed on executing our digital strategy, uniquely position Infosys to deal with the unprecedented challenges of these times and help our clients navigate to the next normal,\" he added. \n", "\n", "Infosys' 39th annual general meeting (AGM) will be held on June 27 through video conference and other audio visual means (VC).\n"]], "tags": ["Infosys ceo pay package", "Sahil Parekh", "New Delhi", "Wipro", "digital infrastructure", "Rajesh Gopinathan", "Infosys", "Nandan Nilekani"]},
{"heading": [["HCL Tech signs seven-year exclusive partnership with Temenos"]], "sub_heading": [["The exclusive strategic agreement will be for non-financial services enterprises, where HCL has been granted a license to develop, market and support Temenos multiexperience development platform (MXDP). This agreement will help provide HCL's non-financial services clients leading technology and the higher levels of services and support."]], "time": [["Last Updated: Jun 02, 2020, 05.55 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: The country's third largest software services firm ", "HCL Technologies", " has signed a seven year partnership with ", "Temenos", " a banking software company. The exclusive strategic agreement will be for non-financial services enterprises, where HCL has been granted a license to develop, market and support Temenos multiexperience development platform (", "MXDP", ").\n", "\n", "Temenos will continue its R&D investment in its Temenos MXDP, and will support and service both Temenos financial services clients as well as existing non-financial services clients that are currently contracted with Temenos.\n", " \n", "Darren ", "Oberst", ", CVP and Head of HCL Software, said that ", "HCL Software", " will continue to grow its technology in a strategic way and will invest in innovation. \"Temenos’ multi-experience development platform is the market leader and very complimentary to our portfolio. We’re excited about what the future holds, and the value this will bring to non-financial services enterprises.”\n", "\n", "This agreement will help provide HCL's non-financial services clients leading technology and the higher levels of services and support.\n", "\n", "For Temenos, it will mean enhanced visibility on profitability and cash flow and underlines the resilience of Temenos’ business model.\n", "\n", "Max Chuard, Chief Executive Officer, Temenos, said: “We are excited to announce this exclusive agreement with HCL, which ensures non-financial services clients have the best possible service and support, while allowing Temenos to focus on its core business of financial services. Under the agreement, non-financial services clients will continue to benefit from our significant R&D investment and innovation roadmap in the Quantum platform while HCL will bring world-class, cross-industry R&D and professional services.”\n", "\n"]], "tags": ["HCL Technologies", "Temenos", "mxdp", "HCL Software", "Oberst"]},
{"heading": [["Wipro anticipates lower gross margins in short-term amid pandemic"]], "sub_heading": [["The Bengaluru-based firm noted that the conditions caused by the COVID-19 pandemic can affect the rate of customer spending, including through cancellations or ramp-downs of existing projects, increased requests for furloughs and price discounts. "]], "time": [["Last Updated: Jun 01, 2020, 09.39 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: IT major ", "Wipro", " anticipates a decrease in its gross margins in the short-term due to lower demand for IT products and delay in customers' purchasing decisions, resulting from the ongoing COVID-19 pandemic, as per a ", "regulatory filing", ". The Bengaluru-based firm noted that the conditions caused by the COVID-19 pandemic can affect the rate of customer spending, including through cancellations or ramp-downs of existing projects, increased requests for furloughs and price discounts. \n", "\n", " Such a scenario could \"adversely affect our ", "future revenues", ", operating results and overall financial performance,\" Wipro said in its 20-F filing to the US Securities and Exchange Commission (", "SEC", "). \n", "\n", " \"In the short term, there may be a decrease in gross margins due to any decrease in technology spending, lower demand for IT products, lower rate of customer spending, delay in customers' purchasing decisions resulting from the ongoing COVID-19 pandemic,\" it added. \n", "\n", " The ", "coronavirus", " outbreak has disrupted businesses across the world. Like many of its peers, Wipro has also refrained from providing a revenue outlook citing uncertainty on account of COVID-19 outbreak as the reason for the decision. \n", "\n", " In response to COVID-19, the company is focusing on various cost optimisation initiatives, Wipro said. \n", "\n", " This includes re-skilling and re-deployment of its workforce from its existing pool of talent, and new hiring will be done only for business-critical reasons. \n", "\n", " The company is optimising costs relating to travel, facilities and other discretionary spends like marketing events, as well as deferring annual increases in salary and progression cycles. \n", "\n", " It is also optimising its variable workforce (ie sub-contractors), including replacing them with its existing internal pool of talent, Wipro said. \n", "\n", " The filing noted that Wipro CEO Abidali Z Neemuchwala saw his pay package rise 11.8 per cent to USD 4.42 million (about Rs 33.38 crore) in fiscal 2020 from the previous year. \n", "\n", " This included USD 1.07 million in salary and allowances, USD 1.29 million in commission/variable pay, USD 2.04 million (others) and USD 4,800 in long-term compensation (deferred benefit). \n", "\n", " Neemuchwala , who announced his resignation in January this year, had drawn a package of USD 3.95 million (about Rs 27.32 crore) in fiscal 2019. \n", "\n", " Wipro has named Capgemini veteran Thierry Delaporte as the CEO and MD of the company, who will take over the role at Wipro on July 6. \n", "\n", " Rishad A Premji received USD 683,496 (about Rs 5.15 crore), while Azim H Premji received USD 135,772 (about Rs 1.02 crore) in fiscal 2020, the filing said. \n", "\n", " Wipro Chief Financial Officer Jatin Dalal's pay package was at USD 5,90,016 (about Rs 4.42 crore) in fiscal 2020.\n"]], "tags": ["sec", "Wipro", "future revenues", "coronavirus", "regulatory filing"]},
{"heading": [["1TB Micro SD Card: Dy CM lauds tech firm for making it in Bengaluru"]], "sub_heading": [["The deputy chief minister interacted with Supria Dhanda, the country head of the California headquartered technology company, through video-conferencing, and urged the firm to take advantage of Karnataka's friendly investment policies."]], "time": [["Last Updated: Jun 02, 2020, 08.07 PM IST"]], "publisher": [["ET Bureau"]], "article": [["BANGALORE: Deputy chief minister ", "CN Ashwath Narayan", " on Tuesday conveyed his appreciation to technology company ", "Western Digital", " for developing a 1 TB Micro ", "SD card", " at its facility in ", "Bengaluru", ". \n", "\n", "The deputy chief minister interacted with Supria Dhanda, the country head of the California headquartered technology company, through video-conferencing, and urged the firm to take advantage of ", "Karnataka", "'s friendly investment policies.\n", "\n", "The deputy chief minister, who holds the IT portfolio, said it was indeed a marvel that such a large amount of data could be stored into such a small thumb-sized device, and it was a matter of pride for the government that it was made in Bengaluru. \n", "\n", "The firm has its presence in Bengaluru for the past 15 years and employs about 3000 people at its facility in the city. \n", "\n", "Many firms are manufacturing such micro SD cards in other countries, and Karnataka, with its investor friendly policies was open to offer all support to them if they were to start production in Bengaluru, a hub for technological innovation, he said. \n", "\n"]], "tags": ["Bengaluru", "CN Ashwath Narayan", "Western Digital", "Karnataka", "SD card"]},
{"heading": [["Govt highlights advantage of Aarogya Setu, but stops short of making it compulsory in new guidelines"]], "sub_heading": [["Early this month, a French hacker and cyber security expert who goes by the name Elliot Alderson had claimed that \"a security issue has been found\" in the app and that \"privacy of 90 million Indians is at stake\".  The government had categorically rejected this claim saying no data or security breach has been identified in the app and \"no personal information of any user has been proven to be at risk by this ethical hacker\". "]], "time": [["Last Updated: May 17, 2020, 11.20 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The government appears to have made ", "Aarogya Setu", " optional, scaling down its earlier directive that had made it compulsory for several categories of people to download the mobile app which monitors the spread of Covid-19. In fresh guidelines issued Sunday on ", "lockdown 4", ".0, the government has focused on the advantage of the app saying it enables for early identification of potential risk of infection and thus acts as a shield for individuals and the community. \n", "\n", " \"With a view to ensuring safety in offices and work places, employers on best effort basis should ensure that Aarogya Setu is installed by all employees having compatible mobile phones,\" it said. \n", "\n", " In its May 1 guidelines, the government had said \"use of Aarogya Setu app shall be mandatory for all employees, both private and public. It shall be the responsibility of the head of the respective organisation to ensure 100 per cent coverage of the app among the employees\". \n", "\n", " Sunday's guidelines also said district authorities \"may advise\" individuals to install the app on compatible mobile phones and regularly update their health status as this will facilitate timely provisions of medical attention to those individuals who are at risk. \n", "\n", " The last guidelines had said that the local authority \"shall ensure 100 per cent coverage of Aarogya Setu app among the residents of containment zones\", a point no more mentioned in the latest one. \n", "\n", " Early this month, a French ", "hacker", " and cyber security expert who goes by the name Elliot Alderson had claimed that \"a security issue has been found\" in the app and that \"privacy of 90 million Indians is at stake\". \n", "\n", " The government had categorically rejected this claim saying no data or security breach has been identified in the app and \"no personal information of any user has been proven to be at risk by this ethical hacker\". \n", "\n", " \"We are continuously testing and upgrading our systems. Team Aarogya Setu assures everyone that no data or security breach has been identified,\" the government had said through the app's Twitter handle.\n"]], "tags": ["Aarogya Setu | New Lockdown guidelines", "aarogya setu", "Covid App", "hacker", "coronavirus", "lockdown 4"]},
{"heading": [["CBI alerts states on malicious software"]], "sub_heading": [["Based on inputs received from INTERPOL, CBI has issued an alert relating to a banking Trojan known as Cerberus, the agency said. It added that the malicious software takes advantage of COVID-19 Pandemic to impersonate and send SMS using the lure of COVID-19 related content to download the embedded malicious link."]], "time": [["Last Updated: May 19, 2020, 06.50 PM IST"]], "publisher": [["ET Bureau"]], "article": [["NEW DELHI: ", "The Central Bureau of Investigation", " (", "CBI", ") has issued an alert to States and Central agencies pertaining a ", "malicious software threat", " that uses an update related to the ", "Coronavirus pandemic", ". \n", "\n", "Based on inputs received from ", "INTERPOL", ", CBI has issued an alert relating to a ", "banking Trojan", " known as Cerberus, the agency said. It added that the malicious software takes advantage of COVID-19 Pandemic to impersonate and send SMS using the lure of COVID-19 related content to download the embedded malicious link, which deploys its malicious app usually spread via phishing campaigns to trick users into installing it on their smartphones.\n", "\n", "This Trojan primarily focuses on stealing financial data such as credit card numbers. In addition, it can use overlay attacks to trick victims into providing personal information and can capture two-factor authentication details, the agency said. \n", "\n"]], "tags": ["The Central Bureau of Investigation", "coronavirus pandemic", "CBI", "banking trojan", "malicious software threat", "interpol"]},
{"heading": [["Large Indian IT firms earn more with lesser hiring"]], "sub_heading": [["Tata Consultancy Services, Infosys, HCL Technologies, Wipro and Tech Mahindra are increasingly seeing double-digit growth in services delivered using artificial intelligence-based platforms, automation tools and other digital technologies."]], "time": [["Last Updated: Jun 02, 2020, 10.54 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["India’s top five IT services providers have hired fewer people over the last five years when compared to their ", "revenue growth", ", suggesting greater adoption of automation and digital technologies.\n", "\n", "Tata Consultancy Services, ", "Infosys", ", HCL Technologies, ", "Wipro", " and Tech Mahindra are increasingly seeing double-digit growth in services delivered using artificial intelligence-based platforms, automation tools and other digital technologies.\n", "\n", "At the same time, business from core services such as application development, maintenance and infrastructure services have fallen.\n", "\n", "The trend can be attributed to their efforts to achieve higher utilization and automation at the bottom of the pyramid for mundane tasks, analysts said.\n", "\n", "“Automation at the lower end, higher utilization and small bench have resulted in such hiring growth … Directionally, every company is pushing for higher utilization,” said Madhu Babu, an IT analyst at brokerage firm Centrum.\n", "\n", "TCS, India’s largest software services exporter with a total workforce of 4,48,464 as of March, saw 7% compounded annual growth rate (CAGR) in hiring.\n", "\n", "The company’s revenue, meanwhile, grew 10.64% every year to reach Rs 1,56,949 crore in the previous financial year from Rs 94,648 crore in 2014-15.\n", "\n", "Infosys, whose revenue growth was slightly higher growth at 11.23% since financial year 2015, saw headcount increase by 6.59% during the past five years.\n", "\n", "The Bengaluru-based company now has 2,42,371 employees and revenue of Rs 90,791 crore as of financial year 2019-20.\n", "\n", "Infosys’ cross-town rival, Wipro, saw nearly 3% growth in hiring each year since ", "FY15", ". Its revenue has grown at 5.38% CAGR during the same five-year period.\n", "\n", "HCL Technologies, in comparison, fared better on the revenue front with a CAGR of 13.77% even as hiring stayed at 7.23%. The company added 47,032 employees in the last five years to take its headcount to 150,423.\n", "\n", "The biggest disparity between hiring and revenue growth was seen at Tech Mahindra.\n", "\n", "Revenue grew at a CAGR of 10.26%, but employees were added at a slower pace of nearly 4% every year on average.\n", "\n", "According to Centrum’s Babu, the higher disparity at Tech Mahindra could mean there is a greater number of subcontracted staff deployed at projects.\n", "\n", "Infosys last week said in a filing to the US Securities and Exchange Commission that its automation tools and platforms have helped it cut manual efforts and cater to changing demand from organisations for increased online services.\n", "\n", "“With our automation assets, analytics-driven operations, and rapid environment deployment solutions, we have been able to reduce manual effort, improve asset utilization, and accelerate time-to-market,” it said.\n", "\n"]], "tags": ["tata consultancy services", "tcs", "Wipro", "FY15", "revenue growth", "Infosys"]},
{"heading": [["AI heading to the frontline in battle against Covid-19"]], "sub_heading": [["Tech to the Rescue Bennett University webinar, ‘AI Solutions for Covid’, highlighted the crucial role technology can play in preventing and mitigating health emergencies around the world"]], "time": [["Last Updated: May 26, 2020, 08.24 AM IST"]], "publisher": [["ET Bureau"]], "article": [["BENGALURU: Artificial intelligence (AI) can help doctors, researchers and governments fight the Covid-19 pandemic, technology giants said while discussing solutions for the highly contagious disease during a webinar organised by ", "Bennett University", ". \n", "\n", "“The Covid-19 pandemic is the most important disruption of our time. It has prompted nations, individuals, and organisations to adopt digital in a big to survive, scale, and succeed. It is helping navigate the pandemic,” said Sandip Patel, managing director of India at ", "IBM", ".\n", "\n", "The theme of the global webinar, organised by the Department of Computer Science Engineering of BU on Monday, was ‘", "AI Solutions for Covid", "’. \n", "\n", "The Indian Council of Medical Research", " (ICMR) tied up with IBM earlier in the month to use its AI-based tool ", "Watson", " Assistant to respond to specific Covid-19 queries of frontline workers and data entry operators.\n", "\n", "Patel said that IBM’s technology solutions can be used for strengthening IT operations, streamline IT recovery, and immunize organisations from disruption, empower workflows and productivity. Manish Gupta, director of Google Research India, said the company was harnessing the predictive information it has in helping migrant workers. It could be in identifying food camps and night shelters on Google maps, extending it in Search, and enabling voice assistants so that people can make voice queries.\n", "\n", "Google also has enabled it on KaiOS, the operating system that runs on feature phones of Reliance Jio, not just smartphones.\n", "\n", "In India, where cardiovascular diseases are higher, Gupta said Google was looking at AI and technology-based interventions through proper monitoring and to delay the onset by as much as 10-15 years or even prevent it.\n", "\n", "“We are working on applying AI to gather all the health signals in a privacy preserving manner and building these risk models and allowing a health companion to find timely intervention, lifestyle and clinical interventions,” he said.\n", "\n", " Vishal Dhupar, MD, NVIDIA, South Asia said that technology solutions are helping doctors treat patients and robots deliver drugs. \n", "\n", "“At NVIDIA, we are working to push the boundaries of technology to do more in the time to come - whether it's supercharging the analysis of genomes, better at discovering infections, or creating safer working environments for front-line forces,” he said. “Use Supercomputer/AI to fight the next pandemic”.\n", "\n"]], "tags": ["Bennett university", "ai solutions for covid", "IBM", "watson", "The Indian Council of Medical Research"]},
{"heading": [["Use AI with fairness and responsibilty: National Tech officer, Microsoft India"]], "sub_heading": [["Rohini Srivathsa, National Technology Officer, Microsoft India said organisations and developers have to nurture practices to make sure AI is used responsibly as it has “broad ramifications”."]], "time": [["Last Updated: May 25, 2020, 09.09 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Bengaluru: With technologies such as ", "artificial intelligence", " (", "AI", ") set to play a key role in a post-pandemic world, it is important to use technology-based tools with fairness and responsibility, said Rohini Srivathsa, National ", "Technology", " Officer, ", "Microsoft", " India. \n", "\n", "Srivathsa was speaking at the ", "Bennett University", " webinar on Monday on how AI is enabling solutions to the Covid-19 ", "pandemic", ", which has devastated lives and livelihoods across the world. \n", "\n", "The technology sector leader said organisations and developers have to nurture practices to make sure AI is used responsibly as it has “broad ramifications”.\n", "\n", "“Because AI is so pervasive, and it has such broad ramifications we need to think about responsible AI practices from the time of designing the product. At Microsoft, this has been a multi-year journey for us in terms of thinking about responsible AI practices from fairness to privacy to security to transparency,” she said. \n", "\n", "Srivathsa also emphasised on the need for taking principles of responsible AI into practice.\n", "\n", "“How do we make them real for organisations, make them real for developers in terms of tools that help them check for fairness, hidden biases with data, differential privacy. We really do take this very seriously and Covid-19 has brought this to the forefront.” \n", "\n", "Anant Agarwal, chief executive officer of edX, said technologies such as AI, machine learning, data science would change the way people live, especially after such unprecedented disruption and it is important to scale up online learning opportunities for people. \n", "\n", "“AI is changing the face of everything and online learning is very affordable and scalable,” said Agarwal.\n", "\n", "“We launched a course (by Harvard University) on mechanical ventilation for Covid-19 and we have 230,000 students from all over the world and 20,000 from India alone in one month. So, online learning can be used to very rapidly scale up training in the fields that are critical now,” he said.\n", "\n", "Sanket Baralay, founder and chairman, Digishield, said fresh challenges have come up in implementing AI tools with the pandemic and efforts should be made to address them. \n", "\n", "“As I think about the role of AI in controlling Covid-19 a lot of interesting challenges have come up. In India, individual health data digitisation is almost non-existent. The civic digitisation is happening at faster pace, but the ability to use that data in coordination with the civic bodies is a tremendous challenge,” said Baralay.\n", "\n", "Digishield is working to address these challenges in a manner that will benefit in containment of the outbreak and working with civic bodies, he added. \n", "\n"]], "tags": ["ai", "artificial intelligence", "Microsoft", "Bennett university", "technology", "pandemic"]},
{"heading": [["Telemedicine collective StepOne makes it to Aarogya Setu Mitr"]], "sub_heading": [["Launched in March 2020, StepOne represents the largest number of nationwide volunteer doctors, 21 startups, and active citizenry to power state government helpline numbers to combat Covid-19 and mental health issues. It operates in seven states including Karnataka, Punjab, Maharashtra, Odisha, Chattisgarh, Madhya Pradesh, and Nagaland."]], "time": [["Last Updated: May 20, 2020, 10.25 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["CHENNAI: ", "StepOne", ", a volunteer-driven telemedicine collective, has become an empanelled partner for telemedicine consultations on ", "Aarogya Setu Mitr", ", an ancillary service on the ", "Aaroya Setu", " app that enables free tele-consultation for those with ", "COVID19-like symptoms", ".\n", "\n", "Launched in March 2020, StepOne represents the largest number of nationwide volunteer doctors, 21 startups, and active citizenry to power state government helpline numbers to combat Covid-19 and ", "mental health issues", ".\n", "\n", "“In March when we ideated StepOne, our simple mission was to keep people at home, to support them in overcoming their fears and uncertainties with regard to COVID-19 symptoms,\" said Rahul Gupta from StepOne. \"", "Tele-screening", " is the fastest and physically the most distanced way to identify suspects and guide them to self-isolate so that they don’t infect more citizens or our healthcare workers.\"\n", "\n", "He said that it is an inclusive solution that works across geographies and is 'device-agnostic,' as citizens can call using feature or smart-phones.\n", "\n", "StepOne operates in seven states including Karnataka, Punjab, Maharashtra, Odisha, Chattisgarh, Madhya Pradesh, and Nagaland.\n", "\n", "The helpline records the citizen input on symptoms and travel history, assigns a priority flag based on which they get a call back from the doctor powered through cloud telephony. The IVR has been localised for every state and is currently live in English, Hindi, Kannada, Marathi, Odia, Punjabi and Nagamese.\n", "\n", "In the last seven weeks over one million calls have been triaged, and 70,000 tele-consults undertaken by over 6000 verified doctors. The consultations have led to the identification of over 3000 high-risk patients, for whom the respective state governments have taken appropriate action.\n", "\n", "The initiative also has set up the technology backend for mental health helplines in the states of Punjab, Odisha, and Karnataka due to high anxiety levels and mental trauma owing to challenging economic and health conditions.\n", "\n", "StepOne was also the first Covid-19 combat project to get a grant from the ACT Fund, set up by various venture capital firms and entrepreneurs to support initiatives fighting against the infection. The initiative received a grant of 25 lakhs from ACT grants and a matching contribution from ", "Omidyar Network India", ". The funds are being allocated to cover infrastructure expenses such as telecom, and servers.\n", "\n"]], "tags": ["mental health issues", "Aarogya Setu Mitr", "aaroya setu", "Omidyar Network India", "stepone", "CLoud communications"]},
{"heading": [["Government makes Aarogya Setu open source; launches bug bounty programme"]], "sub_heading": [["The government hopes to leverage the expertise of top technical brains in the country to improve the platform by releasing the source code, which has been a key demand of privacy experts. The platform has been aiding frontline workers in the fight against the pandemic. "]], "time": [["Last Updated: May 26, 2020, 11.32 PM IST"]], "publisher": [[", ET Bureau"]], "article": [[" The government has released the source code of its ", "Covid-19", " contact tracing app, ", "Aarogya Setu", ", on software development platform ", "GitHub", ", in line with India’s policy on ", "Open Source Software", ".\n", "\n", "The government hopes to leverage the expertise of top technical brains in the country to improve the platform by releasing the source code, which has been a key demand of privacy experts. The platform has been aiding frontline workers in the fight against the pandemic. \n", "\n", "Principal Scientific Adviser Prof. K VijayRaghavan said that contact tracing historically has been done manually during times of contagion, but this usually takes weeks. \"...This allows us to effectively battle the disease,\" he said.\n", "\n", "The government has also launched a Bug Bounty Programme so that security researchers and the Indian developer community can test the effectiveness of Aargoya Setu and improve or enhance its security as well as build user trust.\n", "\n", "\"Transparency, privacy and security have been the core design principles of Aarogya Setu since its inception and opening the Source Code to the developer community signifies the government's continued commitment to these principles,\" said Amitabh Kant, CEO of Niti Aayog.\n", "\n", "The source code for the Android version of the application is available for review and collaboration, while the iOS version will be released as open source within the next two weeks.\n", "\n", "Almost 98% of Aarogya Setu users are on the Android platform.\n", "\n", "The App has been downloaded by over 114 million users as on May 26, more than any other contact tracing app in the world, the government said in a statement.\n", "\n", "\"Even though the Personal Data Protection Bill is still before Parliament, we have implemented the principles of data privacy in designing this app,” said Ajay Sawhney, secretary in the Ministry of Electronics and IT. \n", "\n", "So far, the platform has reached out to more than 900,000 users and helped advise them on quarantine, caution or testing.\n", "\n", "Among those recommended for testing, almost 24% have been found positive for the infection compared to the overall Covid-19 positive rate of around 4.65% as on May 26.\n", "\n", "\"India is keen to share learnings from our approach to technology to fight Covid-19 and make the benefits of the solution available to the rest of the world and any government can use it for fighting the pandemic,\" it said.\n", "\n", "The Aarogya Setu team has identified more than 3,500 hotspots across the country at sub-post office level, it added.\n", "\n", "\n"]], "tags": ["aarogya setu", "GitHub", "Open Source Software", "contact tracing app"]},
{"heading": [["Amid rising anti-China mood, local app Mitron eats into TikTok's India market in eye-popping manner"]], "sub_heading": [["Mitron saw a 4x jump in downloads to 5.4 mn between April and May 25, according to data from Sensor Tower. "]], "time": [["Last Updated: May 28, 2020, 08.17 PM IST"]], "publisher": [[", TNN"]], "article": [["CHENNAI: With over half a million downloads every day, a ", "TikTok", " clone called 'Mitron' has climbed up the chart of top Indian alternatives for the Chinese short videos app within a month since its launch. Led by 31-year-old IIT-Roorkee alumnus Shivank Agarwal, with his team of less than 5 members based out of Bengaluru, the Android app ", "Mitron", " - the word means friends, and is often used by Prime Minister Narendra Modi - was launched in April 2020.\n", "\n", "Designed for people to showcase and share their innovative videos, Mitron saw a 4x jump in downloads to 5.4 million between April and May 25, according to data from app intelligence firm Sensor Tower. Listed by its parent company Shopkiller.in, it has bagged a rating of 4.7 out of 5 on the Google Play Store.\n", "\n", "Speaking on the genesis of this self-funded app, a spokesperson for the team told TOI, \"Indian consumers and content creators should be served by an Indian platform. We never aimed at competing with anyone when we launched our product. Our mantra was to provide users with an Indian alternative (to the Chinese app TikTok). Whether people would want to use it or not is not in our hands. But, we are pleased with the outcome.\"\n", "\n", "The very name Mitron seems to have ensured some free publicity for the app. However, the spokesperson said, \"Mitron means friends. The question would never have come up if we had named it 'Friends'. This is the prejudice against an Indian name, which we want to remove.\"\n", "\n", "The news comes at a time when India user downloads for TikTok fell drastically by 48% from 35.7 million to 18.5 million between March and May. This is in contrast to the growth of downloads registered at 7% in February and 8% in March this year. Overall, the app's downloads shrunk from 119 million to 90.6 million in the same period, recording a 15% fall. In total, TikTok has gene rated more than 2.1 billion downloads to date during its lifetime, with 633 million downloads in India.\n", "\n", "The Chinese short video application is owned by ByteDance, the world's most valued private technology company at $100 billion. Many people had been tweeting and trending anti-Chinese sentiment since the coronavirus pandemic originated in the neighbouring country and Indo-China border tensions also flared up early in May.\n", "\n"]], "tags": ["TikTok", "mitron download", "TikTok Download", "mitron app", "mitron"]},
{"heading": [["Telangana's IT exports grows 18% at Rs 1.28 lakh cr in FY'20"]], "sub_heading": [["The exports stood at Rs 1,28,807 crore in FY '20 against Rs 1,09,219 crore in the FY '19. The sector has 5,82,126 employees as of March 31 against 5,43,033 personnel at the end of 2018-19, the release said. "]], "time": [["Last Updated: May 21, 2020, 05.06 PM IST"]], "publisher": [["PTI"]], "article": [["Hyderabad: ", "IT exports", " from ", "Telangana", " has grown by 17.93 per cent in the last financial year at Rs 1.28 lakh crore even as the sector created about 40,000 new jobs. \n", "\n", "Despite the onset of the ", "COVID-19", " during the last quarter of the financial year 2019-2020, the ", "export growth", " of the state managed to record a phenomenal 17.93 per cent growth for the full financial year. \n", "\n", "This is more than double that of the national growth, an official press release quoted IT Minister KT Rama Rao as saying. \n", "\n", "The exports stood at Rs 1,28,807 crore in FY '20 against Rs 1,09,219 crore in the FY '19. The sector has 5,82,126 employees as of March 31 against 5,43,033 personnel at the end of 2018-19, the release said. \n", "\n", "Chief Minister K ", "Chandrasekhar Rao", " said he was happy to see the share of Telangana's exports going up from 10.6 per cent to 11.6 per cent. \n", "\n", "This clearly indicates that Telangana is poised to be the preferred destination for IT investments in the future, he said. \n", "\n", "The Chief Minister directed the IT department to ensure that all measures and precautions be taken to ensure that the IT industry functions smoothly, keeping in view the COVID-19 pandemic, the release said. \n", "\n", "During 2019-20, several marquee investments have taken place in Hyderabad, including the inauguration of Amazons worlds largest facility at three-million sq ft and Microns largest Research and Development centre globally. ", "Tech Mahindra", " and Cyient have chosen to open their centres in the tier-2 location of Warangal, it added.\n"]], "tags": ["IT exports", "Chandrasekhar Rao", "software", "export growth", "Telangana", "Tech Mahindra"]},
{"heading": [["Zoom Video names Indian-origin Velchamy Sankarlingam as president of engineering and product"]], "sub_heading": [["Sankarlingam comes to Zoom after more than nine years at VMware, where he was most recently Senior Vice President, Cloud Services Development and Operations. Reporting directly to Zoom CEO Eric S. Yuan, Sankarlingam will oversee the company’s engineering, product, and dev ops teams."]], "time": [["Last Updated: May 27, 2020, 12.59 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Bengaluru: ", "Zoom Video Communications, Inc.", " appointed Indian-origin Velchamy Sankarlingam as the President of Engineering and Product.\n", "\n", "Sankarlingam comes to ", "Zoom", " after more than nine years at ", "VMware", ", where he was most recently Senior Vice President, Cloud Services Development and Operations.\n", "\n", "Reporting directly to Zoom CEO Eric S. Yuan, Sankarlingam will oversee the company’s engineering, product, and dev ops teams. Zoom recently announced that it will expand its engineering team with up to 500 new headcount based in Phoenix, Arizona and ", "Pittsburgh", ", Pennsylvania.\n", "\n", "“Given the scale at which we operate and the importance of the communications happening on our platform, there is no time for delay and no room for error. Velchamy will help our product, engineering, and dev ops teams work lockstep to support our ever-expanding customer base around the world,” said Yuan.\n", "\n", "His appointment will be effective June 12. \n", "\n", "Despite security issues, the video conferencing app registered a sharp rise in total number of users as the world embraced work from home. Zoom usage has soared from 10 million daily meeting participants back in December to 300 million end of April.\n", "\n", "The app has been flagged by various governments including India for security concerns. \n", "\n"]], "tags": ["Pittsburgh", "zoom video communications, inc.", "Zoom Video Communications", "VMware", "Zoom", "Zoom video"]},
{"heading": [["Indian gaming industry attracted $350 million venture capital investments between 2014-2020: Report"]], "sub_heading": [["​​The report titled 'Gaming - India Story' said the Indian gaming industry currently valued at USD 930 million and is expected to grow at 41 per cent annually. By 2024, the gaming industry in India is set to be valued at USD 3,750 million, it added. "]], "time": [["Last Updated: May 26, 2020, 08.31 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: India's ", "gaming industry", " has attracted about USD 350 million in investments from venture capital firms between 2014 and first few months of 2020, growing at a ", "CAGR", " of 22 per cent, a report by Maple Capital Advisors said on Tuesday. \n", "\n", "The report titled 'Gaming - India Story' said the Indian gaming industry currently valued at USD 930 million and is expected to grow at 41 per cent annually. By 2024, the gaming industry in India is set to be valued at USD 3,750 million, it added. \n", "\n", "This increase will be fuelled by the growth of digital infrastructure and substantial rise in quality and engaging gaming content, it said. \n", "\n", "Some of the big investments include USD 100 million investment in ", "Dream11", " by Tencent and Steadview Capital (2016), USD 41 million investment in Mobile Premier League by ", "Sequoia and Times Internet", " (2019), and USD 20 million in Paytm Games by One97 and AG Tech holdings (2020). \n", "\n", "The three key segments of online gaming are - ", "Real Money Games", " (RMG), Mobile-centric/casual games and E-sports. \n", "\n", "\"We have seen growing investment traction in gaming with over USD 350 million of investments. With growing internet penetration, compelling economics, usage statistics and increasing ecosystem of entrepreneurs and developers focusing on this space we expect good growth in investments which are likely to at least double in this space in the next 1-2 years,\" Maple Capital Advisors Managing Director Pankaj Karna said. \n", "\n", "He added that marquee VCs have begun meaningful investments and it is likely that private equity will enter gaming in a more meaningful way going forward. \n", "\n", "\"Gaming is at inflexion stage in India with rapid rise in consumption expected and investments likely to accelerate...We also expect select consolidation by larger platforms to add categories and fill gaps,\" he said. \n", "\n", "The report noted that there are over 400 gaming start ups in India. \n", "\n", "The fantasy sports landscape in India has witnessed a significant transformation and the number of fantasy sports operators have increased by seven times over 2016-2018, whereas the number of users has grown by over 25 times from June 2016 to February 2019. E-sports has shown strong user growth but lags on profitability. \n", "\n", "There is also an increasing traction towards multiplayer games that has been observed post the onset of ", "PUBG", " in India.\n"]], "tags": ["sequoia and times internet", "Gaming industry", "CAGR", "Dream11", "Real Money Games", "pubg"]},
{"heading": [["MeitY fast-tracks work on ₹5K-cr fund-of-funds"]], "sub_heading": [["MeitY officials are expected to approach the finance ministry as early as next week with a detailed proposal for the Software Product Development Fund (SPDF), according to three sources aware of the developments."]], "time": [["Last Updated: May 29, 2020, 07.45 AM IST"]], "publisher": [[", "]], "article": [["New Delhi | Bengaluru: ", "The Ministry of Information Technology", " (", "MeitY", ") is fast-tracking its ambitious ₹5,000-crore fund-of-funds targeted at deploying much-needed domestic capital into India’s ", "software products ecosystem", ", as the government looks to reopen the economy in a phased manner after a two-month lockdown. \n", "\n", "MeitY officials are expected to approach the finance ministry as early as next week with a detailed proposal for ", "the Software Product Development Fund", " (SPDF), according to three sources aware of the developments. The SPDF was first announced in the National Policy on Software Products, which was approved by the Union cabinet in February last year. \n", "\n", "The Covid-19 pandemic-induced lockdown effectively shut down Asia’s third-largest economy, but with its gradual reopening under strict guidelines ministry officials are now speeding up the fine tuning of the fund and are expected to have a cabinet note ready by early-July. The ministry is also considering tapping the country’s bellwether information technology services companies, including TCS, Infosys and Wipro, apart from large family offices, to serve as limited partners or investors in the fund, sources told ET. \n", "\n", "\n", "They indicated that there was a preference towards raising domestic or Rupee capital for the proposed ₹5,000-crore fund-of-funds. \n", "\n", "“If companies like Infosys and TCS show interest in software product development, which carries good valuation, then we would be delighted to have them on board,” said a senior government official. “Of course, Rupee capital is more than welcome in the fund, compared to foreign capital.”\n", "\n", "While ministry officials are expected to formally approach corporates by end-June or early-July, back channel talks between the parties have already been initiated. “We are targeting that after cabinet approval, by the last quarter of this financial year we should be able to disburse something,” the official said on condition of anonymity.\n", "\n", "Sources also indicated that MeitY may look at third parties to manage the fund, with the likes of ", "SBI Funds Management", ", which manages SBI Mutual Funds, and ", "HDFC AMC", " being thrown into the mix as potential fund managers for SPDF.\n", "\n", "MeitY, Wipro, SBI and HDFC did not respond to ET’s emails till the time of going to press. Infosys declined to comment.\n", "\n", "MeitY’s current plan is to deploy the ₹5,000-crore corpus into at least 50 daughter funds that would comprise of Sebi-registered Category 1 and Category 2 Alternative Investment Funds, by the last quarter of the current financial year. These daughter funds would, in turn, back startups in the software products sector.\n", "\n"]], "tags": ["the software product development fund", "SBI Funds Management", "Coronavirus lockdown", "software products ecosystem", "MeitY", "HDFC AMC", "the ministry of information technology"]},
{"heading": [["HCL's acquires Cisco's SON tech for $49 million; to boost 5G tech deployment"]], "sub_heading": [["The acquisition, which comprises of products and services built on Cisco’s SON technology, will help HCL cater to customers in the telecommunications industry as SON has become a major component in the move towards 5G networks, including tier-one communications service providers globally."]], "time": [["Last Updated: May 29, 2020, 08.11 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["New Delhi: Country's third largest software services firm ", "HCL Technologies", " has announced the acquisition of ", "Cisco", "’s ", "Self-Optimizing Network", " (", "SON", ") ", "technology", " in an all cash deal for $49 million. \n", "\n", "The acquisition, which comprises of products and services built on Cisco’s SON technology, will help ", "HCL", " cater to customers in the telecommunications industry as SON has become a major component in the move towards ", "5G", " networks, including tier-one communications service providers globally.\n", "\n", "As part of the deal, employees who work on Cisco’s SON technology will move from Cisco to HCL.\n", "\n", "“HCL’s decision to make this acquisition comes in line with our Mode 3 strategy. \n", "\n", "As we expand our footprint in this space and support the mobility needs of our customers; the SON products and services will now be included in our telecommunications offerings. This will gain further importance with 5G networks,” said Sukamal Banerjee, Corporate Vice President, HCL Technologies.\n", "\n", "The Cisco SON technology uses machine learning and a set of applications to automate the Radio Access Network (RAN). It helps customers boost performance, harmonize the multiple technologies that comprise a RAN, and maximize the capabilities of?existing infrastructures, resulting in reduced capital and operational expenditures.\n", "\n", "“We are proud to lead the next phase of the Cisco SON business journey, especially regarding 5G, and look forward to supporting new and existing customers with continued innovation,” he added.\n", "\n"]], "tags": ["HCL", "technology", "HCL Technologies", "5G", "Son", "CISCO"]},
{"heading": [["Cities, states launch Covid-19 apps across India, many lack privacy controls"]], "sub_heading": [["These apps have garnered several million downloads already, but many lack a clear or strong privacy policy although they collect personal information such as location data, photos, media, camera, call information, WiFi connection information and device ID, privacy advocates said."]], "time": [["Last Updated: Jun 01, 2020, 11.23 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["BENGALURU: States, city municipal corporations as well as police departments across India have launched 40 apps for Covid-19 contact tracing, quarantine tracking, providing health information and to generate e-passes, even as the central government’s ", "Aarogya Setu", " app remains the face of Covid-19 ", "contact tracing", " efforts across the country.\n", "\n", "These apps have garnered several million downloads already, but many lack a clear or ", "strong privacy policy", " although they collect personal information such as location data, photos, media, camera, call information, WiFi connection information and device ID, privacy advocates said.\n", "\n", "In the absence of a privacy law, privacy activists have termed the apps’ policies and terms of service as ineffective, weak and confusing.\n", "\n", "“While the applications have been developed independently by each government, we have observed some questionable trends, practices, and policy provisions pertaining to the apps,” Software Freedom Law Centre said in a report that studied the privacy policies, terms of service, and permission demanded by these apps. “It is shocking to see the absence of Terms of Service or a Privacy Policy that binds the developer/publisher of the app and its end-user.”\n", "\n", "Information Technology (Intermediaries Guidelines) Rules, 2011 mandate that an intermediary shall publish the terms of use, rules and regulations, and privacy policy pertaining to the platform operated by the intermediary.\n", "\n", "Some of the applications have generated privacy policies from a ", "Firebase", " application, which helps companies generate standardised privacy policy templates depending on the type of app and information accessed. \n", "\n", "The practice is in itself not uncommon although these policies lack clauses that cover important aspects such as data retention and purpose limitation for processing the data that is collected. \n", "\n", "“These apps are also not updated regularly, which poses a cybersecurity threat. There is a sloppy coding patchwork of the apps and sloppy drafting of the privacy policies. They are taking it from templates. Healthcare data is the most sensitive data alongside financial data. It requires a high degree of protection. Users should be able to demand a copy, rectify it and delete it,” said Apar Gupta, Executive Director at Internet Freedom Foundation, a digital advocacy organisation. \n", "\n", "For instance, the Uttar Pradesh government’s Self-Quarantine App does not have an accessible Terms of Service or Privacy Policy document. The privacy policy link on the Google Play Store page directs a user to the state government’s Covid-19 web portal. A policy document was not found there either.\n", "\n", "On the other hand, Punjab’s COVA app has a detailed privacy policy. However, it does not mention how much of the data will be retained after the pandemic or the mode of retention. It also requires permission to access location, IP address, operating system, device ID, and handset make, even though the app is mainly for providing information and advisories. \n", "\n", "Many apps direct users to privacy policies of other state government websites, which may have nothing to do with the ", "Covid-19 app", ".\n", "\n", "Quarantine Monitor app of Tamil Nadu directs users to the privacy policy of the ‘esevai’ (e-Service) portal of the state government, while the Karnataka government’s Quarantine Watch app takes users to the privacy policies of the land records department. \n", "\n", "Emails sent to app developers of Tamil Nadu, Karnataka, Uttar Pradesh, Maharashtra, and Punjab did not elicit a response.\n", "\n"]], "tags": ["aarogya setu", "privacy controls", "Contact tracing", "Firebase", "strong privacy policy"]},
{"heading": [["Data of more than 7 million BHIM site users leaked: Report"]], "sub_heading": [["“There has been no data compromise at BHIM App ... NPCI follows a high level of security and an integrated approach to protect its infrastructure,” it said."]], "time": [["Last Updated: Jun 01, 2020, 11.57 PM IST"]], "publisher": [["ET Bureau"]], "article": [["BENGALURU: More than 7 million ", "user records", " on the CSC BHIM website were exposed in a ", "data leak", ", Israeli cybersecurity website vpnMentor, which reported the breach to Indian authorities in April, said in a blog post on Monday. The breach was plugged by ", "CSC e-Governance Services", ", which developed the portal, on May 22, the cybersecurity firm said.\n", "\n", "The website was used in a campaign to sign up users and business merchants for the ", "BHIM payments app", ", which has been developed by ", "the National Payments Corporation of India", " (", "NPCI", ").\n", "\n", "“There has been no data compromise at BHIM App ... NPCI follows a high level of security and an integrated approach to protect its infrastructure,” it said. The personal records were from February 2019, vpnMentor said.\n", "\n"]], "tags": ["user records", "data leak", "bhim payments app", "NPCI", "The National Payments Corporation of India"]},
{"heading": [["KPIT Technologies expects 15 pc dip in Jun quarter revenues"]], "sub_heading": [["The business should stabilise in the second half of 2020-21 as the world comes out of the COVID-19 pandemic, its co-founder, Managing Director and Chief Executive Kishor Patil told ."]], "time": [["Last Updated: May 29, 2020, 03.06 PM IST"]], "publisher": [["PTI"]], "article": [["Mumbai: Automobile industry-focused software exporter ", "KPIT Technologies", " expects a 15 per cent shrinkage in revenues in the June quarter and a difficult first half of the current financial year, a top official has said. The business should stabilise in the second half of 2020-21 as the world comes out of the COVID-19 ", "pandemic", ", its co-founder, Managing Director and Chief Executive ", "Kishor Patil", " told . \n", "\n", " He said the automobile industry has been among the worst hit by the pandemic and some players have been left without any revenues for the first quarter. \n", "\n", " \"We were looking for a high growth in 2020-21 after delivering a 14.5 per cent revenue growth in constant currency terms to USD 303 million in 2019-20. There will be impact to our business, but our long-term strategies are correct,\" Patil said. \n", "\n", " He added that there will be a decline of 15 per cent in both the volumes as well as revenues in the first quarter. \n", "\n", " When asked if the long-term developmental contracts have witnessed some furloughs, Patil said that the same is the case but exuded confidence that they will come back as product development work cannot stop. \n", "\n", " The bet to concentrate on the top-25 clients has paid back with a revenue growth of 20 per cent from this segment, and this grouping now accounts for over 80 per cent of the revenue base. \n", "\n", " From a geographical segment perspective, the US is more impacted but will also be the first to come back, he said adding that Germany and Japan are showing resilience. \n", "\n", " Auto manufacturers in the passenger cars segment will likely continue making spends on technological aspects, while the ", "commercial vehicle companies", " will be a bit slower, he said. \n", "\n", " Currently, over 98 per cent of its staff is working from home and the company has created simulations where it is necessary to ensure that productivity does not suffer, he said adding that soon, it will be 100 per cent. \n", "\n", " There will be an impact to profit margins as well but the company has decided to hold on to all the employees without any retrenchments, Patil said. \n", "\n", " Some of the emoluments have been moved to the variable side and the same shall be made to employees as per the financial performance at the end of the year, he said adding that yearly hikes, which happen in July, have also been deferred. \n", "\n", " It is also asking freshers to join a bit late in what can be delays of up to six months, Patil said. He added that in the medium term as well, more associates will continue working from home. \n", "\n", " Patil said the business is generating cash faster and the balance sheet has been strengthened with the overall cash now standing at Rs 325 crore as against the Rs 70 crore in the year-ago period. \n", "\n", " The company scrip was trading 4.90 per cent up at Rs 49.20 apiece on the BSE at 1330 hrs.\n"]], "tags": ["commercial vehicle companies", "KPIT Technologies", "Kishor Patil", "pandemic"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["NITI Aayog CEO", "Ajay Prakash Sawhney", "Developer community", "aarogya setu app", "Aarogya Setu source code", "amitabh kant"]}
]