[
{"heading": [["Randstad, Adecco Group, ManpowerGroup, Gi Group join forces to help India get back to work safely"]], "sub_heading": [["The alliance's actions will be focused on sharing best practices on health and safety protocols, which can be used by organisations, to support a safe return to workplaces throughout India, a joint statement said on Wednesday."]], "time": [["Last Updated: May 27, 2020, 12.54 PM IST"]], "publisher": [["PTI"]], "article": [["NEW DELHI: The Indian operations of four leading global HR services companies - Randstad, ", "The Adecco Group", ", ", "ManpowerGroup", " and ", "Gi Group", " - have formed an alliance to jointly tackle the key challenges facing the labour market following the COVID-19 pandemic.\n", "\n", "The alliance's actions will be focused on sharing best practices on health and safety protocols, which can be used by organisations, to support a safe return to workplaces throughout India, a joint statement said on Wednesday.\n", "\n", "\"We are entering a new world of work and it is crucial to be well prepared for this new reality. The emphasis must be on creating a safe environment where employees can be productive and make an impact,\" said Paul Dupuis, MD and CEO, ", "Randstad India", ".\n", "\n", "Initially, the alliance will focus on companies in seven key sectors in India - ", "IT/ITeS", ", ", "manufacturing", ", ", "infrastructure", ", pharma, ", "healthcare", ", life sciences (PHL), consulting and business services, retail and e-commerce. It will consult with various stakeholders in the country in the coming weeks.\n", "\n", "The best practice protocols collated from companies in these seven sectors will be used to create a comprehensive compilation of instructions and concrete measures – a country-specific COVID-19: \"Help India Get Back to Work Safely\" guide with practical advice and health and safety protocols.\n", "\n", "\"COVID-19 has created a great disruption in the labour market and to entire communities and thus, it is imperative to return to work with the necessary precautions,” said Marco Valsecchi, Country Manager & MD, Adecco Group, India.\n", "\n", "The alliance with Randstad, ManpowerGroup and Gi Group is an effort to prepare and contribute to a new normal and to expedite a safe and responsible reopening of economies and workplaces, Valsecchi added.\n", "\n", "Through this alliance, the human resources (HR) services industry is issuing a call to action to all relevant stakeholders to contribute and play their part. This includes employers, trade unions, industry associations, regulatory bodies and non-government organisations.\n", "\n", "\"This is our opportunity to restart the economy to create a future of work that works for everyone, one we know people have been seeking for some time. More digital, more virtual, more connected and more wellbeing-orientated than we could ever have imagined,\" said Sandeep Gulati, MD, ManpowerGroup India.\n", "\n", "The alliance is also reaching out to governments to support, stimulate and endorse these efforts to help India get back to work safely.\n", "\n", "Companies and in particular HR service organisations like the ones in this initiative should play an active role to ensure India is getting back to work safely, Marcos Segador Arrebola, Country Manager, Gi Group India said.\n", "\n", "\"We should treat this COVID-19 crisis as a defining moment for ourselves, our organisations and our country,\" Arrebola added.\n", "\n", "The HR services industry is uniquely positioned to contribute to these efforts by applying its in-depth knowledge of labour market processes through various sectors and companies, the statement said.\n", "\n"]], "tags": ["pharmaceutical industry", "ManpowerGroup", "Gi Group", "IT/ITeS", "infrastructure", "manufacturing", "randstad india", "The Adecco Group", "healthcare"]},
{"heading": [["Asian Paints appoints Amit Syngle as the new MD & CEO, KBS Anand retires"]], "sub_heading": [["Amit Syngle will be appointed as the managing director for a period of 3 years upto 31st March 2023, subject to the approval of the Shareholders at the ensuing Annual General Meeting of the Company, the company said."]], "time": [["Last Updated: Mar 30, 2020, 11.38 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Paint and decor company, ", "Asian Paints", ", Monday announced a change in its top leadership deck as the company’s chief operating officer, ", "Amit Syngle", " will be taking over as the new managing director and chief executive officer with effect from 1st of April, 2020. The company’s current ", "CEO", " & MD, ", "KBS Anand", " will be retiring on 31st of March. \n", "\n", "“The Board of ", "Directors", " at their meeting conducted through video conferencing facility, today, based on the recommendations of the Nomination and Remuneration ", "Committee", " and the Audit Committee of the Board of Directors, have approved the appointment of Mr. Amit Syngle, as an Additional Director/Managing Director and CEO (Key Managerial Person) of the Company,” the company said in its BSE filing. \n", "\n", "Syngle will be appointed as the managing director for a period of 3 years upto 31st March 2023, subject to the approval of the Shareholders at the ensuing Annual General Meeting of the Company, the company said. \n", "\n", "The company communicated its appreciation of immense contribution made by KBS Anand as the Managing Director & CEO of the Company from 1st April, 2012 to 31st March, 2020. \n", "\n", "The paint maker recorded a consolidated net profit of Rs 764.43 crore, a 20% yoy increase for the recent Q3 FY20. Shares of Asian Paints fell 0.56% to trade at Rs 1597.15 on BSE, on Monday.\n", "\n"]], "tags": ["Asian Paints", "mumbai", "committee", "directors", "Amit syngle", "KBS Anand", "CEO"]},
{"heading": [["Under lockdown, India changes shopping habits"]], "sub_heading": [["New Normal More transactions witnessed during usual work hours while weekend spends fall, reversing normal trends"]], "time": [["Last Updated: Apr 14, 2020, 11.05 AM IST"]], "publisher": [[", ET Bureau"]], "article": [[" ", "Lockdown", " plus WFH equals new online shopping behaviour. Office hours are turning into shopping hours, especially for essentials, data shared by companies managing online and offline transactions show. And that weekend spending bulge too has somewhat flattened, with those working from home managing their routines differently.\n", "\n", "“Transactions at retail stores have significantly declined during late evening hours and have been replaced by transactions post-lunch and evenings,” said Rajeev Agarwal, CEO, Innoviti, a leading point of sale (PoS) deployer.\n", "\n", "Nearly 70% of all grocery shopping in the fourth week of March at over 3,000 stores powered by Innoviti happened between the usual working hours of 10 am to 7pm – up from 57% in the first week of February. Only 9% of spends were made post 7 pm in March – this used to be around 37% in February.\n", "\n", "And while weekend spends at these stores used to be between 150% and 180% of weekday spends during pre-lockdown period, the difference has come down to 75-100%, according to Innoviti data.\n", "\n", "“Some volumes are affected due to early closure of shops in many cities…forcing customers to alter their spending patterns,” said K Srinivansan, chief revenue officer, FSS, a payments solution provider for banks. Also, average purchase order value increased in weeks following lockdown, implying a tendency towards hoarding.\n", "\n", " \n", "\n", "\n", "Contactless Payments", "\n", "“Ticket size for essentials like ", "groceries", " and pharmaceutical products has risen by over 75% during the lockdown period,” said a PhonePe spokesperson. “We are seeing over 50% increase in transactions in recharges/ DTH categories. In an interesting trend, users are recharging not only for themselves but also for family and friends.”\n", "\n", "Online utility billers have also seen similar patterns. Rohit Kumar, CEO, XPay.Life, a bill payment platform said, “most of these transactions take place before lunchtime and in the evening.”\n", "\n", "Meanwhile, modes of payment where the need for physical interaction such as those made through contactless cards, QR codes and even directly through UPI Ids have witnessed increased adoption in the lockdown weeks. This is in line with advisories by banks and regulators promoting the use of all contactless modes of payments as “the safer way to pay.”\n", "\n", "“Payment service providers are coming up with apps that alert consumers about merchants near them who use UPI,” said Praveena Rai, COO, National Payments Corporation of ", "India", ". “Merchants are also sending across UPI IDs. These solutions were not popular earlier and have evolved just in the last few weeks.”\n", "\n"]], "tags": ["shopping habits", "lockdown", "India", "groceries", "Work from home", "contactless payments"]},
{"heading": [["Tata Technologies supports Sahapedia's Pune Cultural Mapping Project"]], "sub_heading": [["\"We at Tata Technologies feel that cultural mapping is an important way to safeguard cultural diversity of Pune, and thus essential to sustainability, which is a core pillar for the company,” said Warren Harris, CEO and Managing Director, Tata Technologies. “We support the project as its endeavor to integrate technology and culture aligns with our core values.”"]], "time": [["Last Updated: Mar 04, 2020, 01.36 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["Pune: \"", "Sahapedia", ", principally supported by ", "Tata Technologies Ltd", ", has undertaken the Pune ", "Cultural Mapping", " project to document Pune’s cultural and natural resources from the past to the present. The information gathered will be available in October 2020 on a free bilingual (English and Marathi) digital map for building awareness, diversity, and ownership of the city,\" a release from Tata Technologies said. \n", "\n", "These resources include, but are not limited to, museums and collections, heritage buildings and places of worship, traditions of food, music, dance, and literature in Pune as well as the natural heritage of the city including water systems, gardens, and hills. These are being documented and reviewed by experts and practitioners in diverse fields such as artists, architects, city residents, institutions, historians, NGOs, and others. In the last five months, the project has partnered with approximately forty collaborators and has on-board more than fifteen field and desk student interns in Pune.\n", "\n", "On March 3, 2020, the prototype of the web resource developed in partnership with ", "MapmyIndia", " was shared. This prototype shows how the cultural and natural resources of Pune are being categorized and organized in ways that make it easy for residents and visitors to navigate to the information they are looking for or interested in.\n", "\n", "\"We at Tata Technologies feel that cultural mapping is an important way to safeguard cultural diversity of Pune, and thus essential to sustainability, which is a core pillar for the company,” said ", "Warren Harris", ", CEO and Managing Director, Tata Technologies. “We support the project as its endeavor to integrate technology and culture aligns with our core values.”\n", "\n", "J.K. Gupta, CFO, Tata Technologies, said about the launch of the prototype, “We are happy to support Sahapedia for the launch of a beta version of the digital map. The integration of digital technology and the cultural resources of Pune as seen in the map is a first step towards ensuring cultural vitality for the city’s rich heritage.”\n", "\n", "Sahapedia’s Projects Director, ", "Neha Paliwal", " said, \"We see the Pune cultural mapping project as a record of the city as a vibrant center of knowledge-seeking, of social and political reformation, and artistic creativity. It is a way for Punekars—those born here and those who have made Pune their home—to identify what they value about the past and the present of their city, to share it publicly and, hopefully, think about what they want to do with it in the future.\"\n", "\n"]], "tags": ["Warren Harris", "Tata Technologies Ltd", "sahapedia", "neha paliwal", "cultural mapping", "MapmyIndia"]},
{"heading": [["Party, network, socialise: A new hit web series"]], "sub_heading": [["The company has conducted a series of digital events, including book lover meets, open mics and a session where people collaboratively created stories based on their experiences under quarantine."]], "time": [["Last Updated: Apr 21, 2020, 09.15 AM IST"]], "publisher": [[", ET Bureau"]], "article": [[" Millennials stuck at home and bored are going online to ", "party", ", network and ", "socialise", ".\n", "\n", "And, companies like ", "Paytm Insider", ", ", "MyScoot", " and ", "BookMyShow", ", which relied on physical events earlier, are helping them by taking their offerings online.\n", "\n", "MyScoot, an events and party curator, has seen its users per event swell by 50% in the wake of restrictions imposed after the Covid-19 virus outbreak, although revenues are still low.\n", "\n", "“There’s no other avenue for people to meet others. To see new faces is difficult,” says Suyash Sinha, chief executive of MyScoot, which has kept ticket prices low to attract users.\n", "\n", "The company has conducted a series of digital events, including book lover meets, open mics and a session where people collaboratively created stories based on their experiences under quarantine.\n", "\n", "After the ", "lockdown", " was announced, BookMyShow started live-streaming concerts, plays and dance performances.\n", "\n", " \n", "\n", "About half a million have tuned in so far.\n", "\n", "The size of the community and engagement levels are growing steadily, says chief operating officer (live entertainment) Albert Almeida. The company has also introduced digital workshops and gaming groups, hosted by individual organisers.\n", "\n", "\n", "\n", "Last Friday, Paytm Insider started beta testing a service with thirtyodd event organisers and artistes. According to chief executive Shreyas Srinivasan, “people will have the ability to participate in the content.” For instance, in an upcoming digital play by Roshan Abbas, the audience can choose which direction the story should head in.\n", "\n", "Srinivisan says the company is looking to become a platform for a wide variety of self-published events. “There’s no reason people won’t pay as much for access to talented artists,” he says, especially since the setting is more intimate and interactive.\n", "\n", "Sinha of MyScoot says that, during a session with musician Akhil Sachdeva, the audience actually switched lights off and swayed to the music with their phone flashlights on. “Just like a real concert!”\n", "\n", "“People, especially women, might worry about going to a gathering of strangers,” says Nadeesh Bhambi, a business manager by day and event host by night.\n", "\n", "The fear is non-existent for online events. Plus, there is the added allure of no dressing up or commute.\n", "\n", "Housie, mafia and antakshari seem to be popular games at digital gatherings. But, it is not just fun and games.\n", "\n", "Network Capital, a subscription service for professionals, has increased its monthly subscriber base by almost 30% since the pandemic.\n", "\n", "About once or twice a week, its members – who live in cities as far apart as Rome, Boston and Delhi – meet for an online “happy hours” session where they talk to each other and socialise.\n", "\n", "Members also log in to exclusive webinars by professionals on subjects ranging from product development careers to ‘panic working’.\n", "\n", "“If you have an hour of free time, you might watch cat videos. But if you have several hours, then you want to spend it productively,” says founder Utkarsh Amitabh.\n", "\n", "Even in co-living and co-working spaces, socialising has now moved online. Co-living space CoHo’s members are now sharing videos of themselves teaching recipes or dance routines.\n", "\n", "Members of Skootr, a coworking space, are playing tambola with each other online, and sharing their stories and experiences. Independent organisers have also taken their meetups online. For instance, Party and Travel Group, a Mumbai-based meetup group with thousands of members now conducts online housie.\n", "\n"]], "tags": ["socialise", "paytm insider", "BookMyShow", "lockdown", "MyScoot", "Party"]},
{"heading": [["Sweeping Star's big-budget acquisition marks up thoroughbred prices"]], "sub_heading": [["Sweeping Star, a bay colt that was acquired by race enthusiasts for a record Rs 41.5 lakh, appears to have changed the fortunes of India's horse breeding industry. The deal has reset race-horse prices at higher levels, and has bumped up sales. "]], "time": [["Last Updated: Apr 24, 2020, 08.55 PM IST"]], "publisher": [[", ET Bureau"]], "article": [["MUMBAI: Nothing is more commonplace than a ‘bay’ colt in ", "racing", ". Reddish-brown with black mane and tail, “bay-coloured” thoroughbreds are rarely paid top dollars for their shiny coats. They are acquired at high prices only if equine experts see immense winning or breeding potential.\n", "\n", "One may never know why veteran trainer ", "Syed Sayeed Shah", " chose a two-year-old bay colt, ‘Sweeping ", "Star", "’, from an auction catalog with over 140 horses. Neither would anyone know why Champaklal Zaveri, a Mumbai-based businessman and race enthusiast, weighed upon Shah’s recommendation and signed a cheque worth Rs 41.5 lakh to buy the reddish-brown horse. But Zaveri did write a fat cheque.\n", "\n", "\"My trainer SS Shah has won the most prestigious race - the Indian Derby - three times, out of which two were in successive years. We both have excellent rapport since long... he trains my horses and I only buy horses after consulting him,\" reasons Zaveri.\n", "\n", "\"When 'Sweeping Star' came in to the auction ring, there were some seven people bidding for it... after some time, there were only two bidders left. We kept on bidding for the horse several times over. That's when the price went really up. The horse was purchased in a syndicate,\" he adds.\n", "\n", "Sweeping Star's record price has given a booster shot to the ailing breeding industry. This deal has reset thoroughbred prices at higher levels, and has bumped up sales numbers as well. \n", "\n", "The RWITC (Royal ", "Western India Turf Club", ") horse auction, held in ", "Mumbai", " this February, booked the sale of 34 horses worth Rs 5.7 crore in total transaction value. The average price of horses sold in the auction ring was Rs 16.75 lakh – up from Rs 12.3 lakh and Rs 10.9 lakh in 2019 and 2018 respectively. Fourteen horses were sold at prices exceeding Rs 20 lakh each, reveals data sourced from RWITC. \n", "\n", "“The market was strong at the top-end… There was significant demand for high-pedigree horses,” says Vivek Jain, former chairman of RWITC.\n", "\n", "“With the prices achieved this year, one can expect better results in 2021,” he adds.\n", "\n", "Indian ", "breeders", " (many of whom are horse-owners too) had been facing headwinds on account of “a foal stock glut” - which started in 2014. Young-stock prices had crashed 40 – 50% in 2015 and 2016. This led to the closure of several stud farms across the country. The cost of raising a thoroughbred (up to two years, when it can be sold) is roughly Rs 7 lakh; during the lull years, several breeders were forced to sell yearlings at a loss (sale price lower than the price breeders spent to raise the horse).\n", "\n", "\n", "\n", "Between 2010 and 2013, Indian breeders imported nearly 700 mares to produce “better quality” foals. Their eagerness to improve the foal stock resulted in a glut with nearly 2,000 babies born a year. Indian race courses are equipped to house not more than 1,250 babies every year; anything above that means a good number of the new-born foals would remain unsold with breeders. Excess supply of yearlings every successive year has put pressure on horse prices ever since.\n", "\n", "“We seem to have gotten out of the glut situation now… It has taken over six years and closure of several mid- and small-sized stud farms to get us here,” says the owner of Haryana-based stud farm.\n", "\n", "Breeders (many of whom are owners too) make money by selling horses or by winning stakes in top races. The third revenue stream is offering “stallion services” - in which stud farm owners with accomplished stallions provide mating services for a fee.\n", "\n", "“The supply of yearling has shrunk, and this probably is supporting the prices… But the industry is still in recession. GST is killing this industry,” says Ravi Reddy, president, Nanoli Stud Farm.\n", "\n", "At present, GST is levied at the rate of 28% on total bet value. ", "Turf", " clubs across the country have been lobbying with the government to lower GST to 18% - chargeable only on commission or service fee retained by the club. \n", "\n", "“Racing survives on betting… if people don’t make money, why will they come to the races?” quips Reddy.\n", "\n", "“Dwindling race attendance is hurting breeders in big way… Not many people want to buy horses to run them at the races any more. There’s no incentive for horse-owners to improve their stock,” adds Reddy.\n", "\n", "This makes the ‘Sweeping Star’ deal portentous for many in the racing world. They see it as a sign of good times ahead. Would the bay colt sprint as fast as cash in its buyers' wallet? Only time will tell.\n", "\n"]], "tags": ["RACING", "Kingfisher Ultra Indian Derby", "mumbai", "breeders", "turf", "star", "Royal Western India Turf Club", "Western India Turf Club", "syed sayeed shah"]},
{"heading": [["India’s elite clubs: Bastions of hereditary entitlement"]], "sub_heading": [["The constitutionality of hereditary membership is questionable, but who among the members will go out and challenge it? There are other implicit issues as well. Many of India’s clubs are private clubs enjoying public land or land that could be deemed as “commons”. "]], "time": [["Last Updated: May 16, 2020, 09.13 AM IST"]], "publisher": [["ET Bureau"]], "article": [["\n", "\n", "The control of the prestigious ", "Delhi Gymkhana", " is now a bone of contention, with the government of India seeking to take over its managing committee. Recently a petition was filed by the ", "Ministry of Corporate Affairs", " (MCA) in the National Company Law Tribunal (NCLT), seeking action under Sections 241 and 242 of the Companies Act, which allows a member of a company or the government to seek relief if the affairs of the entity are being run in a manner “prejudicial to public interest” or is “oppressive”, among other things. The government had used the same provisions of the ", "Companies Act", " to get the ", "NCLT", " approval to supersede the board of the bankrupt IL&FS in October 2018.\n", "\n", "Incredibly, the central government has cited “parivarvaad” or nepotism, financial irregularities, misuse of allocated land and issues related to membership as the primary reasons for it to acquire the club. While it is at it, it might as well take a look at all other such elite clubs, where nepotism is more rampant and where the real estate is often bigger and more valuable.\n", "\n", "Every major city in India has such clubs. Most of the better-known ones are relics of the Raj and were meant as a private place for the ruling elite to socialise and fraternise. Being the ruling elite they gave themselves tracts of public land for their private enjoyment. At a time when the whole country was for their private enjoyment this raised few questions. After the white man departed, these clubs became a preserve of the new Indian elite – many called them the brown sahibs. But unlike the white colonials who came to India as a selected elite by undergoing a rigorous process, the new elite is now mostly a hereditary elite.\n", "\n", "Generally speaking an elite means a more capable group of people. In sociological terms an elite is a group of people who control a disproportionate share of wealth or power. C. Wright Mills, in ‘The Power Elite’, describes the power elite as \"those political, economic, and military circles, which as an intricate set of overlapping small but dominant groups share decisions having at least national consequences”. But most of our “elite” clubs defy such descriptions and have ceased to be based on social or official hierarchical or professional considerations, where membership was dependent on attainments and achievements. They are increasingly an association of neither the more capable people or a social elite or a power elite. They are just social clubs where membership is dependent on birth. The term “parivarvaad” used by the government in its petition describes a uniquely Indian system that combines dynastic succession and clan nepotism.\n", "\n", "Clubs all over India are being increasingly taken over by a hereditary membership. Most of these clubs have framed rules for themselves, which automatically confer their children membership, by virtue of being dependent members, a classification for member’s children of a certain age group. Since these dependents are given priority, it is almost impossible for a non-dependent to become a member. Most people who become members through the direct route do so late in their life, which means their children invariably cannot become dependent members.\n", "\n", "The constitutionality of hereditary membership is questionable, but who among the members will go out and challenge it? There are other implicit issues as well. Many of India’s clubs are private clubs enjoying public land or land that could be deemed as “commons”. The term “commons” refers to the cultural and natural resources that should be accessible to all members of a society, including natural materials such as air, water and a habitable earth. The “common good” is a utilitarian ideal meaning “the greatest possible good for the greatest possible number of individuals”. Many, like the philosopher Michael Sandel, believe that promoting the “common good” should be the main ideal of a democracy. Implicit in this is that the “commons” must only be for the “common good”.\n", "\n", "In 2014, Arvind Kejriwal, then making an entrance into national politics specifically referred to the ", "Delhi Golf Club", " as a prime instance of corruption and cronyism that allowed a small number of people take possession of public property. But like the Delhi Gymkhana, the Delhi Golf Club comes under the jurisdiction of the central government.\n", "\n", "Compared to the 27 acres of land occupied by the Delhi Gymkhana, the Delhi Golf Club is in possession of 220 acres of common land and enjoying it for the exclusive benefit of 3,000 “members” of whom only 900 have the right to vote, and most of these are hereditary members.\n", "\n"]], "tags": ["Companies Act", "Delhi Gymkhana", "nclt", "ministry of corporate affairs", "Delhi Golf Club"]},
{"heading": [["Amazon.in, Snapdeal in US 'Notorious' markets list"]], "sub_heading": [["In all, the US Trade Representatives' (USTR) annual list has 38 online markets and 34 physical markets that are reported to engage in or facilitate substantial trademark counterfeiting and copyright piracy. Other than Snapdeal, the four markets are Tank Road in Delhi, Heera Panna in Mumbai, Kidderpore in Kolkata and Millennium Centre in Aizawl. "]], "time": [["Last Updated: Apr 30, 2020, 12.00 AM IST"]], "publisher": [["Agencies"]], "article": [["New Delhi: Amazon.in, ", "Snapdeal", " and four Indian shopping complexes have figured in the US' 2020 edition of the '", "Notorious Markets", "' list for counterfeiting and piracy. The US trade representative's (USTR) office listed Amazon's web domains in India, Canada, France, Germany and the UK, along with four markets in India -Tank Road in Delhi, ", "Heera Panna", " in Mumbai, ", "Kidderpore", " in Kolkata and ", "Millennium Centre", " in Aizawl. Amazon meanwhile termed it an act of political vendetta.\n", "\n", "\"We strongly disagree with the characterisation of Amazon in this USTR report. This purely political act is another example of the Administration using the US government to advance a personal vendetta against Amazon,\" an Amazon spokesperson emailed when asked for comment.\n", "\n", "\"We are an active, engaged stakeholder in the fight against counterfeit, and we call on lawmakers to increase funding and resources for law enforcement agencies so we can hold the real criminals accountable,\" the spokesperson said.\n", "\n", "In all, the USTR annual list has 38 online markets and 34 physical markets that are reported to engage in or facilitate substantial trademark counterfeiting and copyright piracy.\n", "\n"]], "tags": ["SnapDeal", "notorious markets", "Heera Panna", "Kidderpore", "Tank Road", "Millennium Centre", "Ajmal"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["IANS"]], "article": [[]], "tags": []},
{"heading": [["UK court orders Anil Ambani to pay USD 717 million to Chinese banks"]], "sub_heading": [[" UK court orders Anil Ambani to pay $717 million (Rs 5,448 crore) to 3 Chinese banks in 21 days."]], "time": [["Last Updated: May 23, 2020, 10.48 AM IST"]], "publisher": [["ET Bureau"]], "article": [["MUMBAI: A UK court has ordered ", "Reliance Group", " chairman ", "Anil Ambani", " to pay $717 million (Rs 5,448 crore) to three Chinese banks within 21 days, after ruling that a personal guarantee which the Indian businessman had disputed was binding.\n", "\n", "A spokesperson for Anil Ambani said he was seeking legal advice on the future course of action. \"As far as the judgment of the UK court is concerned, the question of any enforcement in India does not arise in the near future,\" the spokesperson said in a statement.\n", "\n", "The UK order will also not have any bearing on the operations of other Reliance Group companies - Reliance Infrastructure, Reliance Power and Reliance Capital, the statement said.\n", "\n", "Legal experts, however, said if Ambani didn't pay in the next 21 days, the lenders would have the option to \"pursue all available options for enforcement of order\", which could include \"going after his personal assets and wealth\".\n", "\n", "Justice Nigel Teare of the Commercial Division of the High Court of England and Wales in London in his order earlier this week also asked Ambani to pay another 750,000 pounds as court costs.\n", "\n", "\n", "\n", "The judge also vacated a trial date in the case previously set for March 18 next year.\n", "\n", "The latest direction is the outcome of the legal route taken by three Chinese banks — Industrial & Commercial Bank of China Ltd, China Development Bank and Export-Import Bank of China — which had sued Ambani in London for allegedly failing to repay $708 million of loans, including interests. The loans were taken by his company, ", "Reliance Communications", ", and according to the banks he was a personal guarantor to the loans. Ambani had denied providing authority for any guarantee.\n", "\n", "In February, the UK court directed him to pay $100 million in six weeks as part of an interim order. At the time, the court had ruled that it did not accept Ambani’s defence that his net worth was nearly zero or that his family would not help him out if things got really tight for paying up the $100 million.\n", "\n", "RCom has now gone into insolvency under a debt of Rs 46,000 crore. “As per the UK court order, the final amount owed under the alleged guarantee will be assessed based on the outcome of the RCom resolution plan filed before NCLT, Mumbai,” Ambani’s spokesperson said.\n", "\n", "Once RCom’s resolution happens, the amount ordered to be paid will reduce, he said.\n", "\n", "“The amount claimed under the alleged guarantee will reduce by up to 50% as per the resolution plan for resolution of RCom’s debt which has been approved by 100% of RCom’s lenders and has already been filed in the National Company Law Tribunal on 6 March 2020,” his statement added. UV Asset Resolution and Reliance Jio Infocomm are set to be declared the preferred bidders for RCom’s assets.\n", "\n"]], "tags": ["UK high court", "Anil Ambani", "Reliance communications", "Exim Bank of China", "Reliance Group", "corporate loan"]},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["Reuters"]], "article": [[]], "tags": []},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ANI"]], "article": [[]], "tags": []},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [["ET Online"]], "article": [[]], "tags": []},
{"heading": [[]], "sub_heading": [[]], "time": [[]], "publisher": [[]], "article": [[]], "tags": ["UK high court", "Anil Ambani", "Reliance communications", "Exim Bank of China", "Reliance Group", "corporate loan"]}
]